{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Pauline and Shon's story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"OUQZ54q3qO\"><a href=\"https:\/\/care4calais.org\/news\/pauline-and-shons-story\/\">Pauline and Shon&#8217;s story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/pauline-and-shons-story\/embed\/#?secret=OUQZ54q3qO\" width=\"600\" height=\"338\" title=\"&#8220;Pauline and Shon&#8217;s story&#8221; &#8212; Care4Calais\" data-secret=\"OUQZ54q3qO\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/12\/Pauline-copy.jpeg","thumbnail_width":745,"thumbnail_height":686,"description":"&nbsp; When asylum seekers arrive at their dispersal accommodation or hotel in the UK, they’re given a Primark T-shirt, pyjama bottoms, and some flip flops.  And that’s it. All that these often-traumatised people are entitled to when they reach this country, the fifth-richest in the world, looking for safety. Such meanness and unfairness is a big reason why I volunteer to help refugees and asylum seekers here.  My name is Pauline, and through the pandemic I’ve been volunteering with Care4Calais at hotel and dispersal accommodation. The hotel I look after has around 250 people in it, many sharing rooms. Mostly single men, but one or two families as well – although the families get moved on quickly. It’s hard work and overwhelming at times, but I carry on because they need me; when you have seen someone cry because you gave them new shoes you know you can’t stop.  I first got involved with the hotel after seeing a Care4Calais Facebook post showing some people going to a hotel and deriding refugees who were staying there. A friend of mine recognised the hotel as one just up the road from us, and said we should go with placards saying “Refugees Welcome”.  I agreed, but said that as placards alone don’t do much, we should also take some nice things to give out. So we packed some bags of lovely things to give to the refugees, snacks, fruit, jigsaws, things like that, and we set off.  However, when we got to the hotel the Serco staff in charge wouldn’t let us in. No one knew what to do. Serco began threatening to call the police. The other people I had come with weren’t sure what to do, but I refused to give up. I saw some refugees standing outside the hotel, and went to talk to them.  One of them told me to wait while he fetched an English-speaking friend from inside the hotel, and came back out with Shon and a few others. We showed the refugees our placards, they took some of our clothes, and my phone number. I’ve been busy ever since.  Shon – that’s him in the picture with me and my grandson – has become my friend and helped me with so many refugees and the problems they have. He is a remarkable young man, and so eager to help.  The hotel and Serco still won’t let me inside, so I have to meet people outside to give them things. I go to the hotel three or four times a week to deliver what I have. I don’t always have everything they need, but our local Facebook is a great source of donations.  I buy a lot of the underwear, socks and toiletries myself when they first arrive, as it gives a bit of dignity and it is a lovely feeling doing good. Luckily I live alone and have a relatively big house, but even so it’s filled with donations &#8211; it looks like a bomb went off in a jumble sale!  I work full time too at a college teaching biology, so things can get very demanding, but it’s all worth it to support these people who need our help &#8211; they have no one and nothing when they arrive, and with the government not fulfilling its duty of care, it’s something we all should do.  There is so much good will out there, and my MP Mike Amesbury has been amazing. He has written letters to find a home for a family and helped various other asylum seekers with specific issues. Not all MPs are helpful but he’s been a saviour at times.  Then there are others who help in little ways &#8211; like the woman in the Oxfam shop who couldn’t find the price tag at £4.99 but miraculously found a new one at £1.99 for a lovely jacket for a young refugee. Together we can make a difference, we really can and to some I have made that difference and will continue to do so.  But first I must get my house tidy &#8211; anyone feel like helping? Pauline, volunteer, North West England &nbsp;"}