{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Sadam's Story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"Zg24da2lv4\"><a href=\"https:\/\/care4calais.org\/news\/sadams-story\/\">Sadam&#8217;s Story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/sadams-story\/embed\/#?secret=Zg24da2lv4\" width=\"600\" height=\"338\" title=\"&#8220;Sadam&#8217;s Story&#8221; &#8212; Care4Calais\" data-secret=\"Zg24da2lv4\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/09\/sad.png","thumbnail_width":940,"thumbnail_height":788,"description":"I knew I had to leave Sudan after I was arrested and beaten by the police. I was going to join a demonstration against President Al Bashir when soldiers grabbed me and took me to the cells. They beat me so hard with everything they could find – iron bars, sticks, hands and guns. Then they kicked me in the head and face so many times with their steel-toe capped boots. As they did it they were cursing all the time, things I had never heard before I was so humiliated. The beating caused so much pain and noise in my head. It has never away. When I finally got out I decided I had to leave Sudan, because I thought the next time they would kill me. I didn’t tell anyone at all I was going. I just ran. My name is Sadam and I class myself as Sudanese, from the capital Khartoum, although I was born in Tripoli, Libya and grew up there. I had a good childhood, got a good education, and in 2010 I went to do a banking and finance degree at university in Khartoum. That was just before the fall of Gaddafi and Libya’s disintegration. After university I did the mandatory year’s national service, but when I went back to Khartoum I was shocked that I couldn’t get a job related to my study, because I wasn’t a part of the ruling political party. I couldn’t go back to Libya either as the country had changed and I was no longer welcome, so life became difficult. I had to do lots of different jobs like repairing mobile phones and working in a restaurant, but then in 2018 the revolution against Bashir started. I joined the protests everyday and I was detained and beaten up many times – every time I ran away and they’d catch me again. But then I had the serious beating, and I knew I had to leave. My only choice was to go to Chad and then Libya. I couldn’t go to Egypt because you need money to get over the border, but I thought I’d be OK in Libya because after all I’d grown up there. But the country had changed so much. It was a very scary place. In south Libya there are many tribes who catch refugees coming over the border, and if the refugees can’t pay a ransom, their captors put them in a big warehouse and sell them to whoever needs workers. I was in this system over a year, I worked on a farm and carrying bricks. When you had finished work they sold you on to another person. Finally I escaped and I made it to Tripoli where I met someone who could get me to Europe, where I my brother lived. I paid the smuggler, and I went to the boats. It took five nightmare days to cross. After two days we ran out of petrol and no one could get a phone signal so we just floated for two and a half days more. In the day you could just see sea and sky and where they joined it was the same colour. At night the waves were high and threw the boat around, we were waiting to die. On the fifth day we must have floated into a network range as someone got a phone signal. The red cross came and rescued us and took us to Italy. After being in quarantine for 10 days in Italy we were told to walk to the train and get out of the country. With some others I went from train to train, sometimes sleeping on the train and sometimes in the station; finally we got to Ventimiglia in and stayed in a camp there. Many times I tried to cross the mountains and forests on foot, but everytime the police caught me and sent me back. Then one day I met you someone who would get me over the border for money. He had the keys to some lorries and one night he got me onto one. The lorry stopped in Marseille, and I got out there and stayed for a long time, living in the station. Eventually I went to Paris but that was worse, and I had to survive on the streets. Then I heard that in Calais there were organizations that would help me, and so headed off to northern France. I met Care4Calais there. They allowed me to survive. They gave me clothes and food and some shelter. I really would not have minded staying in France, but there was no help from the state, no one to help me understand what I needed to do to be able to stay in France. So that left the UK. I hated the thought of getting on a boat and travelling on the sea again. I tried the lorries but they are so hard to get on and dangerous, you have to run behind them to try to find one you can get on. One of the refugees I was with fell from the lorry he was on and he was trapped under the wheels, he died that way, it was horrible. So I ended up getting a boat. I said it was better to die in the sea than stay in France and live like a beggar being chased from place to place. On the 12th of June I got to the UK. I was sent to a hotel in Bristol after Dover. I was happy to be here, straight away I felt safe in the hotel. I was thinking I could have a future and maybe have help for my head injuries. Josie, a Care4Calais volunteer said she would help me find a doctor to treat them. But then I got the letter that said I had to go to Rwanda. This was not a good day. In my hotel so many people have mental health problems, [&hellip;]"}