{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Meet Seema, superhero volunteer! - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"U3EKwhvY4I\"><a href=\"https:\/\/care4calais.org\/news\/meet-seema-superhero-volunteer\/\">Meet Seema, superhero volunteer!<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/meet-seema-superhero-volunteer\/embed\/#?secret=U3EKwhvY4I\" width=\"600\" height=\"338\" title=\"&#8220;Meet Seema, superhero volunteer!&#8221; &#8212; Care4Calais\" data-secret=\"U3EKwhvY4I\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/12\/Untitled-design.jpg","thumbnail_width":2000,"thumbnail_height":1414,"description":"&#8220;I don&#8217;t think about problems any more, I think about telling people about the challenge so they can come forward to help. They always will, because people are brilliant, and they want to help others! &#8220;That&#8217;s what I&#8217;ve learned volunteering with Care4Calais – every single time there&#8217;s been a crisis, people have been amazingly kind, and that kindness has spread. So I don&#8217;t just have faith in the good side of human nature – I am absolutely astounded by its power!&#8221; This amazing, inspirational and incredibly energetic woman is Seema, our lead volunteer in South West London. As well as being a ski instructor, school governor, mum of five kids and climber of mountains for charity, she somehow finds time to run a team of 80 active volunteers looking after refugees in a large stretch of the capital. Seema&#8217;s also a wonderful and much-loved support to refugees personally who can always find time to help people in need. This week she&#8217;s been on a maternity ward helping a former asylum-seeking lady as she gave birth to a baby daughter. &#8220;I&#8217;d helped her find accommodation when she got leave to remain,&#8221; she says. &#8220;When she was in hospital she phoned me to say she was afraid, and people were all talking over her. I went in and she cried when she saw me. Her partner was there and you said &#8216;when you arrived, it was the first time her heart her blood pressure has gone down.&#8217; Wow. It&#8217;s good to know you&#8217;re helping, because so often people in this situation don&#8217;t have others they can turn to.&#8221; Volunteering for Care4Calais began in 2017 for Seema began in 2017, when she and her husband began helping in Calais. &#8220;Once I was sitting with some Iranian guys at one of the sites, and it starting to rain. They said &#8216;You know, we are treated worse than animals here, because they take away our tents, our shelter. We sleep on the floor, with the snakes.&#8217; I never forgot that.&#8221; In 2020 we asked Seema if she could help an asylum seeker at a hotel in her area, and she agreed. Realising that there were other refugees in the hotel, but not allowed in to meet them, she began going down with fresh fruit at the same time each week, and waiting outside. Word got around, and soon she was able to ask people what else they needed, and begin sourcing it. She still brings that same resourcefulness and determination to everything she does for refugees, and is a wonderful leader. Her highlight of working with Care4Calais to date? &#8220;Oh, that would be when I got my free Oyster card at 60. The first thing I used it for was to travel to protest outside the Home Office.&#8221; Seema&#8217;s parents were from Lucknow in India, and went to Pakistan during the Partition. They came to the UK when she was two, using the money her collefe-professor dad father earned from writing a book about the Sultan of Swat. At 18 she had an arranged marriage, but it only lasted five years &#8220;Luckily my parents were supportive when it broke up. I&#8217;ve now been married 30 years to someone who is Christian, whilst I am Muslim.&#8221; If it&#8217;s taught her one thing, she says, it&#8217;s that life chances are &#8220;a lottery depending on where you are born, and it&#8217;s circumstances that lead you in desperation to flee. It could be anyone of us, so we should be compassionate.&#8221;"}