{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Nathaniel's Story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"YOWAaLr6Cx\"><a href=\"https:\/\/care4calais.org\/news\/nathaniels-story\/\">Nathaniel&#8217;s Story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/nathaniels-story\/embed\/#?secret=YOWAaLr6Cx\" width=\"600\" height=\"338\" title=\"&#8220;Nathaniel&#8217;s Story&#8221; &#8212; Care4Calais\" data-secret=\"YOWAaLr6Cx\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/09\/obeid.png","thumbnail_width":1080,"thumbnail_height":1080,"description":"Even now that I have made it to the UK and I feel safer, I have such difficult feelings and thoughts. I had to leave my mum and sister in Sudan and now they are suffering and I feel so guilty. My dad is dead and my uncle, who used to help my mum, was imprisoned when I got out of Sudan. I’m only 17 but I feel I should go back to help them – but if I did I think I would be killed. It makes me feel bad. I don’t like to think about it as I can’t control my thinking. My name is Nathaniel, I’m from Darfur in Sudan and I’m 17. In Darfur I went to junior school, but we were poor and my dad died when I was small, so I had to leave school and work to help with money at home. At first I worked on a farm near our village and then I was working in a small shop selling sweets and cigarettes, small things like that. It was just a small store like so many others in Sudan, but that’s where my problem started. The problem was it was near the university. Before the revolution it was good because there were so many students who wanted to buy things.One day about a year ago, the government militia came and told me to close it. They said I opposed the government and was causing trouble. I said I wasn’t at all, I was just trying to make some money, but they arrested me and locked me up in a prison. I was there for maybe a week. They tortured me by throwing scalding water on me, and using their cigarettes to burn my hands and arms. I had to sleep on the floor. After a week they made me sign a paper saying that I would not go to the doctor to treat my wounds, I would not leave Sudan, and I would to spy for them. After that they put me in a cattle truck, and drove it out into the desert and threw me out onto the road and left me there. I managed to stop a someone in a car, and they took me back to the city. I went to my uncle’s house, and he said I had to leave Sudan. He said once they had your name you would never be left alone, they would follow you and steal your things and never let you go. I didn’t know how to leave, but my uncle said he would find someone to get me out of the country. Soon I got instructions to get into another cattle truck. These are big trucks with open backs, and they can fit many people inside. My truck set off driving across the desert towards Libya. It took 13 days to reach the border, a long time because we had trouble getting past the gold digging areas. There was lots of fighting and conflict going on there, and it was very dangerous. We had to hide from the militia that controlled the gangs. Through all that time we had maybe two hours of sleep at night, and hardly any food or water. As soon as we got over the border I was arrested along with the other Sudanese people in the truck. They men who arrested us wanted money to let me go, but I had nothing and I knew I couldn’t get anything. They said, “You must pay, or you’re going to prison.” I had to choose prison, but when they took me thereI saw it wasn’t really a prison, just a house that they kept us in. After a while a man came to the house, I think to try to persuade them to let me go becuase I was only 16. He asked me how old I was, and I think he felt sorry for me. Anwyay, when they were all talking, I noticed the door behind them was unlocked behind them. Moving so they didn’t notice, I got to the door, opened it – and then I ran. I ran so fast, never looking back. I I don’t know if they chased me or not. I just ran looking for somewhere safe. I found a man who said he’d keep me safe, but then he said I had to work on his farm for free. I said I didn’t want to do that but he pulled a gun out and threatened me, so I had no choice. He would have shot me if I refused. You have to understand that our lives are worthless to people like them. On the farm I found other Sudanese people who worked for the man. Some of these Sudanese were smugglers, and I made a deal with one of them to get out. He told me get in a truck he was driving, and be quiet. He said if I made one noise I would be killed. It took two days to get across the sea to an Italian island called Lampedusa, in between Libya and Sicily. The Red Cross met us there and gave us some food. We were soon transferred to mainland Italy, where the police asked if I wanted to stay in Italy to give my biometrics, or go back to my country? I didn’t want to do either. I had no plan to go to the UK at that point, but there was no help in Italy, and I didn’t want to stay. I decided to move on, so I ran away again. They didn’t follow me, I don’t think they really cared. Then I had some real luck. I got into a lorry in Milan with some friends, and it went all the way to Calais without stopping! It took about two days, so wasn’t that bad although I was a bit cramped by the time I got out. Since we were in Calais I [&hellip;]"}