{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"The power of language - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"3wKm6DxRBa\"><a href=\"https:\/\/care4calais.org\/news\/the-power-of-language\/\">The power of language<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/the-power-of-language\/embed\/#?secret=3wKm6DxRBa\" width=\"600\" height=\"338\" title=\"&#8220;The power of language&#8221; &#8212; Care4Calais\" data-secret=\"3wKm6DxRBa\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/02\/Untitled-design-4.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"&nbsp; Today was a good day, and I learned something too. We are It was at a food distribution on a new site in Dunkirk. I was working on the milk and sugar part of the hot drinks station with another volunteer, and at first things felt quite bleak, and many of the people there had recently been evicted from their last site. We decided that to try to make a little difference that day, we’d try to learn words for “milk”, “sugar”, “how many?”, “one”, “two”, “three”, in the refugees’ own languages, use those words rather than English all afternoon. The response was amazing! The first two men who came up to ask for sugar were from Kurdistan, and we asked, “How do you say sugar in your language?” “Îeker.” This broke the barrier immediately, as it took 5 attempts and lots of laughs for us to get our pronunciation correct. During this time, more and more people were coming up for sugar and milk and wanted to teach us more words, and hang around to see how we sounded saying it to the next man who came along . Before we knew it, we had a whole group of people wanting to teach us new words. That led to talking and chatting generally, and just comfortably hanging out. It made me realise how important language is – sharing a language with someone breaks down barriers, and can make us feel safe, secure and give us a sense of community. I thought about when I’ve travelled to places that are different from my home my own experience. It made me feel nervous, uncertain, and vulnerable, even scared. So imagine how it feels to be a refugee in a country where you don’t understand the language, and you’re often met by people who are hostile to you for no real reason. The refugees we talked to were nice, kind men, and the conversations about language led to them telling us about why they wanted to come to the UK. The most common reason among the people we met was that they knew the English language. Not one person here said they were interested in any material benefits. The point was that they felt knowing a bit of the language would give them a sense of security, compared with the uncertainty and vulnerability they had faced in their home countries – and now, so unfairly, also felt in France. I felt proud that Care4Calais could at least bring a moment of friendliness and understanding to these people who have been through so much already. If you can volunteer or donate, please go to care4calais.org"}