{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Helping refugee children walk on air - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"lC40NNuh0e\"><a href=\"https:\/\/care4calais.org\/news\/helping-refugee-children-walk-on-air\/\">Helping refugee children walk on air<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/helping-refugee-children-walk-on-air\/embed\/#?secret=lC40NNuh0e\" width=\"600\" height=\"338\" title=\"&#8220;Helping refugee children walk on air&#8221; &#8212; Care4Calais\" data-secret=\"lC40NNuh0e\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/12\/Crowd-1.png","thumbnail_width":654,"thumbnail_height":558,"description":"&nbsp; I’ve just the most amazing day with some of the refugee children I help out with. A brilliant inflatable theme park called Inflata Nation donated a play session for our refugees, and it was incredibly uplifting to take these innocent children there, and see them smiling, laughing and playing &#8211; finally being able to do what all children should be doing! There was one little moment that stood out for me. A nine-year- ld boy who I’ve known since I started volunteering was hot after playing, and he came up to me to ask for a glass of water. There was something about the humble nature of his request that made me feel a little emotional. There were lots of refreshments on offer, but he expected nothing other than water – this is the way with all the refugees I’ve met – they only ask for the basics, and for what they need to survive. I’ll never forget the look on his face when I offered him the choice of different flavoured slushy drinks! I’m a Care4Calais lead volunteer for Wolverhampton, and this was the first time I’ve organised a big event &#8211; we had approximately 130 Afghan Refugees and Asylum Seekers of different nationalities from Wolverhampton, West Bromwich and Walsall. It really warmed my heart to see the difference it made to everyone. So many people kept on repeatedly thanking me and, to my surprise, asking to take photos with me. Afterwards they sent me lots of thank you messages with beautiful words: “Thank you from the bottom of my heart for what you do for people”; “My son said that my best night in England was last night and we owe it to you.” I responded to these messages saying everything good that happens is thanks to God. One really fantastic aspect of it all was all the people who were willing to help. Andrew, the manager at the West Bromwich Inflata Nation, and his team were so generous and kind; Fahim the Afghan Community &amp; Welfare Centre in Walsall organised the delicious food, which was supplied and delivered by Tandaks Punjabi Street Food in Birmingham; Toy Appeal donated advent calendars; Denise arranged transport, and lots of Care4Calais volunteers also helped. I love my volunteering role, and I feel honoured to meet all these families. They even got me bouncing myself. At one point a four-year-old girl who I had never met before, grabbed my hand, and was adamant that I should climb and jump with her. Although I’m a wimp, I did as this little princess said, as I was so touched that she wanted me to play with her (although thankfully I did get out of going on the slide🙃). I would never want to stop supporting them (even if I did have balls thrown at me by a 10-year-old 😂). And as they are in England, there are no barriers for me to help them. Today reminded me that even if I can’t change the world, I can make a positive change to someone’s world 💗 Harvi, Care4Calais lead volunteer, Wolverhampton @thetoyappeal @inflatanation @tandaks @AfghanCW"}