{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Meet Elizabeth, a hero changing refugee lives with tech - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"i1GNkeg3P3\"><a href=\"https:\/\/care4calais.org\/news\/meet-elizabeth-a-hero-changing-refugee-lives-with-tech\/\">Meet Elizabeth, a hero changing refugee lives with tech<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/meet-elizabeth-a-hero-changing-refugee-lives-with-tech\/embed\/#?secret=i1GNkeg3P3\" width=\"600\" height=\"338\" title=\"&#8220;Meet Elizabeth, a hero changing refugee lives with tech&#8221; &#8212; Care4Calais\" data-secret=\"i1GNkeg3P3\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/12\/Unknown-3.jpeg","thumbnail_width":1600,"thumbnail_height":1200,"description":"This is Elizabeth, a really wonderful person who has literally changed the lives of some refugees in the North East. She helps many of the refugees we support here get access to computers, which can make a huge difference to them. We always want to help when people ask us for tablets, laptops and computers, and one of our volunteers, Sarah, noticed that Elizabeth had donated some to Care4Calais. Sarah got in touch, and now we have a great relationship with a rather remarkable woman. Elizabeth runs a computer repair and assistance service, and is often asked by customers if she wants their old machines. She decided to start passing them on to Care4Calais because she &#8220;feels great sympathy for refugees, and I knew these were the people I wanted to help.&#8221; Elizabeth&#8217;s sympathy dates back to her childhood. Now 84, she was born two years before the start of World War 2, and when she was a baby, her parents shared their home with a Jewish refugee from Germany. He was a photographer, and took a picture of her for her parents. &#8220;My parents thought what was happening in Germany was terrible, and so they wanted to help. The photo their guest took is one of the first anyone took of me, so it always seems like a reminder in a way.&#8221; &#8220;It&#8217;s horrible to see what the refugees in Calais have to go through, and how they&#8217;re demonised. I don&#8217;t believe the majority of people feel hostile to them. I live near a beach on the south coast, and one day a refugee boat landed near us. I took my grandchildren down to see what was happening, and there were lots of local people on the beach. All of them were cheering the refugees.&#8221; Elizabeth started working with computers when a family member bought her a Mac Classic in 1995. &#8220;He said he thought I might enjoy it. It came with lots of thick manuals, and I loved working through a manual, and I gradually taught myself how to use it. I really enjoyed it, and from there it&#8217;s been a natural progression to helping other people. &#8220;I know IT equipment can mean that people can stay in touch with their families, and for people with families here it means their children can do homework from school, so I feel happy to know I&#8217;m helping.&#8221; &#8220;I think the refugees could be a great asset to our country helping to work in the industry care and hospitality, where we need more people. I also think we&#8217;re so fortunate to live in a safe and prosperous country, and we need to share this with people fleeing from repression, torture, famine and poverty.&#8221; Elizabeth, volunteer To contribute to our work with refugees in the north east of England, go to peoplesfundraising.com\/fundraising\/care4calais-north-east"}