{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Medhanie's Story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"ufqotWkBoX\"><a href=\"https:\/\/care4calais.org\/news\/medhanies-story\/\">Medhanie&#8217;s Story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/medhanies-story\/embed\/#?secret=ufqotWkBoX\" width=\"600\" height=\"338\" title=\"&#8220;Medhanie&#8217;s Story&#8221; &#8212; Care4Calais\" data-secret=\"ufqotWkBoX\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/ff431b95-5e40-41f4-9a81-8a0f0ae50e35.jpg","thumbnail_width":968,"thumbnail_height":780,"description":"“I spent years travelling to escape from Africa,” the text message read. “Why would I go back there? I would rather be dead.” The message was from Medhanie, a young Eritrean refugee I first met when he arrived in the UK two years ago after a long and horrific journey. For those two years he has been patiently waiting for his asylum interview, but recently he has begun frantically messaging me. The reason, of course, is the government’s announcement that it will send asylum seekers to Rwanda.  I try to assure him it was only a threat to recent arrivals but he does not trust anyone. After the experiences he has had, you can’t blame him. Like many of the young men I meet as a Care4Calais volunteer, Medhanie came from a rural area, in this case in southern Eritrea. His family had a small plot of land and some goats, and he studied carpentry and plumbing, working for a short time before being called up for national military service.  All Eritreans between 18 and 40  must do active military service, but the trouble is that is harsh, the pay is very low or non existent, and for some it goes on indefinitely. In 2011 Medhanie was sent to a town called Tesseney, in the west of the country. After serving for a few years Medhanie decided enough was enough, and ran away from the military to hide out in his home town. Army officers came looking for him, searching the area and threatening his family. Deserters can be shot, or sent to one of the dangerous border posts, and Medhanie realised he was in serious danger. He had never thought about leaving the country before, but now that seemed his only choice.   In 2015 he crossed the border into Sudan, and made his way to Khartoum where he started working.  Then one day in May 2016 soldiers came for him, and he was taken to prison. Until now, his family had stayed in touch with him, and knew where he was; now, though, to their alarm, he just stopped answering calls, and seemed to vanish.  They had no idea what had happened until one day his sister saw a picture of her brother on the internet. The story with the picture said he had been arrested, and extradited to Italy.  It was a shocking case of mistaken identity. The British and Italian authorities had accused him of being a notorious people smuggler called the General and put him in prison. This was despite many people –  including the General’s family and several of his victims –  testifying that Medhanie was not the notorious smuggler. Eventually, after three and a half years of Medhanie being imprisoned, a judge threw his case out, and he was released. But this vulnerable young man was just released to the street; he was now homeless and destitute, and knew he could not stay in Italy.  He believed he would be safe in the UK, and so made his way up through France to Calais. He made it to the UK in the back of a lorry two years ago, which is when I first met him. I was shocked at his appearance; he’d lost so much weight, his hair was unkempt and the light of hope had gone from his eyes. And to make things worse, his claim is complicated because he had been offered refugee status in Italy; understandably, because of his time on the streets, he did not want to stay there.  The Home Office says it does not need to give a time limit to process his claim, and as soon as it is able it will send him back to Italy. Medhanie is terrified this will happen or, worse, he will be sent to Rwanda. “I have been wandering lost for eight years now,” he says. “Going from place to place but never finding safety. I was just a small farmer and plumber at home. KI have never hurt anyone.”  The time in limbo has devasted Medhanie’s mental health, and he really needs a positive decision to move on with his life and begin to heal. There is no happy ending to this tale, and it is one we will watch closely. Without Care4Calais volunteers and the Access Team so many young men like Medhanie would fall through the cracks and quietly disappear or live in destitution on the streets of our cities. We will do all we can to help him stay, and be safe."}