{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Volunteering: the inspiration's mutual - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"LaaW3PZsTc\"><a href=\"https:\/\/care4calais.org\/news\/volunteering-the-inspiration-is-mutual\/\">Volunteering: the inspiration&#8217;s mutual<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/volunteering-the-inspiration-is-mutual\/embed\/#?secret=LaaW3PZsTc\" width=\"600\" height=\"338\" title=\"&#8220;Volunteering: the inspiration&#8217;s mutual&#8221; &#8212; Care4Calais\" data-secret=\"LaaW3PZsTc\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/09\/Untitled-design-1-4.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"At the Care4Calais warehouse in Stockport where I’ve been volunteering, there’s one little particular corner that really moves me. &nbsp; It’s the bit where people come to pick up the boxes of hand-picked clothes, toiletries and essentials for each destination. A box for four men, three women and a child in a hotel in East Manchester, perhaps; or one for two women, a man and three kids in the north part of the city. &nbsp; These boxes get taken away and delivered by ordinary people who have vans, and who have volunteered to help. &nbsp; There are old vans and new vans. Large vans and small vans. Owned, borrowed, and hired vans, all of them coming hour after hour, day after day to ferry these important donations to the desperate Afghan refugees all over Manchester. &nbsp; “It’s like the little ships of Dunkirk,” a woman called Laura said to me today, as we watched a quiet man and woman carrying out a box between them. “Anyone with any kind of van pitching in to help.” &nbsp; I thought she was right, because the Dunkirk spirit was about ordinary people responding to people in need, and showing their true, kind spirit when in adversity. &nbsp; That’s what I’ve seen here in this warehouse, not just in my favourite corner but everywhere; ordinary people, men and women, young and old, acting on the basic human instinct to help people in trouble. &nbsp; It’s hard work sometimes, and we have to be disciplined to sort everything into the right sizes. But the mood is always warm and friendly and inspiring, because we inspire each other. And with that sort of inspiration you can really change things.” &nbsp; For years now we’ve been told by our political leaders that people are fundamentally selfish. That we don’t really care about each other. That we don’t want to help people in need. Sometimes, watching the news at home, it’s been easy to believe that. &nbsp; But it’s not easy to believe it here, working with ordinary people like the ones in these pictures. And it’s impossible to believe it as you watch the boxes being taken to the vans for delivery. &nbsp; I know there’s still a long way to go to help the people arriving. I know there are many other asylum seekers and refugees this government has turned its back on. None of this will be solved easily. &nbsp; But in this warehouse in the last few days, I’ve seen people come together to help others, inspiring and encouraging and emboldening each other by their very actions. &nbsp; And that at least feels like a start, for me at least. &nbsp; Kerrie, Care4Calais volunteer, Manchester &nbsp; To volunteer for Care4Calais, get in touch at care4calais.org\/get-involved\/"}