{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"B’s story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"19qlQj8i0L\"><a href=\"https:\/\/care4calais.org\/news\/bs-story\/\">B’s story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/bs-story\/embed\/#?secret=19qlQj8i0L\" width=\"600\" height=\"338\" title=\"&#8220;B’s story&#8221; &#8212; Care4Calais\" data-secret=\"19qlQj8i0L\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/11\/BC28DB04-7D2E-4EC1-8D7D-6C1B1B8C2DAD.png","thumbnail_width":1080,"thumbnail_height":1080,"description":"A few weeks ago something great happened at Care4Calais. Our small team has been joined by our first employee who is a refugee. B came to to the UK from Afghanistan just over a year ago under the ARAP scheme, and has joined us to run purchasing. “It&#8217;s fair to say I did a very different job in Afghanistan,&#8221; he laughs. &#8220;But I love the team here, and I love the UK. When I came here, the one thing I wanted more than anything was to be a part of society, to work and contribute and play my part as a person. Being able to do that means so much to me.&#8221; B grew up in Afghanistan, went to university there and began working as a translator with the British forces 12 years ago, when he was 18. He was talented and popular, and worked with everyone from senior commanders to foot soldiers on the ground. &#8220;I made a lot of good friends. And I was in battles where I saw friends killed in front of me. You don&#8217;t forget that.&#8221; In 2020 the Ministry of Defence told him he was eligible to be relocated to the UK, and he applied. The MoD processed his application in two weeks, then passed it onto the Home Office who took a further nine months. Eventually he came here with his wife and young daughter in August last year: just 12 days later he and his wife had to watch the fall of Kabul on TV, thankful he had escaped (&#8220;the Taliban would take my life, there is no question&#8221;) but worried for their friends and families. He speaks movingly, with a deep love and pride about his wife&#8217;s experience here. &#8220;It has been hard for her, because like the other women from Afghanistan, she was not allowed higher education. She arrived here not speaking or writing any English at all, not even ABC, but she has studied so hard on courses, and now she calls to sort out things we need. We have a new baby daughter now, born in England so we call the English one. My wife understood everything the doctors told her. She is still studying. Like all of us, she wants to work hard to be a part of the life here.&#8221; As the family arrived at the start of autumn, they noticed the cold at first, he says with a chuckle, and thought that perhaps it was dark and rainy all year round. &#8220;We were happy to find out you also had Spring and Summer. And we like your weather now. The thing I love the most is the freedom, and tradition of treating people with humanity and respect.&#8221; There are lots of things he loves here, particularly, he says, the spicy chicken curries one of my neighbours makes. And, most of all, cheese sandwiches. “Yes, cheese sandwiches!&#8221; He repeats, seeing my surprise. &#8220;There are so many wonderful things here, but your English cheese sandwiches are truly delicious!&#8221; A year on from coming to the UK, the family is already very much embedded in their community; at one point Jamil lets slip that he&#8217;s been taking the older lady who lives next door, to hospital visits. He calls her, affectionately, &#8220;mum&#8221;. &#8220;But it&#8217;s nothing,&#8221; he says. &#8220;We are humans. Humans help each other. That&#8217;s the different between us and machines.&#8221; It’s been brilliant for our team to have B working with us. His attitude to word is so positive and although (to me) he his still young, life has taught him a kindness that is inspiring to see. If you own a business I would very much recommend employing a refugee. They have so much to offer. To volunteer or donate go to care4calais.org"}