{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"The dangers children refugees can face - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"IxX1dXbkgg\"><a href=\"https:\/\/care4calais.org\/news\/the-dangers-children-refugees-can-face\/\">The dangers children refugees can face<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/the-dangers-children-refugees-can-face\/embed\/#?secret=IxX1dXbkgg\" width=\"600\" height=\"338\" title=\"&#8220;The dangers children refugees can face&#8221; &#8212; Care4Calais\" data-secret=\"IxX1dXbkgg\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2023\/01\/amez-fb.png","thumbnail_width":940,"thumbnail_height":788,"description":"&nbsp; Late one night not long ago, I noticed a short, distressed message in Care4Calais  Instagram messages. &#8220;Please help me. Please.&#8221;  &nbsp; I immediately replied, asking if the sender could tell us what they needed, and where they were. &nbsp; After a few more exchanges he explained he was in a hotel in north London, a Kurdish refugee, alone and afraid in a room with other guys he didn&#8217;t know. And then he explained, &#8220;I am young. They are too big.&#8221; &nbsp; The boy was called Amez, and he had been deemed to be an adult, but he said he was in his teens. He has been put in a room with older men, and was clearly terrified. I contacted Cathy, one of our volunteers nearby and told her, and even at that time of night, she was amazing. She said she&#8217;d start to help first thing in the morning. &nbsp; I kept talking to Amez for the next few hours, and I think it&#8217;s one of the saddest conversations I&#8217;ve ever had; he kept telling me he was afraid, and asking if someone could come or would I come, or what was going to happen. I think it helped him just to have someone to talk to. &#8220;Hold on just a little bit more,&#8221; I said. &#8220;Cathy&#8217;s coming and she&#8217;ll help.&#8221; &nbsp; First thing that morning, before it was even fully light, our volunteer Cathy swung into action. She was due to be overseeing a distribution that morning as well, and I still don&#8217;t know how she did everything. She texted him and found out the name of his hotel, and arranged to meet him at a Starbucks. Amez brought along someone he had met who spoke English and Sorani, and he helped to translate. &nbsp; After finding out Amez&#8217; name and story, Cathy got in touch with the local authority and referred him into the social care team, and to the Care4Calais Legal Access team. He was now reassured, and so much calmer. Within a day or two he had had a proper age assessment, and been confirmed to be under 18. The social care team began looking for a foster family for him, and within nine days Amez was in a home with people looking after him. &nbsp; You may think that was job done, but one of the reasons our volunteers are so amazing is that they don&#8217;t just walk away; they care, and they keep on caring. In fact, Amez found it difficult with the family at first. He wasn&#8217;t sure how to act, or what to say. The family were kind, but there were no other young people around. Cathy was there for him then, replying to his messages, empathising, making suggestions.  &nbsp; After a short while his new family got him engaged with local community activities and youth clubs, and he settled in. He&#8217;s fine now. Living pretty much like a regular British teenager. And safe. &nbsp; In recent days, we have heard appalling evidence of the dangers that can face young refugees who are not properly cared for. Amez&#8217;s case showed what a difference getting support can make; it all made me proud to be part of an organisation with people who not only care, but take action.  &nbsp; To volunteer or donate go to Care4Calais.org &nbsp; * Name and image have been changed &nbsp;"}