{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Hiba’s story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"stXLGwBtXZ\"><a href=\"https:\/\/care4calais.org\/news\/hibas-story\/\">Hiba’s  story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/hibas-story\/embed\/#?secret=stXLGwBtXZ\" width=\"600\" height=\"338\" title=\"&#8220;Hiba’s  story&#8221; &#8212; Care4Calais\" data-secret=\"stXLGwBtXZ\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2023\/01\/A2C3BD0A-737A-4A73-90C6-979EE4E67204.jpeg","thumbnail_width":1080,"thumbnail_height":1080,"description":"When I was young I went, like all children in my home country, to our local school to begin my religious education. I was told to sit down, and I sat with the girls. For this, the teacher threw a heavy wooden bookstand at me, then dragged me across the floor by my hair. Then he saw I had on my hand a henna tattoo, which only women were allowed to have. For this, he beat me. I didn’t understand what I had done. But this would be my first taste of the persecution and abuse that would destroy my family and almost kill me. My name is Hiba and for as long as I can remember I  felt I was in the wrong body.  My Mum took me out of school (my father had died when I was small), and as I grew up, she and my elder brother supported me, which is what helped me survive. Even when I was bullied and abused at school, I felt their love around me. My brother took me to a doctor, who diagnosed gender dysphoria. It had to be called an ‘identity disorder’ because being trans isn’t recognised in my home country. I had hormone treatment and tried to hide who I really was. My brother even tried to show me how to walk like a man, but I couldn’t do it.   I worked as a photographer, filmmaker and event organiser for a religious organisation. When they discovered I was trans they were angry. They began spreading rumours and they came to our home to attack us. My brother told me to flee to Dubai, so I went, but I had only a visitor&#8217;s visa and eventually I had to return. Soon afterwards, they attacked my brother. He was very badly hurt; when I went to see him he told me to be careful because they were going to kill me. He died 24 hours later; my best buddy, my lifeline, my protection, gone.  I went into full hiding, but a year and three months later my Mum, who had developed cancer, also died. I never saw her in all that time; the organisation texted me to tell me they were watching the hospital and they would kill me. The same for her funeral. I can’t describe the pain except to say I wish I had not been born a human to experience this cruelty.  I felt my life was now over. I was alone and one day they would come for me. They were already making sure there would be no safe place for me by spreading news that I was campaigning for LGBTQ rights, which I was not. To this day, I ask why they wanted to hurt me so badly, just because of who I am. I actually got a UK visa but the people threatening me told me that if I tried to fly from any airport they would appoint someone to shoot me. I had one last hope. I had a connection to someone who worked in security at an airport and they helped me get on a plane to London. When I arrived, I had only the clothes I was wearing. I was confused, afraid, and had no one. I was just walking around in the grey weather not knowing what to do or where to go. And that’s when a girl called Katey rescued me.  I’d contacted Care4Calais, and she came to meet me with an armful of clothes. She realised immediately that I wore women’s clothes, apologised and said, ‘never mind &#8211; let’s go shopping.’ Can you imagine how that felt?  When I told her I didn’t know who I was anymore, she said, ‘You’re a girl just like me, and we’re going to be sisters.’ Then she took me to meet her parents who welcomed me into their home. You know, it can be very hard being a human being because we’re often selfish creatures. But if we can share our love we can change people’s lives; Katey has shown me that and because of her I now have a proper life in London. I have friends, and slowly I’m beginning to live as who I really am for the first time in my whole life.  There are many ways you can support refugees like Hiba. Click here to find out how!"}