{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Jawaad’s story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"sZVvtjIFen\"><a href=\"https:\/\/care4calais.org\/news\/jaweeds-story\/\">Jawaad’s story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/jaweeds-story\/embed\/#?secret=sZVvtjIFen\" width=\"600\" height=\"338\" title=\"&#8220;Jawaad’s story&#8221; &#8212; Care4Calais\" data-secret=\"sZVvtjIFen\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/10\/Untitled-design-2-4.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"My name is Jawaad and I am a Mancunian barber. For the last two weeks I’ve been doing hair cuts with Care4Calais for Afghan families who were airlifted out of Kabul. I have my own shop in Stockport called Gents Cut and have been cutting hair for about seven years now. But it wasn’t always this way. I had a difficult childhood, didn’t really have anyone to care for me and I fell off the rails big time in my teens. I spent some time inside. I’m not gonna say that was a good thing but it changed me. I watched the people around me in the prison, some of them wasting their lives and I thought that’s not me, that’s not what life is about. I was brought up a Muslim but as a teen I liked a party and a drink. As a kid I’d been made to learn about Islam and speak the Arabic verses of the Koran but they meant nothing to me; I didn’t speak Arabic. But when I read it in English and began to understand Islam I was able to turn my life around. I mean I’m far from an angel now but I want to do good and help people. In the summer I take my kit outdoors and cut the hair of homeless people in the city. I know what depression and anxiety are and helping people helps with that. I’ve been wanting to get involved with helping refugees for years but didn’t know how. But then I found Care4Calais and about three weeks ago they said needed help cutting people’s hair in the hotels. That was right up my street, I wanted to use my skills to help people, and really barbering is all I know. So I met up with Laura from Care4Calais at one of the hotels the Afghans are staying in and we set up the barber shop. It was a bit chaotic as so many people wanted to get their hair cut. I was so busy I didn’t have time to talk to anyone, I was surrounded by about 20 people all wanting my attention. There was a lot of pressure on me to do my job. The next week we went back again but this time I took my friend along so we managed to cut a lot more hairs and we knew what to expect this time and Laura organised it all. I absolutely loved it. I loved seeing the smiles after I had finished cutting someone’s hair, for some it had been a while since they had had a hair cut, some people had been in the hotels almost two months by last weekend. Many of these guys only had broken English so I didn’t get to chat much until we had a tea break. I met this one guy with really good English, he was only young and here with his wife. He was telling me how quickly they had had to leave Afghanistan and he didn’t have time to get his mother out, he had to leave her at the airport. He said he didn’t want to go without her, he was going to stay in Kabul but she made him leave. She watched while he went into the airport and was evacuated. He was an interpreter for the British army. She said she would rather never see him again than see him shot on the streets of Kabul or worse. He had tears in his eyes as he told me this and it made me so emotional. I can’t imagine having to make those choices. As we were leaving, I saw a young kid, about five, playing on a scooter. He was trying to ride it but it had a wheel missing. Poor little thing was trying to fix it, it made me cry all over again. I don’t know why, it was only a scooter but I think the broken toy reminded me of so many broken lives. If we all do a bit we can help mend them and that is what I am trying to do. I will go back, I feel it is my duty to help people and I will try to do one day a week. Care4Calais needs many more volunteers to help the thousands who have been airlifted out of Kabul. To volunteer or donate go to Care4Calais.org."}