{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Refugee Week 2021: Riri’s Story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"RtAY1q9vjI\"><a href=\"https:\/\/care4calais.org\/news\/refugee-week-2021-riris-story\/\">Refugee Week 2021: Riri’s Story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/refugee-week-2021-riris-story\/embed\/#?secret=RtAY1q9vjI\" width=\"600\" height=\"338\" title=\"&#8220;Refugee Week 2021: Riri’s Story&#8221; &#8212; Care4Calais\" data-secret=\"RtAY1q9vjI\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/06\/Untitled-design-3-1.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"The decision to leave Eritrea was heartbreaking for me. I stayed because I wanted to be with my family and my friends, especially my dad. I’m so close to my dad, he’s my hero: kind and funny, but also calm and reassuring. He’s the oldest of his brothers, so he became the head of our families, and everyone looked up to him. When I had to go for military service my dad became my rock and my confidant. In Eritrea, all kids finish year 11 at school, and then they have to go to a military camp called Sawa [an isolated location in west Eritrea near the Sudanese border] for year 12. They do six months of school and six months military training there. I guess the training made me stronger, but it was hard. We were just kids and the people in charge treated us like hardened criminals. They gave us horrible food, and often we had no showers, especially when we had to camp out in the bush. And they liked to punish us. Many of the girls were raped, but they could not say anything about it. Do you know how hot it is in Eritrea? Especially by the coast? They use what is known as a “helicopter punishment”, where they tie your arms and legs up, and make you stand in the sun for hours. Sometimes they make you do squats for hours in the same hot sun, or they make you run until you drop. It was my dad who got me through it all. I didn’t pass the school part well enough to go to university, but I did get into an accounting course for two years. Then I was sent to a military garage to work (in Eritrea, everyone has to work for the government at some point). I was a secretary there, then I worked in human resources for six years. At first they paid me £2 a month. It went up to £23 a month later, but I had to work 12 hour days for this. How did I live on that? When you have to, you just do! My boss began to threaten me that if I did not sleep with him I would be fired or worse. In Eritrea there is nothing you can do about such sexual harassment. Bosses can do what they like to you. Things were beginning to get very difficult, and I told my dad that there was no life for me there, and I had to go. He understood, but it was so hard for me. I didn’t want to go, but I couldn’t stay. I love Eritrea. The capital Asmara is very beautiful, and we have excellent weather, cafes, theatres and shops. I had many friends there, and I miss them all so much. I miss talking to them and gossiping, talking about our dreams at the Café Royale, drinking Coffee at the Sunshine Café, laughing and crying together. I’d known them all my life and we knew everything about each other. But most are not there now. Everyone leaves if they can. They are all over the world. I miss everything about Eritrea, it’s a beautiful country. Sorry for my tears. I left two years ago, when I was 26 and I’ve been in the UK nearly a year now. I’m still waiting for my asylum interview. Since arriving here, I’ve been moved three times – first from London to Southampton, then to Stockton, and now I’m living in Sheffield. I liked Southampton best, but I’m getting to know Sheffield now and it’s not so bad. The house is in a good place near the city centre, and I share with some other girls from Eritrea, where I’m from. Sheffield is very hilly, it tired me out walking around! When I get asylum, I want to be a computer programmer, so I’ll be able to help my family financially too. My sister is still in Eritrea to help my parents physically. Right now I’m helping Care4Calais as an interpreter. I learned English in school so it’s good to be able to do something to help others while I wait for my interview. And I get to hear my language, Tigrinya. I miss speaking that.” #refugeeweek2021"}