{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"New report damns police - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"K4dPgio49K\"><a href=\"https:\/\/care4calais.org\/news\/new-report-damns-police\/\">New report damns police<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/new-report-damns-police\/embed\/#?secret=K4dPgio49K\" width=\"600\" height=\"338\" title=\"&#8220;New report damns police&#8221; &#8212; Care4Calais\" data-secret=\"K4dPgio49K\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/02\/Untitled-design-40.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"&nbsp; I’m writing this post with a feeling of enraged shock at the cruelty that some human beings are capable of inflicting on others. Having been through a week in northern France that saw brutal evictions of refugees in Dunkirk and Calais, I thought I was pretty familiar with the harshness refugees suffer at the hands (and boots) of police and governments. But today I’ve been reading a new Human Rights Watch report on the abuse of adult and child refugees in France, and somehow seeing it catalogued in print over 70 pages really brings home the atrocity. It certainly makes you ask how on earth supposedly civilised countries have undertaken such a spectacle of cruelty and horror. The report is called Enforced Misery: The Degrading Treatment of Migrant Children and Adults in Northern France, and contains dozens of stories exemplifying its title. One that sticks in my mind is from Rona D, a Kurdish refugee in Grande-Synthe in December 2020. “When the police arrive , we have five minutes to get out of the tent before they destroy everything,” she told researchers. “But it is not possible for five people, including young children, to get dressed in five minutes in a tent.” Rona and her family just have to do the best they can; if they’re unlucky, the police start slashing the tent with sharp knives while she and her children are still inside. For those who don’t know, every other day, police require the occupants of most encampments in Calais to remove their tents or tarps and other personal possessions temporarily from the land where they are staying. In Grande-Synthe, police conduct eviction operations of this kind once or twice a week. In both towns, police or private cleaning crews seize and may destroy anything not removed immediately, particularly tents, sleeping bags, and blankets. Everyone knows these operations don’t actually clear camps; the refugees return to the same areas as soon as police have left. “Instead,” the authors comment, “the circumstances strongly suggest that the primary—and perhaps the only—purpose of these eviction operations is to harass migrant children and adults. Police also conduct regular mass evictions of encampments such as we saw this week. Refugees are bussed around, sites are cleared at great expense, and then people come back. It seems little more than a cruel PR exercise designed to show refugees they’re not welcome, but there are also casualties; adults beaten, and in one case mentioned here, children hit by rubber bullets. It’s important not to think this is just about the French authorities, though. The United Kingdom, which spends millions funding these actions, also comes in for harsh criticism. We’re reminded, for example, that the UK government stopped accepting new family reunification transfer applications last year, ending the only practical legal option for UK entry available to unaccompanied children in other European countries. How cold do you have to be to want to keep families apart? The report calls on our UK government to create safe routes for refugees to travel to the UK, and to allow unaccompanied children to join family members in the United Kingdom, and to amend the Nationality and Borders Bill. If these are familiar ideas, that only goes to show how practical and common-sensical they are. This report is important because many journalists talk about refugees as if they saunter across Europe looking for handouts from civilised, over-generous EU countries, and then chill out in Calais just waiting for an easy lift across the Channel. The fact that men, woman and children are constantly harassed, abused and physically attacked is ommitted from this picture, even in the liberal media. I hope those journalists read it. Refugees were on the streets of Calais protesting about their treatment last night. I think we’ll be seeing them again. Read this report and you’ll see why, [The Degrading Treatment of Migrant Children and Adults in Northern France | HRW](https:\/\/www.hrw.org\/&#8230;\/degrading-treatment-migrant&#8230;) Image credit Abdul Saboor"}