{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Ali’s story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"DTgs7PMuyb\"><a href=\"https:\/\/care4calais.org\/news\/alis-story-3\/\">Ali’s story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/alis-story-3\/embed\/#?secret=DTgs7PMuyb\" width=\"600\" height=\"338\" title=\"&#8220;Ali’s story&#8221; &#8212; Care4Calais\" data-secret=\"DTgs7PMuyb\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/06\/F2D67F49-2D77-45CB-A2CF-B2EA78680500.png","thumbnail_width":1280,"thumbnail_height":720,"description":"“When they attacked me in my house, I knew we had to leave Afghanistan. I did not work for the army, I was just a mechanic but now I’m also a target. We cannot got home, but we cannot go forward either. “I don’t know what to do, and day by day things get worse. We don’t go outside anymore, just stay in this small room, with our neighbours trying to help us.” These are the words of Ali, an Afghan man currently trapped in Quetta, Pakistan. When I spoke to him last night, he sounded terrified. At a time when Priti Patel is trying to use fear to deter refugees from crossing to the UK, his story is a reminder of the fear that drives many to come, and how Rwanda deprives people of that most valuable thing &#8211; hope. “Even if I could find the money and a way to get to the UK I do not want to come now”, he told me. “Because your government will send me to Rwanda. Why would I want to go there? I do not want to live the rest of my life in a camp with no opportunities for a job.” Ali left Khandahar in Afghanistan in 2020 after the Taliban badly injured his brother, attacked Ali in his own house. His brother fled to Turkey, and Ali took his sister-in-law and nieces and nephews to over the border to Pakistan. “My brother was a staff sergeant in the British army for many years. He worked mostly in a regional training centre for the police. So he was a high-value target for the Taliban. “In 2020 Afghanistan was in a high state of war and there was a lot of killings. They planted a bomb for my brother, and he lost his jaw in the explosion. “He was in hospital a long time, but he knew next time they would kill him, so he left for Turkey as soon as he could. “Then they attacked me. I was left with a broken arm that will not heal. it is still in plaster now, and very painful. “I knew my brothers wife and children and I were not safe, so we left for Quetta in Pakistan. That is where there are a lot of Afghans who fled during the Russian war of 1979. I thought we would be safe here, but we are not.” The Quetta area is full of Taliban scouts and a lot of the Taliban still live there. “The Taliban patrol the area looking for Afghan refugees and the police help them. If the police catch us they put you in jail and then send you back to Afghanistan. The caught me a while back and put me in prison, at the time my friend had money so he paid the bribe to get me out, but now I can’t be caught again or they will send me back or kill me. Then what will my family do? “About eight months ago I started hearing that the Taliban were searching my area for me, they had my name. Then we got official Taliban letters saying if you do not tell us where your brother is, we will kill you. I will not give up my brother, so now I am hiding. We do not go outside and we have moved maybe 10 or 12 places in the last two years. “Islamabad is much safer but I do not have money to go there or to get out of Pakistan. My friend in the UK helped me get my visa for Pakistan and I have many letters of support from international friends, but no one can help us. We are in a very bad way. “ Ali’s brother is now in Turkey and relative safety but he is illegal there and can not get a good job. When he can he send money back to the family but its never enough. “I am in a bad way here,” he says. “I can not see away out, everyday my family are hungry and thirsty , we rely on our neighbours to bring us food and water but it is never enough as they do not have a lot for themselves” So many people have been left in terrible straits in Afghanistan, and so many have fled to Pakistan hoping of getting out of the area. They are caught in limbo with no way forward and no way back. Even with money and a healed arm, finding his way to safety with his brother’s family would be a very dangerous for Ali. Often, what sustains people in these situations is hope – the belief that if they can somehow find a way out, fellow humans somewhere will give them help, and offer refuge. The denial of that hope is yet another cruel effect of this government’s Rwanda plan, and further proof of its barbarity. To volunteer or donate go to care4calais.org"}