{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Sofia’s story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"O8ssl2k0Ln\"><a href=\"https:\/\/care4calais.org\/news\/sofias-story\/\">Sofia’s story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/sofias-story\/embed\/#?secret=O8ssl2k0Ln\" width=\"600\" height=\"338\" title=\"&#8220;Sofia’s story&#8221; &#8212; Care4Calais\" data-secret=\"O8ssl2k0Ln\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/C5526D26-F762-4A79-BE1C-490A0F0B76B4.jpeg","thumbnail_width":1280,"thumbnail_height":720,"description":"&nbsp; Last month Sofia, nine years old, survived a suspected cluster bomb attack in the besieged city of Mykolaiv, which lodged shrapnel the size of a sugar cube in her brain. &nbsp; Fragments from the blast shattered her skull, forcing a piece of hot metal around half an inch thick through her forehead. The metal passed through the centre of her brain, and came  to rest at the nape of her neck. &nbsp; “It is a kind of miracle that she survived at all,” said Dr Mikhail Lovga, chief of the paediatric neurosurgery department at Mykolaiv hospital, who is treating her. &nbsp; Sofia is a different child from the nine year old who just two months ago was regularly posting videos of her dancing on TikTok, and singing pop songs into her smartphone. Now she can barely walk, and struggles to compose her thoughts. &nbsp; In the first weeks of the war, Sofia’s family took shelter in their basement of their home in the bombed-out farming village of Veselyi Kut, in south-west Ukraine. When the neighbouring houses were bombed on March 28, they fled by motorcycle to a neighbouring village, speeding through a heavy rainstorm with bombs falling all around them. From there, they went onto her Aunt’s apartment in Mykolaiv, but the next day, on their way back from gathering supplies at a humanitarian aid centre, they were caught in a Russian attack. &nbsp; “There was no air raid siren, nothing,” her mum recalls. “It was a very sharp explosion, a cluster bomb. There were other massive explosions all around us. &nbsp; “I asked Sofia just to pray. But a second shelling came and there was debris flying everywhere all around us.” &nbsp; It was then that Sofia was hit.  &nbsp; Local men helped get Sofia to Mykolaiv hospital, where she underwent emergency surgery. &nbsp; The surgery saved her life, but the images of her before and now are stark. Before the war she has aspirations to be a dancer. “Now,” she says, “my dream is for the war to be over.” &nbsp; Across Ukraine, and right across the rest of the world, there are thousands and thousands of stories like Sofia’s; each one unique, but yet also revealing something of what it means to be a refugee.  &nbsp; As Sofia’s tragic story shows, refugees are not born. They are people whose lives are suddenly, horrifically transformed by luck and circumstance. And they have little choice over the routes by which they try to distance themselves from further harm; what choice did Sofia of her family have in any of what has happened to them? &nbsp; And yet, like Sofia, they keep going. They show the amazing resilience that is possible in the face of incredible challenge, which is why they are so often so inspirational people.  &nbsp; And why it is impossible to not care when you meet a refugee.   &nbsp; We wish that every person in the U.K. could meet a Sophia just once. We know that if they did, all our struggles to encourage understanding would be over at a stroke. Maybe one day that will happen. For now, though, we share these stories in the hope that each one will light another little flames of empathy, and that eventually, the world will understand.  &nbsp; And that one day, little girls like Sofia will no longer be looked down on, but be helped and respected as the heroes they are. &nbsp;"}