{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Meet Katey, our amazing lead volunteer in Croydon! - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"XqIOZ84yrK\"><a href=\"https:\/\/care4calais.org\/news\/meet-katey-our-amazing-lead-volunteer-in-croydon\/\">Meet Katey, our amazing lead volunteer in Croydon!<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/meet-katey-our-amazing-lead-volunteer-in-croydon\/embed\/#?secret=XqIOZ84yrK\" width=\"600\" height=\"338\" title=\"&#8220;Meet Katey, our amazing lead volunteer in Croydon!&#8221; &#8212; Care4Calais\" data-secret=\"XqIOZ84yrK\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/10\/katey-1.png","thumbnail_width":1080,"thumbnail_height":1080,"description":"Katey has a wonderful, warm way with people, and somehow always seems to remember the names of the people she helps, even after meeting them just once. This means a lot; when she talks to refugees you can see their smiles breaking out to match hers. &#8220;As volunteers we just try to show refugees that there&#8217;s hope in the world, and they don&#8217;t have to suffer alone,&#8221; she says. &#8220;We see a ripple effect; if you someone feel better, they&#8217;ll make others around them feel happier too. And you feel amazing to see the effect.&#8221; Katey began volunteering in Calais and continued with the Access team when she got back to the UK. Then one day a volunteer called her to say there was a mother with a three-month-old baby who needed support in Wimbledon. When Katey arrived at the woman&#8217;s hotel and noticed it was full of people with no spare clothes or support, she decided to set up a Care4Calais volunteer group in the area with some friends. Once that was up and running, someone took over and she went on to set up the group in Croydon, where she lives. Katey now runs a network of volunteers who support more than 1,000 refugees in six hotels in the Croydon area. The Croydon group provides help in the form of clothing, food parcels and phones and also provides social support and interaction, including language lessons, sports, kids crafts and drop-in sessions. One of Katey&#8217;s most successful initiatives has been to set up links with other local groups who can offer specialised help, such as food banks and children&#8217;s charities. She even made an arrangement with the local Waitrose for the supermarket to donate food that might have otherwise been thrown away. &#8220;If we try to do everything on our own, our work might not be sustainable. But we all work together, we can make progress. And I don&#8217;t see that progress coming from anywhere else at the moment. Volunteering with Care4Calais, she says, means doing something that has an impact straight away, and helping people who deserve our support &#8220;The world is full of amazing people each with their own skills, talents and cultures. At the end of the day it&#8217;s a matter of chance which country you were born into. In the UK, everyone should have access to clean clothes, toiletries and access to help if they need it. &#8220;But that emotional support is so important too. Kindness goes a long way. There&#8217;s a lot of pain in the world, but like small things will make a difference.&#8221; Katey needs more volunteers to help in Croydon. If you can help, please get in touch through care4calais.org\/get-involved\/"}