{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"The horror of a Mediterranean shipwreck - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"gxTFvQF6Rn\"><a href=\"https:\/\/care4calais.org\/news\/the-horror-of-a-mediterranean-shipwreck\/\">The horror of a Mediterranean shipwreck<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/the-horror-of-a-mediterranean-shipwreck\/embed\/#?secret=gxTFvQF6Rn\" width=\"600\" height=\"338\" title=\"&#8220;The horror of a Mediterranean shipwreck&#8221; &#8212; Care4Calais\" data-secret=\"gxTFvQF6Rn\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/04\/278574289_5442219935810919_5850580452674279536_n.jpg","thumbnail_width":960,"thumbnail_height":640,"description":"I’ve been on a search and rescue mission for the last few weeks with Sea-Watch, in the central Mediterranean Sea, just north or Libya. I drive one of the two speedboats. We’d not long got back to the ship from rescuing boat three. Phil, head of mission told us that there’d been a mayday call. A plane had spotted a rubber boat which was sinking, with over fifty people in the water. It was over ten miles away. The briefing was short. What equipment to take, the location for the chart plotter, good luck, go. It was that kind of thing. Just get there. Do what you’ve trained so hard for. Go! Ten miles on the speedboat takes a while. I swear that it just doesn’t go any faster than I took it. 37kn pretty much all the way, scanning the horizon. Looking. All the while knowing that people were drowning. I knew we wouldn’t be able to save them all, and we didn’t. God damn this is hard to write. After a while we could see small dots which got bigger. Boats first, then people. We could see the Libyan Coast Guard had got there first. There were still loads of people in the water screaming for rescue, splashing desperately, most unable to swim, some with little rubber inner tubes round them, still kicking hard to keep their heads above water, the fucking panicked manic desperate final efforts to survive. They’d been in the water for so long already. These were their final moments. We followed our training, just about as quickly as it would be possible to do it. I slowed down a little for a safe approach, hearing the distress call on our arrival. We got the first two people struggling over the same tyre tube, then we started hauling them in. Another to our side swimming towards us, just so frantic as he got to the boat, then reach over and pull him in too. The first ones in the boat lay on the floor exhausted, still screaming, we repositioned. In front of us, there were loads of people. I heard a female voice shouting “seawatch three please save us”. They even knew who we were. What the fuck? One guy on the boat got his breath back a little. He was shaking violently with hypothermia. Through trembling lips he kept saying “No Libya, No Libya”. He was so scared to be taken back he just kept saying it over and over. I can’t piece it all together, but before long we had six or seven in our boat. They were in shit state. Hypothermic, with foam running from their mouths and noses. Some of them started to help pull in more people. It really wasn’t the prettiest rescue, just haul them in, sit them down, no time for first aid or rescue blankets, just reposition and get the next one, and the next one and the next one. The Libyans were on scene and had deployed their small RHIB. Some of the people jumped from the Libyans RHIB to swim towards us. I saw a woman (22 years old) on the Libyan Coast Guard ship as she fought off the guard and then jumped in the water. She swam toward us. I found out later that she didn’t know how to swim but chose this over being returned to Libya. They were all just so terrified. We looked under the deflated wreck of the boat that had sunk, as we couldn’t see any more people trying to swim, we started to search for any signs of life, all with the chattering of teeth all around us, the coughing, the sobbing, the praying. With incredibly traumatised people on our boat we just continued to search. It was very strange and I’ve never seen it before (apparently it has happened before), but the Libyan Coast Guard then transferred the people to us. First from their little RHIB and then eventually from their big boat. We did a scan around and could see nobody. Then, I guess the person might have been obscured by the Libyans, one of the people on the other speedboat spotted something. Some splashing and then a hand reaching out of the water. Both speedboats went as fast as possible, but it was too late. One of the guys on the boat I was driving, saw something sinking under the water, but it was impossible to get there. The person drowned right in front of us, froth and bubbles rose to the surface. Gone. One boy told me he’d lost his brother. We searched the whole area. There was nobody else to save. I asked one guy how many people were on the boat that had left Libya. He said 55. We did a head count. 38. So, 17 people had drowned. Most had drowned before we got there, some right under our noses. Right at that moment though, the 38 people were our priority. Some were near death from severe hypothermia, having been in the water for half an hour or more. They were sat and laid shivering on our boat. Some couldn’t even sit up, some drifting in and out of consciousness, some shaking violently, some not at all. Some had clothes all on, some had kicked their clothes off in their desperate struggle to survive. It was completely fucked up. We put rescue blankets on them and took them back to the ship. Two of the women were heavily pregnant. One guy was just in and out. We’d rescued them from the sea but that was just the start. Getting them up and onto our ship was difficult. And then the deck team took them. They were showered with fresh water as some of them had terrible burns caused by the fuel from their boat mixed with salt water. Then the hospital cases. The medical team worked for days with hardly any sleep. God knows how they did it. All [&hellip;]"}