{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Steph and the Access Team - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"Z2Vwer1OdI\"><a href=\"https:\/\/care4calais.org\/news\/steph-and-the-access-team\/\">Steph and the Access Team<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/steph-and-the-access-team\/embed\/#?secret=Z2Vwer1OdI\" width=\"600\" height=\"338\" title=\"&#8220;Steph and the Access Team&#8221; &#8212; Care4Calais\" data-secret=\"Z2Vwer1OdI\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/12\/Untitled-design-4.jpg","thumbnail_width":808,"thumbnail_height":1000,"description":"&nbsp; It’s a real rollercoaster of emotion working for the Care4Calais Legal Access Team, and there’s no emotion you don’t feel at some point. Sometimes the horrific experiences refugees tell us about can be hard to listen to; other times, it’s really enjoyable to think you’re helping people, and you can feel pride knowing you helped someone avoid being unfairly deported, for example. The Legal Access Team refers refugees seeking asylum in the U.K. to lawyers who can help them with the immigration system. It&#8217;s so scary for people because they arrive here and they&#8217;re given all this complicated paperwork, often in a language that they often don&#8217;t fully understand. Often they haven’t even been given the right basic papers they need to even start their application – that’s something we help with a lot. But we also provide friendship and support to people as they move through the system, often at a very slow place. It can be so difficult for refugees at the end of what has often been a really long and traumatizing journey here. They sort of think when they get here that&#8217;s it – but in fact they then face another rigmarole to go through the process of playing a part in society here. I was one of the three volunteers who first set up the team back in Spring last year. The woman then in charge, Hermione, knew there was a need, and began forwarding the names of refugees needing help to us, and we rang around immigration lawyers local to each person, asking if they would take on the case. As word spread we became very busy &#8211; we started off with a short list of names but now we are supporting nearly 2000 people. Some of our first clients have even started to get Refugee Status! I worked with our very first refugee, case number one, a guy in his mid-20s from Burkina Faso. In fact I still do, because he’s still waiting for his interview with the Home Office, and he’s been moved around hotels and dispersal accommodation a lot – it makes it very tough for him because every time he has tried to put down roots and get involved with volunteering organisations, he’s been moved on. He’s an example of how our friendship can help to give someone just a bit support and continuity. One thing we did that I felt really good about was stopping people from being wrongly deported just before Brexit took effect. At that time the government seemed to be trying to remove as many asylum seekers as possible, because the law was going to change, and possibly make removing people harder. We were receiving calls from people in detention centres who were in line to go, and getting them lawyers who could assist them; they were able to put forward the valid legal arguments for why they should be able to have their claims heard in the U.K. In some cases we were making calls that meant people who had been given plane tickets &#8211; even some who were on the plane ready to leave &#8211; were able to stay, as they had a legal right to. I felt a whole mixture of emotions about that, but it does feel good to have helped. That&#8217;s why I keep doing it. When I see things like that, it just kind of makes a lot of other stuff that I do in life seems less important. My job is with the NHS, but I really enjoy volunteering with the Legal Access Team. I’ve been to help out in northern France as well, and I loved that (that’s where I am in the photo, pointing to this amazing drawing of a house a little girl had done with me). I’m still in touch with friends I made there, and have great chats with them. It’s all just so rewarding really. I’d definitely recommend volunteering the Legal Access Team. It’s grown so much since it started, and there’s so many people who need support, there are different roles based on how much time you’re able to give. If you’d like to be part of the team email Access@care4calais.org"}