{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Aaron's story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"gvra7oTr1X\"><a href=\"https:\/\/care4calais.org\/news\/aarons-story\/\">Aaron&#8217;s story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/aarons-story\/embed\/#?secret=gvra7oTr1X\" width=\"600\" height=\"338\" title=\"&#8220;Aaron&#8217;s story&#8221; &#8212; Care4Calais\" data-secret=\"gvra7oTr1X\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/01\/aaron-3-2.png","thumbnail_width":1080,"thumbnail_height":1080,"description":"&nbsp; Aaron left Eritrea seven years ago, just before his 19th birthday. If he hadn’t left, he thinks he would be “in the army guarding the border, or doing hard manual labour somewhere. Or dead.” When he first set off, he went to Sudan and spent three years there. It was a bad time for him: he was still a child but trying to live in a frightening adult world, and although he got work in a restaurant, the pay was so low he could hardly afford to eat. And even when he did manage to save money, he kept getting robbed. Even though he was only just a teenager, Aaron knew he had to find somewhere else, and he headed north. It’s almost impossible to avoid Libya if you’re headed north from Sudan but the country is horrifically dangerous, “like a hell for refugees.” Refugees passing through are often imprisoned, tortured and starved. Aaron knew the stories, but took the chance anyway; he ended up being kidnapped and held in a makeshift prison watching people being killed in front of him in the most brutal and horrific ways. Traffickers in Libya imprison people, then demand money from their families. If a family can’t pay, the traffickers torture them while the family watches on video link. Aaron watched them put petrol on someone’s naked upper body, and set light to it, so the victim screamed for money as they burned, and their parents watched in agony. Aaron was “lucky”; his family somehow managed to find enough money between them to pay off his kidnappers, and they let him go. He then spent 12 terrified months trying to get a place in a small boat to cross the Mediterranean. When he finally found one, the boat was so overcrowded that he became convinced on the way that it would sink before it reached land. He still wonders how he survived. He wanted to come to the UK because he spoke some English, and he’d be treated fairly there after so many years of being threatened and attacked. With that hope lighting his heart he gradually made his way to northern France, where he lived alone in small tent in bleak scrubland on the edge of Calais. It was hard, but he remembers the Care4Calais volunteers being a support to him, just sitting and talking around the fires refugees would build at night to cook food and keep themselves warm. In 2020 Aaron managed to get on a lorry to the UK. He was in a hostel in Staffordshire for a month, then in Middlesbrough for two years. He got his refugee status, and put all his time and energy into studying. That paid off, as after doing access levels one, two and three he’s now at university in the south of England studying computer science. He wants to work in computing as a career; he’s been fascinated by computers since he was four or five years old. He feels settled in the UK now. “I got strength from my mum and dad to cope with everything,” he says, “but I saw why Libya break some people. That place is a nightmare.” “I do miss everything about home,” he says. “It’s hard not to. I miss the weather being warm all the time, and I miss the food too, I do cook for myself but I eat a lot of English food. But when I have money and time I love to go to the Ethiopian restaurant near where I live. But one thing that helps him with missing home is working with Care4Calais.” He helps to sort donations one evening a week, and sometimes helps out at distributions; “Care4Calais helped me in Calais, so now I help them. It feels the right thing to do,” he says. “Life as a refugee was hard- but If I have learned one thing, it’s that life is better for everyone if we try to help each other.”"}