{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Surge in anti-refugee activity: new analysis - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"WNWb5J9bnv\"><a href=\"https:\/\/care4calais.org\/news\/surge-anti-refugee-activity-new-analysis\/\">Surge in anti-refugee activity: new analysis<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/surge-anti-refugee-activity-new-analysis\/embed\/#?secret=WNWb5J9bnv\" width=\"600\" height=\"338\" title=\"&#8220;Surge in anti-refugee activity: new analysis&#8221; &#8212; Care4Calais\" data-secret=\"WNWb5J9bnv\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2023\/02\/mh.png","thumbnail_width":1080,"thumbnail_height":1080,"description":"The Times has published a highly relevant and informative article about the increase in anti-refugee activity in the UK.  As the article  is behind a paywall the key points are summarised below. Hard-right protesters visited hotels housing asylum seekers 253 times last year amid a surge in anti-migrant activity across the UK, Dame Sara Khan, the government’s commissioner for countering extremism, said a neo-Nazi group behind some of the anti-migrant protests had been allowed to flourish owing to inaction from ministers. The government failed to respond to a warning by Khan and Sir Mark Rowley, now the commissioner of the Metropolitan Police, that new laws were needed to stop such organisations preaching white supremacy, radicalising young people online and fomenting hatred. Extremism strategy must be urgently overhauled “Why is it that such hateful extremist organisations have been able to brazenly operate with impunity? Sadly, it is because we lack the legal, non-legal and operational means to stop them” Dame Sara Khan writes. “In my former role as counter-extremism commissioner I independently reviewed the government’s 2015 counter-extremism strategy, whose purpose was to tackle extremism outside of terrorism. As noted in my report, Challenging Hateful Extremism, I called for an urgent and complete overhaul as the approach taken was too broad and was failing to tackle extremism. In 2020 the Home Office decided to scrap the strategy and nothing has replaced it. My 2021 report called Operating with Impunity and co-authored with Sir Mark Rowley, now Met Police commissioner, undertook a review of the law and hateful extremism. We showed how the two areas of law most relevant are hate crime and terrorism — both of which are illegal. Hateful extremism falls between both, and this gap in legislation is allowing extremists to operate lawfully. Hateful extremism is a distinct activity outside of terrorism and hate crime and requires its own legislation to deal with it, yet our laws have failed to deal with this threat. In the absence of a legal framework on hateful extremism, an operational infrastructure is lacking. Hate crime and counterterrorism policing, as well as regulatory bodies such as Ofsted and the Charity Commission, told us they faced significant operational challenges in countering hateful extremism due to the lack of criminal, civil and regulatory mechanisms. Sir Mark wrote how horrified he had been not only at the scale of hateful extremist activity but how this was lawful. As a society we have decided hate crime and terrorism are sufficiently harmful that we have built a legal and operational framework to counter these crimes. The same is now needed to tackle hateful extremism. Other western democracies have outlawed such activity and, consistent with our liberal democratic values, we showed how it was possible to distinguish legitimate, offensive and dissenting speech from this dangerous anti-democratic extremist activity taking place in Britain. Yet despite this, the government did not respond to our recommendations and have done little to address this problem as identified recently in the Prevent review. This must urgently change.” Nick Lowles, chief executive of Hope Not Hate, blamed the rise in anti-migrant activity around hotels on the “repeated demonisation and scapegoating of migrants, asylum seekers and refugees by the government and the media”. He said: “This rhetoric shapes hostile public opinion and encourages the far right. There is a very dark side to this anti-migrant activity. Hope not Hate’s research shows that the Dover firebomber consumed migrant-hunter content before he attacked a migrant-processing site and we saw 400 people demonstrating in Kirkby, setting a police van on fire and letting off fireworks.” Videos collected by the migrant hunters, usually on mobile phones, is shared on social media and far-right websites to stir up hatred among communities with hotels that are housing asylum seekers. They also film themselves leafleting the area unveiling, banners and trying to expose the locations of hotels in online forums. Research by the Center for Countering Digital Hate has found content from far-right activists involved with anti-migrant protests in the UK has been viewed nearly 44 million times on Twitter and YouTube. In a sign of how recent the surge in activity is, an account that posted about a protest in Kirkby has had more than 38 million views on Twitter in the past two months The most prolific of the migrant hunters last year was Amanda Smith, a member of the hard-right English Constitution Party.  An account run by Smith named Yorkshire Rose received more than five million views for a video of herself harassing Serco staff and residents outside a hotel. https:\/\/www.thetimes.co.uk\/article\/migrant-hunts-double-in-one-year-9rjf8p82c &nbsp;"}