{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"When exactly was the bacteria discovered on the barge? - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"qjT2vdgshR\"><a href=\"https:\/\/care4calais.org\/news\/when-exactly-was-the-bacteria-discovered-on-the-barge\/\">When exactly was the bacteria discovered on the barge?<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/when-exactly-was-the-bacteria-discovered-on-the-barge\/embed\/#?secret=qjT2vdgshR\" width=\"600\" height=\"338\" title=\"&#8220;When exactly was the bacteria discovered on the barge?&#8221; &#8212; Care4Calais\" data-secret=\"qjT2vdgshR\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2023\/08\/bg.jpg","thumbnail_width":800,"thumbnail_height":800,"description":"Tonight the UK government has serious questions to answer about the Bibby Stockholm barge. This morning, it emerged that unsafe levels of Legionella pneumophila bacteria had been found in the barge&#8217;s water supply. If droplets of water containing this bacteria are inhaled, it can cause Legionnaire&#8217;s disease, which has a mortality rate of 10-80 per cent, depending on the health of the sufferer. Because of this risk, everyone on the barge should have been evacuated immediately. However this did not happen. At lunchtime we were contacted by three men on the barge who had not been informed of the outbreak, nor warned to avoid the water. The men were unable to find staff to supply information. It transpired that other refugees were on the barge, but none knew of the danger. The men were given a letter of explanation, but were not due to be moved from the barge until the early evening. Our volunteer Dr David Thomas is a Fellow of the Institute of Chemical Engineers. He commented &#8220;This is very serious situation. People die from exposure to legionella bacteria, and you are at greater risk if your immune system is compromised, which we know is the case with some of the refugees. &#8220;Everyone should have been evacuated as soon as the legionella was discovered.&#8221; The bacteria is typically found in old heating systems that have been unused for several months. Government and Health &amp; Safety Executive guidelines say that such systems should be carefully checked and cleared before anyone is allowed to use them. The Government must now explain: When the results of the legionella testing, which took place on July 25 were known. If it followed its own guidelines in re-commissioning the heating and ventilation systems on board the barge. Why people were not told about the risk to their health once the authorities were aware of it. Why people were kept on the barge, and why more transfers were attempted, when the presence of the bacteria was known. If everyone who was aboard the barge has been tested for Legionnaire&#8217;s disease. Steve Smith, CEO of Care4Calais said &#8220;We have always known our concerns over the health and safety of the barge are justified, and this latest mismanagement proves our point. &#8220;The Bibby Stockholm is a visual illustration of this Government’s hostile environment against refugees, but it has also fast become a symbol for the shambolic incompetence which has broken Britain’s asylum system. &#8220;The Government should now realise warehousing refugees in this manner is completely untenable, and should focus on the real job at hand &#8211; processing the asylum claims swiftly, so refugees may become contributing members of our communities as they so strongly wish.&#8221; It should be remembered this affects not only refugees, but also the staff and other contractors who have worked on the barge. The Government has shown an appallingly cavalier attitude to other people&#8217;s lives and safety – an attitude to which the Bibby Stockholm will forever be an ugly, shameful monument. It must be permanently closed down, and ministers must explain how it has come to such a dangerous and disgraceful end."}