{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Yousef - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"aD1GZVqZiQ\"><a href=\"https:\/\/care4calais.org\/news\/yousef\/\">Yousef<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/yousef\/embed\/#?secret=aD1GZVqZiQ\" width=\"600\" height=\"338\" title=\"&#8220;Yousef&#8221; &#8212; Care4Calais\" data-secret=\"aD1GZVqZiQ\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/12\/Untitled-design-8.jpg","thumbnail_width":808,"thumbnail_height":1000,"description":"&nbsp; My name is Yousef, and I am 15 years old. I left my home in Khartoum, Sudan over a year ago, because the authorities shot my brother to death. He was 17. I just want to live in a safe country where there is no war and killing, and in the United Kingdom there is a beautiful system. The UK cares about minors like me a lot. I love the English language, and one of the best universities in the world is in England; I know that British people are not racist like other countries in Europe. So that is why I am here. To go to the United Kingdom is my first and last dream. When I get there, I want to go to school and learn English. My academic level is not so good, as I have only had four years of primary school. So I really want to start learning as soon as I can. My brother and I were protesting the military rulers who took over after president Al Bashir was deposed in 2019. We were not doing any harm, just protesting; we just painted our faces and stood with hundreds of others. But the bullets found him, and he died. My mum said I had to leave, that I was not safe. She had lost one son and could not lose another. I come from South Kordofan, from a very poor area. The war started there in 2011, when I was only 5. We had nothing and we struggled to eat; I lost my dad when I was very small so we always struggled and I could not stay in school. When I was old enough, my mum moved us to Khartoum, so she could earn money. She sold chai on the street, sweet milky tea flavoured with with cardamom. Sometimes I would find a bit of work too, but it was just enough to allow me to eat, nothing more. I didn’t have a plan for the future in Sudan, it was just too difficult living to be able to think. So when my mum told me to leave, I didn’t argue because life in Sudan was not good. It was violent, dangerous and there was no work or chance for my future. I had no money for smugglers so I just had to use myself to get to Europe. First you have to cross the Sahara, which is dangerous and very hard. There were a lot of people in my truck and we had little water. It took four days to cross the desert. We were lucky though &#8211; sometimes it can take weeks. The cars break down, and when you start to walk you die. When I got to Libya I was caught and told I had to work for free or my family had to pay to release me. Of course I couldn’t pay, so I started working. I met another Sudani there who lived in Libya, and he became my friend. Because I was only 14 he said he would help me &#8211; he was leaving for Europe with some smugglers, but he said he could not leave me behind. So I got on the boat and finally arrived in Italy and finally to Calais. Now I live in a tent behind a supermarket called Auchan. It is so cold, and we have run out of firewood so we can’t cook either. Sometimes we have a tent if the police don’t take it, sometimes just a shelter. People share things with us to help us. Tonight we went to the English charity RCK for food. I do not know the name of the food but by God it was good! I ate so much and am very full. But last night we had firewood and cooked something. We just cook whatever we can find, some scraps or anything. We have to use tins to cook in sometimes because the police steal our pans the charity gives us. If it is too cold we can go to Saint Omer to sleep, but you can’t try to cross from there so we have to stay in Calais when we can. I try to get across most nights, I have to go by lorry as you need money for a boat and anyway I can’t swim. It’s very hard to get a lorry these days, but we will keep trying. You have to walk at night to find the trucks and see if one will let you on or maybe you can hide. When I get there I would like to live in Manchester or Birmingham, or maybe London. And most of all I want to go school. To volunteer or donate go to Care4Calais.org"}