{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Flight stopped. Deportees saved! - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"f6ZHWMtveB\"><a href=\"https:\/\/care4calais.org\/news\/flight-stopped-deportees-saved\/\">Flight stopped. Deportees saved!<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/flight-stopped-deportees-saved\/embed\/#?secret=f6ZHWMtveB\" width=\"600\" height=\"338\" title=\"&#8220;Flight stopped. Deportees saved!&#8221; &#8212; Care4Calais\" data-secret=\"f6ZHWMtveB\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/06\/288259876_391265326379186_9066831709189321172_n.jpg","thumbnail_width":1080,"thumbnail_height":1080,"description":"Last night, at the 11th hour, five men were stopped from boarding a flight to Rwanda. In the morning, seven had been expecting to be on the plane. Through the day, four of those seven made individual claims to the British courts to stop them being forcibly sent. Three more men had their deportations stopped by an intervention by the European Court of Human Rights (ECHR). This meant there was no deportation to Rwanda yesterday. The ECHR gave four main reasons for its decision: &#8211; The Evidence from the United Nations High Commission for Refugees that asylum seekers in Rwanda would not have access to a fair and efficient process to determine their asylum claim. &#8211; That the UK courts had acknowledged that this evidence raised very serious issues, even though they decided not the stop the removal. &#8211; That enforcing human rights in Rwanda would be difficult as Rwanda is not part of the European Convention on Human Rights. &#8211; That there is no legally-enforceable way of ensuring someone would be returned to the UK if the policy was found unlawful. Because of this, the ECHR was satisfied that there was a real and imminent risk of severe and irreversible harm, and so it ordered that the individuals should not be removed from the UK. This was a great relief for us, for the individuals concerned and for their families. However, it is by no means over yet. The important hearing is the one in July. In July we will go to court again for the court to decide whether the Rwanda policy itself is lawful. This will be an incredibly important decision for many refugees, and for the future of the UK. We think this policy is utterly barbaric and, given there are more humane and effective alternatives available, a stain on our nation’s history. If the Government truly wanted to stop people smugglers and save lives they would give other refugees visas to cross the Channel in a similar way to Ukrainians. With these visas, refugees could then claim asylum on arrival in the UK. This would put people smugglers out of business overnight. We have not seen any Ukrainians getting in small boats or paying people smugglers, so we know this could work. Right now people are coming anyway, but there is no control and they are taking dangerous risks. Visas would mean we know exactly who is coming. People smugglers would no longer make money. This is not about numbers. Now, between Ukrainians and Hong Kong, we are taking ten years worth of Channel refugees in one year. And it’s not because the refugees are illegal, either. There’s a mountain of evidence that Channel migrants are genuine refugees. Last night’s news was a life saving reprieve for those seven men and their families. Five are victims of torture or trafficking. Two are married. One has extreme PTSD due to previous trauma. One has a son in Carlisle. They should never have been put through the hell of the last few days. We must remember that every single refugee is a victim of the worst things on this planet. They need our help and our compassion as human beings. Using them as political pawns is unforgivable. Our lawyers are working hard to get them released. But we know the Government will work harder than ever to deport more people just like them. Last night was the culmination of dedicated people working long days and nights with no breaks or weekends. We are incredibly proud of our volunteers, some of whom are refugees themselves. This will be a long hard fight. You can support their work here: bit.ly\/c4caccess"}