{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"“Without you, I would not be here.” - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"NzXKSZvnul\"><a href=\"https:\/\/care4calais.org\/news\/without-you-i-would-not-be-here\/\">“Without you, I would not be here.”<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/without-you-i-would-not-be-here\/embed\/#?secret=NzXKSZvnul\" width=\"600\" height=\"338\" title=\"&#8220;“Without you, I would not be here.”&#8221; &#8212; Care4Calais\" data-secret=\"NzXKSZvnul\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/06\/Untitled-design.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"Late one night last September my friend Ervin called me, frantic and afraid. Little wonder: as I was soon to discover he’d just found out that he was being sent home to be killed. He was rambling and hard to follow on the phone, but he sounded so upset that I got in my car and set out to look for him. I found him in the middle of a park in Liverpool, where I live. Agitated beyond belief, he was pacing back and forth in the darkness, his habitual limp more pronounced because of his twitchy, nervous movement. He told me he’d had a letter from the Home Office that morning to say he was going to be deported back to his native Iran. Before he left, Ervin had been persecuted for his opposition to the government.  The police had beaten and tortured him so badly that they permanently damaged his leg – that’s where the limp came from. He believed that if he went back to Iran, he would be killed.  And he was terrified. After reading the letter, he had decided to run away. Even though it meant absolute destitution, to save his life he would try to hide somewhere in the UK. And so here he was, petrified and panicking under the orange lights of a Liverpool park, There was an underlying reason for Ervin getting the letter: Brexit. Home Office staff knew after Brexit, deportations would become much more difficult, and so they were making a last-ditch attempt to deport as many people as they could before it took effect. My friend was caught up in this, but I knew he had every right to stay and deserved a new chance in life. I was devastated for him, all his hopes and dreams of a new life had been crushed with one Home Office letter. I volunteer for the Care4Calais Access Team, and have done since it was set up in July. Back then, we had not foreseen its potential to help thousands of people trying to navigate the UK’s asylum system without legal representation. These days, running this team is one of the most important aspects of Care4Calais’ work. There in the park, I called someone from the team and they explained that there was a better way forward for Ervin. I then told him that we were now working with lawyers across the UK who could work on his claim, and it didn’t have to be this way. With that assurance,  I eventually persuaded him to go back to his accommodation. And then I set to work to find a lawyer for my friend. The lawyer challenged his deportation and got it stopped. Then, with the lawyer’s help, Ervin went ahead with his asylum claim. He asked me to meet him one more time after he had applied – this time in daylight. When I got to the town centre he presented me with flowers that he had bought, and told me that he wanted to take me to dinner. I was so humbled that I had to fight back tears. I know how little asylum seekers get each week (£39), and I knew he must have saved for weeks to be able to buy me dinner. But it was something he wanted to do, and refusing would have been terribly hurtful to him. So I accepted, and had a wonderful evening out, knowing that without the Access Team this would not have been possible. I’ll never forget how happy he was to now at least have a chance to fulfil his dreams of a new life. This morning I got another call from Ervin, one of the most wonderful calls I’ve ever received. He had won his asylum case, he told me, overjoyed. He had refugee status in the UK, and could now start his life again. “You saved my life,” he said. “Without you I would not be here.” They were such deeply moving and incredibly humbling words to hear; having someone tell me that makes me feel my work is invaluable, and gives me everything I need to carry on. This whole case has had a profound influence on me, and makes me more determined than ever to increase the size and scope of our work here. The Access Team has grown and built on its experiences a great deal since that night last September, and it is able to help in so many, many ways. However, demand still outpaces it, and there are thousands of people out there needing our help. Now we have the knowhow, we need your help too.  If you have a passion for a fair society and time you can dedicate to us, why not apply to join the access team? Email: access@care4Calais.org to get started. Names have been changed"}