{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"First Rwanda detainee released - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"88NcR5GRq1\"><a href=\"https:\/\/care4calais.org\/news\/first-rwanda-detainee-released\/\">First Rwanda detainee released<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/first-rwanda-detainee-released\/embed\/#?secret=88NcR5GRq1\" width=\"600\" height=\"338\" title=\"&#8220;First Rwanda detainee released&#8221; &#8212; Care4Calais\" data-secret=\"88NcR5GRq1\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/24909708-EB67-425F-9592-A1B39768E770.jpeg","thumbnail_width":596,"thumbnail_height":596,"description":"&nbsp; Today we have some great news. The first of the people who were given Rwanda notices has been released from detention. We are so relieved for him and his family. But he should never have been put through this ordeal in the first place. The man &#8211; we’ll call him N &#8211; said he was so emotional on hearing the good news. He couldn’t believe it, he said, and even wanted to cry. When you hear this amazing man’s story you will understand that he is not one to shed tears easily. He asked me to pass on a message to the 99 people who are still in detention and in receipt of the dreaded Rwanda notices. “Don&#8217;t give up my brothers,” hecsaid. “Since we left our homes it has been so hard. Don’t give up now. Be strong.” He said he will be staying in touch with as many of them as he can, to help them through the coming nights which are so long and frightening for them all. N left Sudan in 2015, after the Janjaweed militia attacked his village and killed his mother and sister. They also shot and crippled his father, and shot N in the head and back and left him for dead. Luckily people from an NGO found him and took him to a hospital at a refugee camp. But the refugee camp was not really safe either, also suffering ongoing attacks from the Janjaweed. When N recovered, he ran away and took a couple of months to cross the Sahara and reach Libya. But as many of us know Libya is a very dangerous place. N was taken captive, and imprisoned for nearly two years, forced to do hard labour while being beaten and kept short of food. When N finally escaped he made the terrifying trip across the Mediterranean. He has a cousin in the UK and so headed for Calais. Having no money to pay smugglers he tried to sneak into lorries at night, but one night the French police caught him and beat him badly, kicking him in the face and head. The beating was so severe that his eyesight remains impaired to this day. Finally he reached what he believed to be the safety of the UK. But less than 24 hours after arriving he was given a letter saying he was to be sent to Rwanda. “I was totally destroyed and broken” he said “I could not believe the UK would do this. I have suffered so much. The cruelty was a shock. I showed them the marks all over my body and asked how they could do this to me.” —————- Priti Patel says that critics of the Rwanda plan have failed to offer their own solutions. We think the solution is staring her in the face. If visas to cross the Channel were given to all refugees in exactly the same way they are given to those from Ukraine, there would be no more small boats making the crossing. Simples. Let’s face: it no Ukrainians have paid a people smuggler and no Ukrainians have climbed into a flimsy boat to cross the Channel. Why? Because when a safe and legal route exists people use it, and smugglers really do lose out. It’s not about numbers either. Between Ukraine and Hong Kong this year the UK is taking in ten years worth of Channel refugees. Priti Patel is to people smugglers what prohibition was to Italian organised crime. While outwardly proclaiming a desire to stamp them out, she both creates and intensifies the very conditions in which they survive. We are fighting to #StopRwanda. To find out how you can help go to care4calais.org\/stop-rwanda\/"}