{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Salah and me - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"3WZUNVdsFG\"><a href=\"https:\/\/care4calais.org\/news\/salah-and-me\/\">Salah and me<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/salah-and-me\/embed\/#?secret=3WZUNVdsFG\" width=\"600\" height=\"338\" title=\"&#8220;Salah and me&#8221; &#8212; Care4Calais\" data-secret=\"3WZUNVdsFG\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/12\/Untitled-design-3.jpg","thumbnail_width":808,"thumbnail_height":1000,"description":"&nbsp; Salah and I have been best friends since 2017. Four years ago we met at my first refugee camp in Rome. Two weeks ago, Salah walked me into my first camp in Calais. Us both, as equals, proudly wearing our Care4Calais hi-vis&#8217;. &#8220;You looked a little lost,&#8221; Salah recalled of the first time we met in Baobab Camp. We laugh about it now &#8211; but I really, really was. I didn&#8217;t know what to do or where to look and I&#8217;d gotten myself in a right divvy. I was young and fairly inexperienced (despite eight years of aid work), fresh as a human rights law graduate providing legal aid to refugees. Salah simply came over and said, &#8220;come, come, my friend, we&#8217;ll have tea&#8221; (don&#8217;t the best kind of friendships start over a cup of tea?) I was in the camp for about two weeks before having to return back to Edinburgh. In those two weeks that tea blossomed into a friendship so organic, joyous and marvelous. To Salah, it also meant something a little different. We recall that on my last night, I took him to an Ethiopia Restaurant near the camp. &#8220;It was the first time I felt human, you weren&#8217;t embarrassed to be seen with me anywhere,&#8221; says Salah. &#8220;It was an incredibly painful time in my life.&#8221; Baobab camp was constantly raided, shops, cafes and restaurants often blocked any Black\/&#8217;foreign&#8217; people from entering and refugees only showered once a week because no leisure centers would offer more. Facetimes, phone calls and visits to Salah (as it&#8217;s unlikely he&#8217;ll ever be able to come to the UK) ensued. I was there when he got his refugee result (gosh, did we cry!), when he received a University scholarship and when he acted as a professional interpreter for the first time. This has all been achieved by a boy who&#8217;s life was torn upside down by the Janjaweed. Who&#8217;s seen unimaginable measures of pain, torture and death. Who was taken, in Libya, as a slave for eleven months. Who was imprisoned. And who, at one of his last hurdles to safety, nearly drowned crossing. But to me, his past does not define him. Sure, it&#8217;s a part of him &#8211; but Salah is not &#8216;Salah the refugee&#8217; he&#8217;s just Salah. My best friend. The person who&#8217;s pulled me out of deep, dark holes and who&#8217;s challenged me to countless debates. The friend who always needs a new book, who taught me how to make chicken stew and who cracks me open a beer as I scoff at the news. Perhaps more profoundly, I was the one he wanted there when he got his refugee result, when he got his University scholarship and when he acted as an interpreter for the first time. And similarly, he was the first person I called when I received acknowledgements from both the Royal family and the Red Cross for &#8220;extraordinary&#8221; humanitarian service &#8211; and he has been such an inspiration to both, he&#8217;s the reason I published a book. When I asked Salah to describe in his own words, what it means to just be &#8216;Salah&#8217; to me, not &#8216;Salah the refugee&#8217; he replied, &#8220;this means a lot,&#8221; and paused. &#8220;This is very deep. I feel that I have my proper identity, which people tried to shed from me. But you didn&#8217;t do that &#8211; you gave me my identity. Salah is Salah. It&#8217;s a very very cool thing for me. You don&#8217;t know what that means for me. Yes, it&#8217;s true we grew up in different environments, but that is one of the richest things of our friendship. Diversity means richness. In the natural environment, we see diversity in forests. It means richness. Now I live in France, with different people, different culture, different religion and different attitudes. A lot of things are different &#8211; and this is good. This is rich. But one thing I know will stay the same. You will always, always be my friend.&#8221; I will be. And now, I am also his colleague. He spent four days in Calais acting as an interpreter, mucking in at the warehouse and helping with distributions across Calais and Dunkirk. It feels almost poetic &#8211; a full circle. Not only the synergy between meeting in a refugee camp and him walking me into another first. But to meet Salah as &#8220;a refugee&#8221; and for Salah to now help refugees. I&#8217;ve got to say &#8211; I&#8217;m bloody proud of my mate. If you want to become a volunteer in Calais, we really need people this winter. Please email clare@care4calais.org with your interest. Maybe you too will find a best friend. I hope you do. I feel so incredibly lucky."}