{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Razik’s Story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"ELNPhJfYv9\"><a href=\"https:\/\/care4calais.org\/news\/raziks-story\/\">Razik’s Story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/raziks-story\/embed\/#?secret=ELNPhJfYv9\" width=\"600\" height=\"338\" title=\"&#8220;Razik’s Story&#8221; &#8212; Care4Calais\" data-secret=\"ELNPhJfYv9\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/06\/Untitled-design-5.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"“If you don’t believe and do as God asks, you must be killed.” That’s what the officer at my local Sharia court in Pakistan said to me one day when he heard me questioning my friend on some of his religious beliefs. I lived near the border with Afghanistan, and the man was a member of the Taliban, so it was a worry. He began watching me, and he and other members of the court would drive slowly past my house staring. I knew one day he would drive past with a gun – after all there was no law to stop him &#8211; because Sharia is religious law and supports the killing of people who go against the teachings. So I had to leave Pakistan if I wanted to live. My family is still there but my mother passed away not long ago. I made it to the UK, but I am still worried. The Taliban’s tentacles are very long, so I can’t show my face in a photo as it is too dangerous for my family. My home is a place called Chaman. It’s in Pakistan on the maps but the tribes people ignored the borders. Now they are building a massive fence to divide the countries but that’s a new thing. The land is incredibly rugged, beautiful in its wildness but a really tough place to make a living. Chaman is surrounded by mountains, and the land is dry, nearly a desert, very little grows and our food is brought in from the Punjab. There has been war in Afghanistan for over 40 years now. It has traumatised the nation and created a culture of violence and extremism. There is little work and much poverty and hardship and it’s become a hotbed of extremism. If people want work they travel to Kandahar over the border and thousands do every day. Kandahar is a trade and commerce hub in the region.  But it’s not only people who look for work who pass the border arbitrarily, Chaman is a safe haven for the Taliban who fight in Afghanistan during the days and the summers and come back to Chaman at night. I don’t remember much of my early childhood but from about the age of seven or eight I remember being insulted, abused and bullied by Islamic teachers at my school. We did not learn much we were just forced to learn the Islamic scripts and they would torture us if we could not recite them perfectly. Sexual harassment was a daily occurrence and there was no one we could tell. We’d spend all morning in school doing Arabic studies and then all afternoon at the mosque learning it again. Taliban fighters filled the town and they watched you all the time &#8211; the sexual abuse was pervasive. But still I stayed, I moved to Quetta and finished my degree in medical sciences and really didn’t think of leaving. This was just how life was on the frontier, so we accepted it. Then one summer I made friends with a Taliban guy. He was in town for the winter and he opened a dairy shop selling yoghurt and milk. I would sit and talk with him. He said he would go back to Afghanistan to fight again in the summer. But he was more open than most and we talked of many things. I questioned his beliefs and tried to be logical. But these people have been so indoctrinated they can not see outside the teachings.  They say you must do what God wants and there is no other path. One day we were talking when another Taliban, the guy who threatened me, joined us. He could not take my questioning. He said if you do not believe and do as God asks you must be killed. This was not a joke or an idle threat. Life means little to the Taliban, maybe it’s because life is so hard on the frontier. They believe life is just temporary and heaven is the reward if you sacrifice your life. You will receive 17 beautiful brides and have all the respect you deserve. They believe so strongly in Jihad, if you did not believe in Jihad you must be killed and I stupidly argued this was not the only way. And that was why he began watching me. In 2016 I fled to Iran, then Turkey, Greece, Italy and France. I spent three years in France and twice they denied my asylum claim. They did not believe my life was in danger, but no one in Europe can know what life is like on that border, it’s like another world. So I went to Calais and I spent a year in the small jungles there trying to get across. I finally made it and not so long ago my Dublin ended so I could apply for asylum in the UK. Now I am just waiting. In Calais, I got to know Care4Calais and they have helped me find a lawyer here, so I am hopeful. Right now, I volunteer for them as an interpreter. I’m in Eccles, Manchester. It’s a big city but I really like it, it’s so free, you can say what you like and people listen and they may not agree but they don’t shoot you for that here. I love physics, and its logical sense. It’s probably what got me into so much trouble back home when I questioned God and Jihad as being the right way. I love Stephen Hawking’s books and ideas so much! It’s fascinating to learn who we are and what will become of us. I like Einstein too and the amazing documentaries on TV. I love the discovery channel, but I love to read too. Books are a bit expensive as I only have £39 a week, but sometimes I can find one really cheap in the charity shops. As I said, I still have to be careful. Even now my [&hellip;]"}