{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Meet Karam, our amazingly social volunteer! - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"bThhHru7DH\"><a href=\"https:\/\/care4calais.org\/news\/meet-karam-our-amazingly-social-volunteer\/\">Meet Karam, our amazingly social volunteer!<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/meet-karam-our-amazingly-social-volunteer\/embed\/#?secret=bThhHru7DH\" width=\"600\" height=\"338\" title=\"&#8220;Meet Karam, our amazingly social volunteer!&#8221; &#8212; Care4Calais\" data-secret=\"bThhHru7DH\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2023\/04\/1.jpg","thumbnail_width":750,"thumbnail_height":750,"description":"Every weekend in Nottingham, something amazing happens.  We have a big, get-together for dozens of refugees and volunteers. It’s either at a park or community centre, and it’s like a party that makes everyone feel happy and welcome for days. Last week I asked someone how it got started. The answer, as is so often the case in the Midlands, was simply “Karam”. Karam coordinates Care4Calais work in the East Midlands, and she’s amazing. It’s not just the huge amount of work she does, it’s also the way she inspires people and brings them together. No Care4Calais group in Nottingham for her to join? OK, she’ll start one. No volunteers living near a hotel housing refugees? Well then she’ll message a friendly-looking local Facebook group. As a result she now has a hard-working network all over her area. “She once told me there were lots of like-minded groups who didn’t know each other,” one volunteer told me. “So if you got volunteers to make contact and work together, it was the best way of leveraging your time to grow your numbers. She’s such a kind, warm-hearted person, but she’s also got an amazing eye for organising things like that.” She began volunteering in the first COVID lockdown, when she heard refugees in hotels were barely being allowed out of their rooms. This was not only unfair, it breached their human rights; determined to do something about it, she began visiting hotels. Managers were sometimes hostile at first, but naturally she won them round and soon she was taking people out, then organising distributions of essential items. Once when she was giving out mobile phones she’d collected, the police came to investigate; by the time she’d explained, they were congratulating her on the work she was doing. The network she has helped to build up has been incredibly important in the last few months, when the far right has been active in the region. Karam isn’t directly involved in every pro-refugee demonstration, but as another volunteer says, “she always replies quickly, and has good advice and ideas about what to do.” She is also as reliable as a rock. “She doesn’t shout about what she’s doing from the rooftops, which is easy to do. But she always, always sees a job through, and when you’re working with refugees, you have to do that. When it comes to helping people get to their interviews or fixing something at their accommodation, Karam will either be there herself, or talking to someone to give them advice on how to help.” And what motivates her? “Just that the refugees you meet are so amazing that you want to carry on helping them, and that there are so many others who want to welcome them,” she says. “You have to remember there are lots of people from all walks of life who support refugees, and are willing to help if you ask. They all understand that the only way to defeat hate is with love.”"}