{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Armin's story - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"Z380BVZCve\"><a href=\"https:\/\/care4calais.org\/news\/armins-story\/\">Armin&#8217;s story<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/armins-story\/embed\/#?secret=Z380BVZCve\" width=\"600\" height=\"338\" title=\"&#8220;Armin&#8217;s story&#8221; &#8212; Care4Calais\" data-secret=\"Z380BVZCve\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/06\/The-UK-is-the-only-place-I-am-safe..png","thumbnail_width":1080,"thumbnail_height":1080,"description":"I was out on my morning bike ride when they came to my house. I had left as usual about 6.30 to have a bike ride before I left for my work as a teacher. As I approached the house when I came back, I could see three cars outside, and seven or eight people around the door. I hung back, and then my wife text me not to come home. I didn’t know it then, but when I had left home that morning, it was the last time I would see my children. My name is Armn, and I&#8217;m from Iran. I grew up in a religious household, so prayer became very important to me. But from quite early on, I had doubts about Islam. I believed in an omnipotent God, and that was a comfort to me, but some of the religion’s ways and teachings as I experienced them were not right for me. My conversion to Christianity took a lot of thought, but once I had made the decision it was final. There are many Christians in Iran, but they do not reveal themselves, and often hide their faith. I became more active, and I began distributing Bibles from “pop-up” churches. So when the authorities came to my house they found the Bibles; I had no defence, as the evidence was right there. It made things worse that I am Kurdish, part of the minority population in Iran. I had an education and a decent job, a job I loved. I was a good popular teacher, and I loved my students, but you are often viewed with suspicion by the authorities. When the men came to the house that morning, I was in shock and was didn’t know what to do. I just rode my bike around for hours, but there was nowhere I could go. I’d been a schoolteacher in Iran for more than 20 years it was all I knew. I finally called my older brother, and he told me not to go home. If I’d been caught I would have been arrested, sent to prison and then hanged as a preacher of Christianity. I think it was at this point I realised I would not see my children again. I couldn’t stop the tears, and even now it is so painful to think about. My brother said I must go to a different city for a few nights, and then to the border with Turkey. At the border it is easy to buy a fake passport, and I found an agent (a smuggler) who got me over the border and into Istanbul. I stayed in a small house for eight days while they got me a European passport. Then one night he said, “You will leave tomorrow at midnight. Ask no questions, do not talk to me or about me.” My plane landed in another European country, I do not know which one. I was arrested at the customs and put in detention – the hand cuffs were so tight I still have the marks they left. I’d always been a good citizen and never broken any laws, so I was so scared all the time, and I just kept saying “I am only a teacher”. There were no interpreters so I did not know what was going to happen to me. I was sure I would be deported. But the next day I was taken to a new place and made to sign papers and told I must leave the country. They gave me my bags, but not the passport. Within days the smuggler got back in touch – they had been watching, and had known this would happen. I then spent 20 days in various places and cars moving around. My phone was taken from me. Finally the smuggler said, “Your flight is tomorrow night”. The smuggler gave me my new passport, and we got on the plane. The agent came with me but I wasn’t allowed to talk to him. I was told I had to pretend to be asleep the whole flight. He took my passport off me before we were seated. When we landed I realised I was in the UK. There was a long queue to get through passport control. I was so scared I went to the back of the queue three times before I dared go through. The Border agent had a headscarf on so I knew she was Muslim – I thought when she saw me, she would shout, “Here he is! Arrest him!” She asked me for my passport. I said I didn’t have one. She did not believe me, but then understood. She said I must report to a police station. I did that, and they took me to a building where I claimed asylum. I had my screening interview, and they took me to a hotel. And that’s where I am now. I am just happy to be alive. I spoke to my wife for the first time when I got to the hotel. But there was no talking, just crying, we were so happy to all be alive. I never expected to have to leave but I thought the UK was the safest place in the world. That was until I heard about the Rwanda plan. I have not been sent a letter saying I will be sent to Rwanda, but I am still terrified in case they do try to send me. The UK is the only place I am safe. The Iranian authorities can’t reach me here. Even in Germany they have killed people. I know they could get to me easily in Rwanda, so it isn’t safe at all. The fear of being sent there means I can’t eat, I am not sleeping, I have horrible nightmares when I do sleep. My mental health is suffering I am so scared and anxious all the time. Refugees are scared of everything, after what we have been through it [&hellip;]"}