{"version":"1.0","provider_name":"Care4Calais","provider_url":"https:\/\/care4calais.org","title":"Moj of the Access Team - Care4Calais","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"4gTpse4CA2\"><a href=\"https:\/\/care4calais.org\/news\/moj-of-the-access-team\/\">Moj of the Access Team<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/care4calais.org\/news\/moj-of-the-access-team\/embed\/#?secret=4gTpse4CA2\" width=\"600\" height=\"338\" title=\"&#8220;Moj of the Access Team&#8221; &#8212; Care4Calais\" data-secret=\"4gTpse4CA2\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script type=\"text\/javascript\">\n\/* <![CDATA[ *\/\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n\/* ]]> *\/\n<\/script>\n","thumbnail_url":"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/10\/Untitled-design.jpg","thumbnail_width":1280,"thumbnail_height":720,"description":"&nbsp; A wise friend told me once that once you are successful you must put the money in your bank from your work, but you must also put a deposit in nature’s bank, and one day that will repay you too. So that’s what I am doing now.  I work for Care4Calais as a volunteer interpreter. I do my everyday work from nine to five, and after that I put my phone down. But I’ve told the people at Care4Calais that they can call me anytime, day or night, even if I’m sleeping, and I’ll answer. I’m an interpreter for my day job too. I speak English, Pashto, Dari, Hindi, Urdu and Farsi. It’s an interesting job, but I like to interpret for Care4Calais as I can add a little bit of myself to the work I do for them. I found Care4Calais on FaceBook when I was wanting to do something to help the refugees in Calais. I donated to the charity, and did a food collection which we dropped off at one of the hubs. But it didn’t feel like enough to me.  Then a friend asked why I didn’t interpret for them. That was a great idea – I hadn’t thought of it before! So I wrote in and asked if I could volunteer as an interpreter, and they emailed straight back, and I got started. I’ve been doing this for about a year now, and have no plans to stop. I think that’s why I like helping people. I get great satisfaction from knowing that I’ve made someone’s day better, and I understand how much they need help because I have been through it all myself. It’s really not easy coming to a new country and having to start again, and it’s especially hard if you don’t speak the language. I’m often on calls to the detention centres. People are really scared in these places, so they need a friendly voice, and I reassure them that one day they will be free. Care4Calais have helped so many people that are out now, and I can reassure them with confidence. I get them to relax and have a laugh. It’s a very frightening time for people in those centres. I hear such sad stories too, horror stories that make you want to put down the phone, stories that no one should have to hear, never mind live through, but I must remain professional and just keep interpreting the words. Some young men cry through their interview, which is heart-rending, but I do reassure them that we will do everything it’s humanly possible to do to make sure that they’re safe. I remember one Iranian boy who was struggling, and I had to break the news to him that the solicitors had lost all his papers. The boy was not in good health, and it was painful to give him the news because without the papers, the case becomes  hard and long. You become very close to some people. They tell you secrets and memories from the heart of their soul. Sometimes they tell you things that they don’t want to remember, but you hear them and listen. So they become part of your family, and you always want to know what happens to them.  In fact, in my job as an interpreter I rarely know what happens to people, unless by chance I answer a follow up call. Technically I don’t have to do any more, but as a human you do. This is why I like the Care4Calais work. I work mainly with the access team, who help asylum seekers find solicitors who will help them. The team does a brilliant job and they are all so professional – and they do a lot more than just help people find solicitors. They can also be a listening ear, and they find clothes and doctors, English lessons and school places for children. They are simply a brilliant team and an amazing resource for vulnerable asylum seekers; without them there would be many, many more destitute asylum seekers on the street. The access team are currently recruiting as there is so much demand for their help. If you can consistently give 10-20 hours to change people’s lives forever please email access@care4calais.org"}