{"id":26565,"date":"2021-05-29T10:00:56","date_gmt":"2021-05-29T10:00:56","guid":{"rendered":"https:\/\/care4calais.org\/?p=26565"},"modified":"2021-11-10T23:56:14","modified_gmt":"2021-11-10T23:56:14","slug":"the-aspen-emergency","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-aspen-emergency\/","title":{"rendered":"The Aspen Emergency"},"content":{"rendered":"<p>This weekend, many asylum seekers are facing a dire emergency.<\/p>\n<p>In almost every region, vulnerable people – including the old, the disabled, and families with babies and toddlers – are being left without food or money after having their financial support effectively cut off by the Home Office.<\/p>\n<p>Our volunteers are delivering food parcels and providing food vouchers where possible. We are deeply concerned about the next few days.<\/p>\n<p>The problem originates from the Home Office’s botched switching of contracts between two private companies it pays to run Aspen cards. Aspen cards are a kind of debit card given to asylum seekers so they can spend £5.66 a day (£1.14 if they are in a full-board hotel) on basic necessities. In the vast majority of cases this is the only source of money they have.<\/p>\n<p>Aspen cards were, until last week, administered by Sodexo, a French food services and facilities management company. When the Home Office switched the contract to Prepaid Financial Services (PFS), a fintech firm, it provided the names and addresses of the people who should be sent new Aspen cards. PFS duly posted out the cards, and last weekend the old ones were cancelled.<\/p>\n<p>However, in hundreds of cases the Home Office provided the wrong addresses. In some instances cards were sent to hotels from which people had been moved two months ago. One man’s card was posted to an address he had not lived in for seven months.<\/p>\n<p>Other recipients have received their cards, only to find they cannot be activated. With contacting the helpline proving all but impossible due to overload, people have been forced to look for food wherever they can. Foodbanks and other support organisations have been overwhelmed, asylum seeking families left to go hungry.<\/p>\n<p>The Home Office has said it will ensure everyone has a card by Tuesday June 1, but even if that target is met, it will mean some people have been without food or money for 11 days.<\/p>\n<p>It is an astonishing situation in many ways.<\/p>\n<p>Yes, transfers of data between organisations can be problematic. But the Home Office planned this contract transfer months in advance, and it was providing only information that sits &#8211; or should sit &#8211; in its own records.<\/p>\n<p>The result is that vulnerable people who have appealed to this country for shelter and compassion are left destitute and hungry.<\/p>\n<p>In many cases, the only thing between them and despair and serious health risks is the kindness and generosity of people like our volunteers and supporters.<\/p>\n<p>To help during the Aspen Emergency go to <a href=\"http:\/\/care4calais.org\/donate\">care4calais.org\/donate<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This weekend, many asylum seekers are facing a dire emergency. In almost every region, vulnerable people – including the old, the disabled, and families with babies and toddlers – are being left without food or money after having their financial support effectively cut off by the Home Office. Our volunteers are delivering food parcels and providing food vouchers where possible. We are deeply concerned about the next few days. The problem originates from the Home Office’s botched switching of contracts between two private companies it pays to run Aspen cards. Aspen cards are a kind of debit card given to asylum seekers so they can spend £5.66 a day (£1.14 if they are in a full-board hotel) on basic necessities. In the vast majority of cases this is the only source of money they have. Aspen cards were, until last week, administered by Sodexo, a French food services and facilities management company. When the Home Office switched the contract to Prepaid Financial Services (PFS), a fintech firm, it provided the names and addresses of the people who should be sent new Aspen cards. PFS duly posted out the cards, and last weekend the old ones were cancelled. However, in hundreds of cases the Home Office provided the wrong addresses. In some instances cards were sent to hotels from which people had been moved two months ago. One man’s card was posted to an address he had not lived in for seven months. Other recipients have received their cards, only to find they cannot be activated. With contacting the helpline proving all but impossible due to overload, people have been forced to look for food wherever they can. Foodbanks and other support organisations have been overwhelmed, asylum seeking families left to go hungry. The Home Office has said it will ensure everyone has a card by Tuesday June 1, but even if that target is met, it will mean some people have been without food or money for 11 days. It is an astonishing situation in many ways. Yes, transfers of data between organisations can be problematic. But the Home Office planned this contract transfer months in advance, and it was providing only information that sits &#8211; or should sit &#8211; in its own records. The result is that vulnerable people who have appealed to this country for shelter and compassion are left destitute and hungry. In many cases, the only thing between them and despair and serious health risks is the kindness and generosity of people like our volunteers and supporters. To help during the Aspen Emergency go to care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":33104,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/26565"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=26565"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/26565\/revisions"}],"predecessor-version":[{"id":26567,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/26565\/revisions\/26567"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33104"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=26565"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=26565"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=26565"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}