{"id":26581,"date":"2021-06-01T17:00:54","date_gmt":"2021-06-01T17:00:54","guid":{"rendered":"https:\/\/care4calais.org\/?p=26581"},"modified":"2021-11-10T23:51:07","modified_gmt":"2021-11-10T23:51:07","slug":"landmark-court-win-for-refugee-accused-of-smuggling-offences","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/landmark-court-win-for-refugee-accused-of-smuggling-offences\/","title":{"rendered":"Landmark court win for refugee accused of smuggling"},"content":{"rendered":"<p>Priti Patel publicly peddles an outright lie about refugees and asylum seekers, but her deceit has just been exposed – partly thanks to Care4Calais.<\/p>\n<p>If you heard the Home Secretary’s speech about this government’s plans for immigration last week, you may have heard her bragging about “small boat related prosecutions.”<\/p>\n<p>She meant the trial and imprisonment of people caught driving small boats across the English Channel. Since the start of 2020 there have been 65 such prosecutions.<\/p>\n<p>Patel wants you to think it’s people smugglers being locked up.<\/p>\n<p>But it isn’t.<\/p>\n<p>From long experience in northern France, we know that the smugglers don’t cross with their customers. They just provide the boats and information &#8211; and profit handsomely from desperation. But not everyone has money to pay smugglers. Some attempting the crossing agree to drive the boat as a way to negotiate passage, and it is these desperate risk-takers that the courts have been prosecuting, and that Priti Patel proclaims “smugglers.” Caught on a technicality, they generally accept plea bargains, and serve between two and five years in prison. After which, of course, they are unlikely to be granted asylum.<\/p>\n<p>However, a few days before Patel’s speech, Fouad Kakaei, who is 31 and from Iran, proved the fallacy of her claim.<\/p>\n<p>Fouad had earlier won the right to appeal his own small boat prosecution. At the retrial, he won and walked free.<\/p>\n<p>Fouad’s legal team argued that he was not trying to enter the UK illegally. People crossing the channel like this aren’t.<\/p>\n<p>Knowing that there’s next to no chance of actually reaching the UK, they want to be intercepted by border patrols. Border patrols, they know, will take them to a recognised port of entry where they are legally entitled to claim asylum.<\/p>\n<p>We’re proud to say that our founder Clare Moseley was called on to provide expert testimony at the trial. She was able to call on the kind of on-the-ground experience that carries so much weight in situations such as this, demonstrating again the importance of our work.<\/p>\n<p>“I personally know well at least three men who have taken the role of driver in order to get in a boat to cross to the Channel,” Clare told the court. “In every case they were an ‘ordinary’ refugee with no motivation other than to get to the UK and claim asylum. However, none of them had any money to do this, and so they felt that this was their only option.”<\/p>\n<p>And we’re delighted to say that the case was so clear that the jury unanimously cleared Fouad of all charges in just four hours.<\/p>\n<p>Fouad’s lawyer Aneurin Brewer, told the Guardian that the case could change history.<\/p>\n<p>“The individuals on the boat were intending to be rescued at sea and were not planning to disembark and enter illegally. That means there was no breach of immigration law,” he said.<\/p>\n<p>“This verdict throws into serious doubt the viability of future prosecutions.<\/p>\n<p>“A large number of cases had been paused while this specific case was resolved and it is difficult to see now how they can go ahead. It also raises very serious questions over the convictions that have been secured to date including migrants who are serving significant prison sentences.<\/p>\n<p>“There are individuals who pleaded guilty but who will now be potentially able to go to the court of appeal.”<\/p>\n<p>In future, Patel may not only find herself unable to announce fewer prosecutions.<\/p>\n<p>She may also have to admit the ones the Crown Prosecution Service secured were unjust.<\/p>\n<p>To support our work go to <a href=\"http:\/\/care4calais.org\/donate\">care4calais.org\/donate<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Priti Patel publicly peddles an outright lie about refugees and asylum seekers, but her deceit has just been exposed – partly thanks to Care4Calais. If you heard the Home Secretary’s speech about this government’s plans for immigration last week, you may have heard her bragging about “small boat related prosecutions.” She meant the trial and imprisonment of people caught driving small boats across the English Channel. Since the start of 2020 there have been 65 such prosecutions. Patel wants you to think it’s people smugglers being locked up. But it isn’t. From long experience in northern France, we know that the smugglers don’t cross with their customers. They just provide the boats and information &#8211; and profit handsomely from desperation. But not everyone has money to pay smugglers. Some attempting the crossing agree to drive the boat as a way to negotiate passage, and it is these desperate risk-takers that the courts have been prosecuting, and that Priti Patel proclaims “smugglers.” Caught on a technicality, they generally accept plea bargains, and serve between two and five years in prison. After which, of course, they are unlikely to be granted asylum. However, a few days before Patel’s speech, Fouad Kakaei, who is 31 and from Iran, proved the fallacy of her claim. Fouad had earlier won the right to appeal his own small boat prosecution. At the retrial, he won and walked free. Fouad’s legal team argued that he was not trying to enter the UK illegally. People crossing the channel like this aren’t. Knowing that there’s next to no chance of actually reaching the UK, they want to be intercepted by border patrols. Border patrols, they know, will take them to a recognised port of entry where they are legally entitled to claim asylum. We’re proud to say that our founder Clare Moseley was called on to provide expert testimony at the trial. She was able to call on the kind of on-the-ground experience that carries so much weight in situations such as this, demonstrating again the importance of our work. “I personally know well at least three men who have taken the role of driver in order to get in a boat to cross to the Channel,” Clare told the court. “In every case they were an ‘ordinary’ refugee with no motivation other than to get to the UK and claim asylum. However, none of them had any money to do this, and so they felt that this was their only option.” And we’re delighted to say that the case was so clear that the jury unanimously cleared Fouad of all charges in just four hours. Fouad’s lawyer Aneurin Brewer, told the Guardian that the case could change history. “The individuals on the boat were intending to be rescued at sea and were not planning to disembark and enter illegally. That means there was no breach of immigration law,” he said. “This verdict throws into serious doubt the viability of future prosecutions. “A large number of cases had been paused while this specific case was resolved and it is difficult to see now how they can go ahead. It also raises very serious questions over the convictions that have been secured to date including migrants who are serving significant prison sentences. “There are individuals who pleaded guilty but who will now be potentially able to go to the court of appeal.” In future, Patel may not only find herself unable to announce fewer prosecutions. She may also have to admit the ones the Crown Prosecution Service secured were unjust. To support our work go to care4calais.org\/donate.<\/p>\n","protected":false},"author":21,"featured_media":33101,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/26581"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=26581"}],"version-history":[{"count":5,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/26581\/revisions"}],"predecessor-version":[{"id":26592,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/26581\/revisions\/26592"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33101"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=26581"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=26581"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=26581"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}