{"id":27297,"date":"2021-06-15T17:00:11","date_gmt":"2021-06-15T17:00:11","guid":{"rendered":"https:\/\/care4calais.org\/?p=27297"},"modified":"2021-11-10T23:25:07","modified_gmt":"2021-11-10T23:25:07","slug":"refugee-week-2021-eliass-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/refugee-week-2021-eliass-story\/","title":{"rendered":"Refugee Week 2021: Elias’s story"},"content":{"rendered":"<p>I haven’t seen my mum for a long, long time, and I don’t know where she is. I don’t know if my dad’s alive or dead. I came from Eritrea, but I’ve been travelling for so many years now. The thing that has really kept me alive is my dream of being an artist.<\/p>\n<p>Do you mind if I don’t tell you all the details of my story in Eritrea? It makes me feel bad to remember it. I can tell you that it was my mum that made our family leave, when I was small. She is my hero. And yet, I don’t see her any more.<\/p>\n<p>We spent time in Ethiopia before I set out on my own for Sudan. I passed through Egypt and finally made it to northern France. It was my wish to come to London; I knew people would be open, and accept me here. And I always dreamed of seeing all the famous art galleries in the city, of seeing the famous paintings I had heard about, and of taking proper art lessons.<\/p>\n<p>I’ve been drawing and painting since I was about ten. It is something I have to do, and I feel only half alive when I cannot make art. It is like breathing fresh air. I’m just self taught though, I’ve not been to college or studied it. I drew and painted as I travelled, and when I made it to the Jungle in Calais, I painted a lot there as I waited and waited to find a way to get to the UK.<\/p>\n<p>I never sold my pictures for money but sometimes I would get food or a place to stay in exchange. I used to paint at the big Eritrean Church in the camp, until it was destroyed. These tattoos were done in exchange for some of my paintings. A lot of my pictures are still in Calais.<\/p>\n<p>I was stuck there, living on the streets for nearly four years. I couldn’t get a boat, and sometimes you just don’t find the right lorry. It takes time. By the end I was not in a good way mentally or physically; I know people who met me thought I might not survive another winter. But I never gave up, and I held on to my dream of getting to the UK.<\/p>\n<p>In March this year, I finally made it over. Now I’m living in Lewisham in south London. London is everything I thought it would be, the best city in the world! I know there are people here who do not want us refugees, but so far I have not met any. I have so many friends, people I met in Calais over the years. I know many Care4Calais volunteers, they are my friends. Everyone is so open and accepting, as I hoped they would be.<\/p>\n<p>Right now I like to paint realistic pictures, you know, landscapes and people on really big canvases. I like to stand up and paint, big movements and big dreams.<\/p>\n<p>I’m not painting right now as I’ve run out of supplies, and there really isn’t any room in the hostel I am in. I guess that’s another dream, to find a space for a studio or an easel at least.<\/p>\n<p>I want to visit all the London galleries, and really get started painting. When I get my interview and asylum, Inshallah, I want to sign up for art classes, maybe even university or college. Right now I’m just enjoying being here in the UK, being safe and having somewhere to sleep. It’s a good feeling being here, and I enjoy seeing all the things in London. Maybe soon I’ll paint them too.<\/p>\n<p>##refugeeweek2021<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I haven’t seen my mum for a long, long time, and I don’t know where she is. I don’t know if my dad’s alive or dead. I came from Eritrea, but I’ve been travelling for so many years now. The thing that has really kept me alive is my dream of being an artist. Do you mind if I don’t tell you all the details of my story in Eritrea? It makes me feel bad to remember it. I can tell you that it was my mum that made our family leave, when I was small. She is my hero. And yet, I don’t see her any more. We spent time in Ethiopia before I set out on my own for Sudan. I passed through Egypt and finally made it to northern France. It was my wish to come to London; I knew people would be open, and accept me here. And I always dreamed of seeing all the famous art galleries in the city, of seeing the famous paintings I had heard about, and of taking proper art lessons. I’ve been drawing and painting since I was about ten. It is something I have to do, and I feel only half alive when I cannot make art. It is like breathing fresh air. I’m just self taught though, I’ve not been to college or studied it. I drew and painted as I travelled, and when I made it to the Jungle in Calais, I painted a lot there as I waited and waited to find a way to get to the UK. I never sold my pictures for money but sometimes I would get food or a place to stay in exchange. I used to paint at the big Eritrean Church in the camp, until it was destroyed. These tattoos were done in exchange for some of my paintings. A lot of my pictures are still in Calais. I was stuck there, living on the streets for nearly four years. I couldn’t get a boat, and sometimes you just don’t find the right lorry. It takes time. By the end I was not in a good way mentally or physically; I know people who met me thought I might not survive another winter. But I never gave up, and I held on to my dream of getting to the UK. In March this year, I finally made it over. Now I’m living in Lewisham in south London. London is everything I thought it would be, the best city in the world! I know there are people here who do not want us refugees, but so far I have not met any. I have so many friends, people I met in Calais over the years. I know many Care4Calais volunteers, they are my friends. Everyone is so open and accepting, as I hoped they would be. Right now I like to paint realistic pictures, you know, landscapes and people on really big canvases. I like to stand up and paint, big movements and big dreams. I’m not painting right now as I’ve run out of supplies, and there really isn’t any room in the hostel I am in. I guess that’s another dream, to find a space for a studio or an easel at least. I want to visit all the London galleries, and really get started painting. When I get my interview and asylum, Inshallah, I want to sign up for art classes, maybe even university or college. Right now I’m just enjoying being here in the UK, being safe and having somewhere to sleep. It’s a good feeling being here, and I enjoy seeing all the things in London. Maybe soon I’ll paint them too. ##refugeeweek2021<\/p>\n","protected":false},"author":21,"featured_media":33087,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27297"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=27297"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27297\/revisions"}],"predecessor-version":[{"id":27300,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27297\/revisions\/27300"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33087"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=27297"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=27297"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=27297"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}