{"id":27521,"date":"2021-06-17T17:00:52","date_gmt":"2021-06-17T17:00:52","guid":{"rendered":"https:\/\/care4calais.org\/?p=27521"},"modified":"2024-02-21T23:12:51","modified_gmt":"2024-02-21T22:12:51","slug":"refugee-week-2021-sidis-story-and-fundraiser","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/refugee-week-2021-sidis-story-and-fundraiser\/","title":{"rendered":"Refugee Week 2021: Sidi&#8217;s story"},"content":{"rendered":"<p>Today, right in the middle of #RefugeeWeek, we had the most incredible news about our friend Sidi.<\/p>\n<p>Last year in August, Sidi attempted to get to the UK but, because he couldn’t afford to pay people-smugglers, he got in an inflatable kayak with three friends and rowed for twelve hours through the night.<\/p>\n<p>When the sun started to come up the kayak had taken on so much water they realised they wouldn’t make it. If something didn’t happen it was going to sink and they would all be lost. As one of the guys was only 16 years old, Sidi decided to jump off the kayak to save his friends. With reduced weight the kayak made it to the UK and the three remaining passengers were safe.<\/p>\n<p>Thankfully a French boat picked Sidi up and brought him back to France. When I asked him how he could have done such a crazy thing as to jump off in the middle of the Channel, he told me: &#8220;We died in our countries, we died in Libya, now we get to the UK or we die. At least I know my young friend is safe.&#8221;<\/p>\n<p>Later that year, Sidi made it to the UK and today we got the fantastic news that he has been granted asylum.<\/p>\n<p>In Mauritania Sidi was a taxi driver, and his dream now is to get a job driving taxis in the UK. However to do this he will need to register for a driving test, take lessons and pass his test, as well as getting a taxi licence. We are raising money to help him do this. You can help here <a href=\"http:\/\/goldengiving.com\/fundraising\/Sidi\">goldengiving.com\/fundraising\/Sidi<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today, right in the middle of #RefugeeWeek, we had the most incredible news about our friend Sidi. Last year in August, Sidi attempted to get to the UK but, because he couldn’t afford to pay people-smugglers, he got in an inflatable kayak with three friends and rowed for twelve hours through the night. When the sun started to come up the kayak had taken on so much water they realised they wouldn’t make it. If something didn’t happen it was going to sink and they would all be lost. As one of the guys was only 16 years old, Sidi decided to jump off the kayak to save his friends. With reduced weight the kayak made it to the UK and the three remaining passengers were safe. Thankfully a French boat picked Sidi up and brought him back to France. When I asked him how he could have done such a crazy thing as to jump off in the middle of the Channel, he told me: &#8220;We died in our countries, we died in Libya, now we get to the UK or we die. At least I know my young friend is safe.&#8221; Later that year, Sidi made it to the UK and today we got the fantastic news that he has been granted asylum. In Mauritania Sidi was a taxi driver, and his dream now is to get a job driving taxis in the UK. However to do this he will need to register for a driving test, take lessons and pass his test, as well as getting a taxi licence. We are raising money to help him do this. You can help here goldengiving.com\/fundraising\/Sidi<\/p>\n","protected":false},"author":21,"featured_media":33085,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27521"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=27521"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27521\/revisions"}],"predecessor-version":[{"id":42994,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27521\/revisions\/42994"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33085"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=27521"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=27521"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=27521"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}