{"id":27645,"date":"2021-06-18T17:11:20","date_gmt":"2021-06-18T17:11:20","guid":{"rendered":"https:\/\/care4calais.org\/?p=27645"},"modified":"2021-11-10T23:16:52","modified_gmt":"2021-11-10T23:16:52","slug":"refugee-week-2021-sanis-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/refugee-week-2021-sanis-story\/","title":{"rendered":"Refugee Week 2021: Sani’s Story"},"content":{"rendered":"<p>One day I was driving when a car deliberately swerved into me, and I broke my neck; later my mum told me the person driving the other car was my brother. I’m from an old-fashioned, very strict Muslim family in Iran, and when I changed my religion to Christian, my father and brother had a big problem with me.<\/p>\n<p>My mum said, “Sani, listen to me. He wants to kill you because he doesn’t like women working, he doesn’t like women changing their ideas, he doesn’t like women talking to men.” But I had to talk to men at my work. I was a firefighter.<\/p>\n<p>It really all started when my husband divorced me. I was depressed and stayed at home for six years, but then I got my job, and I realised I didn’t want to follow my family’s old ideas. Lady can’t swim, lady can’t go out alone, lady can’t be too happy because it’s not good for her, blah blah blah.<\/p>\n<p>But the men in my family didn’t like me thinking like this, and when I realised they wanted to kill me, I had to leave. I had a teenage son from my marriage, and I had to leave him with my family. So I headed for London because I thought it would be safe there.<\/p>\n<p>I went to Turkey, then Greece and then walked with a group of families through forests in Bosnia and Croatia. We drank rainwater, and slept behind rocks to hide. We saw bears and wolves. It lasted two and a half months. Then we met a smuggler and he took us to northern France, or Belgium, I’m not sure.<\/p>\n<p>In October I got on a boat to the UK. As he pushed us off early one morning, the smuggler warned us that if we came back he would kill us and bury us in the woods.<\/p>\n<p>Then as soon as we were out on the sea we saw a big ship coming towards us; I thought I was going to be minced beef going through its propeller. One man went crazy and started unscrewing the cap to let the air out of the dinghy. “You are crazy!” I shouted. “Put that back!<\/p>\n<p>We drove right across the Channel and landed on the shore, and the police picked us up. I’ve been in London since then, waiting for an asylum interview. At first I was in shock and couldn’t talk to anyone, but now I go walking, I do some fitness, I’m learning English.<\/p>\n<p>I hope so much that I get asylum, because then my son will be able to come to me. He’s 16 now. My brother shouts at him a lot, and he leaves home sometimes. If he comes, we can make a new life here where we are safe – I don’t think I will be a firefighter here, but I will find something.<\/p>\n<p>We have only one chance at this life, not two, so I want to forget the past, and look forward.<\/p>\n<p>#RefugeeWeek2021<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One day I was driving when a car deliberately swerved into me, and I broke my neck; later my mum told me the person driving the other car was my brother. I’m from an old-fashioned, very strict Muslim family in Iran, and when I changed my religion to Christian, my father and brother had a big problem with me. My mum said, “Sani, listen to me. He wants to kill you because he doesn’t like women working, he doesn’t like women changing their ideas, he doesn’t like women talking to men.” But I had to talk to men at my work. I was a firefighter. It really all started when my husband divorced me. I was depressed and stayed at home for six years, but then I got my job, and I realised I didn’t want to follow my family’s old ideas. Lady can’t swim, lady can’t go out alone, lady can’t be too happy because it’s not good for her, blah blah blah. But the men in my family didn’t like me thinking like this, and when I realised they wanted to kill me, I had to leave. I had a teenage son from my marriage, and I had to leave him with my family. So I headed for London because I thought it would be safe there. I went to Turkey, then Greece and then walked with a group of families through forests in Bosnia and Croatia. We drank rainwater, and slept behind rocks to hide. We saw bears and wolves. It lasted two and a half months. Then we met a smuggler and he took us to northern France, or Belgium, I’m not sure. In October I got on a boat to the UK. As he pushed us off early one morning, the smuggler warned us that if we came back he would kill us and bury us in the woods. Then as soon as we were out on the sea we saw a big ship coming towards us; I thought I was going to be minced beef going through its propeller. One man went crazy and started unscrewing the cap to let the air out of the dinghy. “You are crazy!” I shouted. “Put that back! We drove right across the Channel and landed on the shore, and the police picked us up. I’ve been in London since then, waiting for an asylum interview. At first I was in shock and couldn’t talk to anyone, but now I go walking, I do some fitness, I’m learning English. I hope so much that I get asylum, because then my son will be able to come to me. He’s 16 now. My brother shouts at him a lot, and he leaves home sometimes. If he comes, we can make a new life here where we are safe – I don’t think I will be a firefighter here, but I will find something. We have only one chance at this life, not two, so I want to forget the past, and look forward. #RefugeeWeek2021<\/p>\n","protected":false},"author":21,"featured_media":33084,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27645"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=27645"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27645\/revisions"}],"predecessor-version":[{"id":27650,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27645\/revisions\/27650"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33084"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=27645"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=27645"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=27645"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}