{"id":27674,"date":"2021-06-19T18:00:14","date_gmt":"2021-06-19T18:00:14","guid":{"rendered":"https:\/\/care4calais.org\/?p=27674"},"modified":"2021-11-10T23:15:09","modified_gmt":"2021-11-10T23:15:09","slug":"people-smuggling-charges-dropped-for-refugees-after-successful-appeal","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/people-smuggling-charges-dropped-for-refugees-after-successful-appeal\/","title":{"rendered":"People smuggling charges dropped for refugees after successful appeal"},"content":{"rendered":"<p>Some brilliant news at the end of Refugee Week!<\/p>\n<p>On Friday, eleven refugees had charges for driving small boats across the English Channel dropped.<\/p>\n<p>This follows a recent successful appeal by Fouad Kakaei, an Iranian asylum seeker who spent 17 months in prison on remand. On appeal in May, his conviction was overturned.<\/p>\n<p>Priti Patel has boasted of these prosecutions, claiming the people involved were people smugglers. They are nothing of the kind; smugglers do not travel with their customers. People in this position are often simply refugees who cannot afford to pay a smuggler. Not everyone has money for this.<\/p>\n<p>Judge Rupert Lowe said: “The pilot-migrant in the type of case under consideration here is not in any realistic sense acting as part of a trafficking gang &#8230;he is one of a boatload of migrants who are effectively indistinguishable from one another, except for that fact that he happens to have agreed to steer.”<\/p>\n<p>A report by the Independent Chief Inspector of Borders and Immigration said smuggling activity was mostly taking place in France and there were “no organised crime group members onboard the boats”.<\/p>\n<p>Fouad&#8217;s case is important because it could mean a shift in approach to these prosecutions. And that shift will have important consequences not only for refugees crossing the Channel in future, but also for those prosecuted in the past.<\/p>\n<p>Since the start of 2020, 65 people have received prison sentences following similar cases. Aneurin Brewer, the barrister who represented Fouad, has urged their representatives to consider appeals.<\/p>\n<p>It is now to be hoped that the prosecution of these notorious “small boats cases” will now stop, or at least become rare. However pressure from the Home Office means that immigration officers will doubtless attempt to find other ways to prosecute refugees entering the UK.<\/p>\n<p>Read the full story <a href=\"https:\/\/www.independent.co.uk\/news\/uk\/home-news\/english-channel-crossings-migrants-charges-b1868683.html?fbclid=IwAR1TLK246j5iBI2VUyl3yLVSga3pPQcx8cYR4yztwCIDr1zyxR97OflPpkk\">here<\/a>.<\/p>\n<p>Photo: Getty (The Independent)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Some brilliant news at the end of Refugee Week! On Friday, eleven refugees had charges for driving small boats across the English Channel dropped. This follows a recent successful appeal by Fouad Kakaei, an Iranian asylum seeker who spent 17 months in prison on remand. On appeal in May, his conviction was overturned. Priti Patel has boasted of these prosecutions, claiming the people involved were people smugglers. They are nothing of the kind; smugglers do not travel with their customers. People in this position are often simply refugees who cannot afford to pay a smuggler. Not everyone has money for this. Judge Rupert Lowe said: “The pilot-migrant in the type of case under consideration here is not in any realistic sense acting as part of a trafficking gang &#8230;he is one of a boatload of migrants who are effectively indistinguishable from one another, except for that fact that he happens to have agreed to steer.” A report by the Independent Chief Inspector of Borders and Immigration said smuggling activity was mostly taking place in France and there were “no organised crime group members onboard the boats”. Fouad&#8217;s case is important because it could mean a shift in approach to these prosecutions. And that shift will have important consequences not only for refugees crossing the Channel in future, but also for those prosecuted in the past. Since the start of 2020, 65 people have received prison sentences following similar cases. Aneurin Brewer, the barrister who represented Fouad, has urged their representatives to consider appeals. It is now to be hoped that the prosecution of these notorious “small boats cases” will now stop, or at least become rare. However pressure from the Home Office means that immigration officers will doubtless attempt to find other ways to prosecute refugees entering the UK. Read the full story here. Photo: Getty (The Independent)<\/p>\n","protected":false},"author":21,"featured_media":33083,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27674"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=27674"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27674\/revisions"}],"predecessor-version":[{"id":27676,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27674\/revisions\/27676"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33083"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=27674"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=27674"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=27674"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}