{"id":27718,"date":"2021-06-20T17:12:31","date_gmt":"2021-06-20T17:12:31","guid":{"rendered":"https:\/\/care4calais.org\/?p=27718"},"modified":"2021-11-10T23:12:44","modified_gmt":"2021-11-10T23:12:44","slug":"refugee-week-2021-ammars-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/refugee-week-2021-ammars-story\/","title":{"rendered":"Refugee Week 2021: Ammar’s Story"},"content":{"rendered":"<p>I had a good life in Syria until I reached the age where militia take boys to fight for them. They take you and make you kill your own people; if you refuse, they beat you or kill you.<\/p>\n<p>My twin brother left soon after our birthday. I did not want to leave and stayed as long as I could. I did love it there. I lived in the middle of the city, but we’d always go outside to swim in the rivers, eat apples and apricots from the farms and sometimes we stay all night outside. It was very beautiful, as I said.<\/p>\n<p>But now the farms and houses have been destroyed, the towns are deserted, the destruction is total. All my friends are in Lebanon, Turkey and Germany, there is no town or community to go back to, even if I could.<\/p>\n<p>And in the end I had to go too, because I didn’t want to kill people. I left for Lebanon and then to Turkey, the gateway to Europe. And I’ve been in the UK since August 2016.<\/p>\n<p>I am in Hartlepool, near my brother. I was in London but if it’s hard being a refugee in normal times it was impossible during the pandemic. I was so alone, I had no family and no friends near me and I was suffering. So I moved up here to be near my twin and his family. I will go back soon, as my home is really London.<\/p>\n<p>I really like the lifestyle here. You are free to do stuff, to see the outdoors and to be yourself, and you are not judged or persecuted for wanting to do things. I love the outdoors and nature. I like to explore with my friends. There are so many opportunities to visit different places here, rivers, mountains, parks and the seaside. I went to Wales, it is so beautiful. Lake District? No I have not been there yet- but I will, it sounds amazing.<\/p>\n<p>I have learned English – it’s not perfect yet but I can understand most things. I know Care4Calais and I would like to be an interpreter for them. Many of my friends are Care4Calais volunteers, they are so humble, they just find out who you are and like you for that. You do not have to be anyone or have anything, they are just friends with you.<\/p>\n<p>I have been studying here online and in London, and it has been hard as I have had to do it in English. It has really hurt my brain! But it has been good as I have had to study from a different perspective from that taught in Syria. My degree is in International Studies, and it has always been my hope I can use it to help rebuild my country when the time comes. My dissertation is due next week!<\/p>\n<p>Right now I do a lot of volunteer work. I volunteered back in Calais too. When I finish my degree I will go back to volunteering with charities until I can get a job.<\/p>\n<p>I also fix phones. It’s very important in my country, because in Syria it is not easy to get a good smartphone. You struggle to get a phone so you have to look after it and if it breaks then you have to mend it, you can’t just go buy another or get it replaced. It’s what I did in Syria to make some money. I love technology and have coding skills too. I also love to play board games, if you’re ever bored…<\/p>\n<p>My next challenge is going to be passing my UK driving test. But looking ahead, one day I will go back to Syria and I will get a job that enables me to help rebuild my country. Because despite the destruction, it can be rebuilt, one day, when peace is permanent. To go back there to do that &#8211; that’s really what I’m studying for right now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I had a good life in Syria until I reached the age where militia take boys to fight for them. They take you and make you kill your own people; if you refuse, they beat you or kill you. My twin brother left soon after our birthday. I did not want to leave and stayed as long as I could. I did love it there. I lived in the middle of the city, but we’d always go outside to swim in the rivers, eat apples and apricots from the farms and sometimes we stay all night outside. It was very beautiful, as I said. But now the farms and houses have been destroyed, the towns are deserted, the destruction is total. All my friends are in Lebanon, Turkey and Germany, there is no town or community to go back to, even if I could. And in the end I had to go too, because I didn’t want to kill people. I left for Lebanon and then to Turkey, the gateway to Europe. And I’ve been in the UK since August 2016. I am in Hartlepool, near my brother. I was in London but if it’s hard being a refugee in normal times it was impossible during the pandemic. I was so alone, I had no family and no friends near me and I was suffering. So I moved up here to be near my twin and his family. I will go back soon, as my home is really London. I really like the lifestyle here. You are free to do stuff, to see the outdoors and to be yourself, and you are not judged or persecuted for wanting to do things. I love the outdoors and nature. I like to explore with my friends. There are so many opportunities to visit different places here, rivers, mountains, parks and the seaside. I went to Wales, it is so beautiful. Lake District? No I have not been there yet- but I will, it sounds amazing. I have learned English – it’s not perfect yet but I can understand most things. I know Care4Calais and I would like to be an interpreter for them. Many of my friends are Care4Calais volunteers, they are so humble, they just find out who you are and like you for that. You do not have to be anyone or have anything, they are just friends with you. I have been studying here online and in London, and it has been hard as I have had to do it in English. It has really hurt my brain! But it has been good as I have had to study from a different perspective from that taught in Syria. My degree is in International Studies, and it has always been my hope I can use it to help rebuild my country when the time comes. My dissertation is due next week! Right now I do a lot of volunteer work. I volunteered back in Calais too. When I finish my degree I will go back to volunteering with charities until I can get a job. I also fix phones. It’s very important in my country, because in Syria it is not easy to get a good smartphone. You struggle to get a phone so you have to look after it and if it breaks then you have to mend it, you can’t just go buy another or get it replaced. It’s what I did in Syria to make some money. I love technology and have coding skills too. I also love to play board games, if you’re ever bored… My next challenge is going to be passing my UK driving test. But looking ahead, one day I will go back to Syria and I will get a job that enables me to help rebuild my country. Because despite the destruction, it can be rebuilt, one day, when peace is permanent. To go back there to do that &#8211; that’s really what I’m studying for right now.<\/p>\n","protected":false},"author":21,"featured_media":33082,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27718"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=27718"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27718\/revisions"}],"predecessor-version":[{"id":27720,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/27718\/revisions\/27720"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33082"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=27718"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=27718"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=27718"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}