{"id":28104,"date":"2021-06-25T19:00:49","date_gmt":"2021-06-25T19:00:49","guid":{"rendered":"https:\/\/care4calais.org\/?p=28104"},"modified":"2021-11-10T23:00:37","modified_gmt":"2021-11-10T23:00:37","slug":"its-not-by-choice-to-live-like-this","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/its-not-by-choice-to-live-like-this\/","title":{"rendered":"“It’s not by choice, to live like this.&#8221;"},"content":{"rendered":"<p style=\"font-weight: 400;\">Hashem, in his early twenties from Iran, has been sleeping rough in Calais for three months.  Until recently his tent was in an abandoned warehouse here. He said it was good to have shelter there, surrounded by hundreds of other people, and felt safe. That was until the police came early one morning.<\/p>\n<p style=\"font-weight: 400;\">They destroyed and confiscated what belongings they could find. Hundreds of people were taken out of Calais on buses.<\/p>\n<p style=\"font-weight: 400;\">Others, like Hashem, were able to escape but were left with nothing<\/p>\n<p style=\"font-weight: 400;\">I met Hashem one hot afternoon last week. We sat on the dry grass, carefully staying out of the way of a nearby Afghan cricket match. We laughed and joked for a bit. But then we spoke about his journey to northern France, and how terrible it is here in Calais right now. I stopped paying attention to the cricket completely.<\/p>\n<p style=\"font-weight: 400;\">Hashem is Christian, which can be a difficult thing in Iran, and is fleeing political and religious persecution. He said he was made to study Islamic texts and could only go to church in secret with his family. In late 2018 it was too much for him. He left his family, including his little sister, behind.<\/p>\n<p style=\"font-weight: 400;\">He told me he couldn&#8217;t get an Iranian passport unless he completed military service. So he secretly escaped Iran. He said he can no longer go back.<\/p>\n<p style=\"font-weight: 400;\">After dangerous crossing attempts he made it to Greece, and now is in Calais. He hopes to get to the UK, seek safety, and live his life free from persecution. He hopes to continue studying in the UK as his schooling in Iran was cut short. But right now in Calais, he can’t believe what he found. And he still can’t believe what the police did that morning.<\/p>\n<p style=\"font-weight: 400;\">‘The police, it’s inhuman that they do this… so we always have to be on the move,” he said. “It’s not by choice to live like this – nobody would want this, it’s brutal. It doesn’t make any difference what they do… It changes nothing.’<\/p>\n<p style=\"font-weight: 400;\">Refugees like Hashem have made dangerous journeys through countries and across perilous seas. Nobody should be treated like this, not on our doorstep.<\/p>\n<p style=\"font-weight: 400;\">To support our work go to <a href=\"http:\/\/care4calais.org\/donate\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=http:\/\/care4calais.org\/donate&amp;source=gmail&amp;ust=1624739278290000&amp;usg=AFQjCNFzta6-nAA-6IaWKzpNzwnLRt2c3w\">care4calais.org\/donate<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hashem, in his early twenties from Iran, has been sleeping rough in Calais for three months.  Until recently his tent was in an abandoned warehouse here. He said it was good to have shelter there, surrounded by hundreds of other people, and felt safe. That was until the police came early one morning. They destroyed and confiscated what belongings they could find. Hundreds of people were taken out of Calais on buses. Others, like Hashem, were able to escape but were left with nothing I met Hashem one hot afternoon last week. We sat on the dry grass, carefully staying out of the way of a nearby Afghan cricket match. We laughed and joked for a bit. But then we spoke about his journey to northern France, and how terrible it is here in Calais right now. I stopped paying attention to the cricket completely. Hashem is Christian, which can be a difficult thing in Iran, and is fleeing political and religious persecution. He said he was made to study Islamic texts and could only go to church in secret with his family. In late 2018 it was too much for him. He left his family, including his little sister, behind. He told me he couldn&#8217;t get an Iranian passport unless he completed military service. So he secretly escaped Iran. He said he can no longer go back. After dangerous crossing attempts he made it to Greece, and now is in Calais. He hopes to get to the UK, seek safety, and live his life free from persecution. He hopes to continue studying in the UK as his schooling in Iran was cut short. But right now in Calais, he can’t believe what he found. And he still can’t believe what the police did that morning. ‘The police, it’s inhuman that they do this… so we always have to be on the move,” he said. “It’s not by choice to live like this – nobody would want this, it’s brutal. It doesn’t make any difference what they do… It changes nothing.’ Refugees like Hashem have made dangerous journeys through countries and across perilous seas. Nobody should be treated like this, not on our doorstep. To support our work go to care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":33074,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28104"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=28104"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28104\/revisions"}],"predecessor-version":[{"id":28107,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28104\/revisions\/28107"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33074"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=28104"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=28104"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=28104"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}