{"id":28422,"date":"2021-07-10T16:50:13","date_gmt":"2021-07-10T16:50:13","guid":{"rendered":"https:\/\/care4calais.org\/?p=28422"},"modified":"2023-02-08T18:13:11","modified_gmt":"2023-02-08T17:13:11","slug":"six-years-of-volunteering-my-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/six-years-of-volunteering-my-story\/","title":{"rendered":"Six years of volunteering: My Story"},"content":{"rendered":"<p>I’ve been volunteering for nearly six years now, but I very nearly did not make it past the first day. I had quite a traumatic initiation to the Jungle. I spent ten hours in the medical caravans treating a constant stream of injured and sick people, it was quite scary as I’d never seen, never mind done, anything like this before and the jungle was huge at that time. I’d just been left to get on with it and the thought of going back the next day was terrifying.<\/p>\n<p>I called my friend Roxanne to apologise for not being able to stay for the planned trip. She said not to go home just yet but spend the next day with the charity she was volunteering for. This happened to be Care4Calais who had just that very day secured their first warehouse! As soon as I got there I felt safe, I felt valued, needed and looked after. This is the essence of Care4Calais and why I am still here today. We spent the day unloading a never ending stream of cars and vans bringing in donations and then starting to plan out the how the warehouse would operate. I’ve never looked back.<br \/>\nLike many I was inspired to go to Calais after the media reports of Alun Kurdy’s body washing up on the beach that September. I had just thought it was a freak accident and they had been aboard a big official ship. I started to do a bit of research. I mean I knew of refugees but I thought they were someone else’s problem, in another country fleeing wars and that the government looked after them all. How wrong can you be? So I went to Calais to do what I could.<\/p>\n<p>I used to be embarrassed to tell people why I kept volunteering, because surely we’re not supposed to enjoy helping people in desperation. But that is why I do it, I enjoy helping people, I enjoy meeting all the refugees, I enjoy meeting the volunteers and the donors, I enjoy changing hearts and minds, I enjoy the connections we make, after all that’s what life is about- human connection. So now I am happy to tell you I do it because I enjoy it.<\/p>\n<p>Oh! and changing minds, that is something amazing that happens when you engage with unlikely people, and they start to help by offering donations and then getting to meet the refugees. Once they have spoken to a refugee they never think about them in the same way again.<\/p>\n<p>Now I look after some of the big hotels in Manchester as well as a lot of dispersal accommodation. I have a fantastic team and we work really well together, looking after each other, as from experience I know how important that is. I’ve built great relationships with the hotel staff too and we do some big distributions there but after the distribution, it’s time to relax and chat with the refugees.<\/p>\n<p>There is a ton of dispersal accommodation in Manchester and it covers a huge area. We all have regular jobs too so it can be a struggle and is time consuming but very necessary. People are often very alone and they do not know where anything is or how anything works in the UK. They are often scared and quite low, so it’s important we make the effort.<\/p>\n<p>Yeah of course we could use more volunteers! Please tell them to give me a shout! We’ll welcome them and look after them as well as have a bit of fun.<\/p>\n<p>Like I said, one of the most important things we do is make a connection, meet someone for a chat, a coffee, a football game or helping them get a doctor’s appointment – just small things but they can make the world of difference to a lonely and scared refugee.<\/p>\n<p>It’s the small wins.<\/p>\n<p>Wayne is a dedicated C4C volunteer in Manchester and as he says, they’d love to welcome more hands-on volunteers to their team, they have a lot of experience between them and can guide new comers really well.<\/p>\n<p>Take the first step, email annie@care4calais.org<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’ve been volunteering for nearly six years now, but I very nearly did not make it past the first day. I had quite a traumatic initiation to the Jungle. I spent ten hours in the medical caravans treating a constant stream of injured and sick people, it was quite scary as I’d never seen, never mind done, anything like this before and the jungle was huge at that time. I’d just been left to get on with it and the thought of going back the next day was terrifying. I called my friend Roxanne to apologise for not being able to stay for the planned trip. She said not to go home just yet but spend the next day with the charity she was volunteering for. This happened to be Care4Calais who had just that very day secured their first warehouse! As soon as I got there I felt safe, I felt valued, needed and looked after. This is the essence of Care4Calais and why I am still here today. We spent the day unloading a never ending stream of cars and vans bringing in donations and then starting to plan out the how the warehouse would operate. I’ve never looked back. Like many I was inspired to go to Calais after the media reports of Alun Kurdy’s body washing up on the beach that September. I had just thought it was a freak accident and they had been aboard a big official ship. I started to do a bit of research. I mean I knew of refugees but I thought they were someone else’s problem, in another country fleeing wars and that the government looked after them all. How wrong can you be? So I went to Calais to do what I could. I used to be embarrassed to tell people why I kept volunteering, because surely we’re not supposed to enjoy helping people in desperation. But that is why I do it, I enjoy helping people, I enjoy meeting all the refugees, I enjoy meeting the volunteers and the donors, I enjoy changing hearts and minds, I enjoy the connections we make, after all that’s what life is about- human connection. So now I am happy to tell you I do it because I enjoy it. Oh! and changing minds, that is something amazing that happens when you engage with unlikely people, and they start to help by offering donations and then getting to meet the refugees. Once they have spoken to a refugee they never think about them in the same way again. Now I look after some of the big hotels in Manchester as well as a lot of dispersal accommodation. I have a fantastic team and we work really well together, looking after each other, as from experience I know how important that is. I’ve built great relationships with the hotel staff too and we do some big distributions there but after the distribution, it’s time to relax and chat with the refugees. There is a ton of dispersal accommodation in Manchester and it covers a huge area. We all have regular jobs too so it can be a struggle and is time consuming but very necessary. People are often very alone and they do not know where anything is or how anything works in the UK. They are often scared and quite low, so it’s important we make the effort. Yeah of course we could use more volunteers! Please tell them to give me a shout! We’ll welcome them and look after them as well as have a bit of fun. Like I said, one of the most important things we do is make a connection, meet someone for a chat, a coffee, a football game or helping them get a doctor’s appointment – just small things but they can make the world of difference to a lonely and scared refugee. It’s the small wins. Wayne is a dedicated C4C volunteer in Manchester and as he says, they’d love to welcome more hands-on volunteers to their team, they have a lot of experience between them and can guide new comers really well. Take the first step, email annie@care4calais.org<\/p>\n","protected":false},"author":21,"featured_media":33065,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28422"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=28422"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28422\/revisions"}],"predecessor-version":[{"id":39711,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28422\/revisions\/39711"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33065"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=28422"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=28422"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=28422"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}