{"id":28899,"date":"2021-08-04T19:12:35","date_gmt":"2021-08-04T19:12:35","guid":{"rendered":"https:\/\/care4calais.org\/?p=28899"},"modified":"2023-02-08T17:10:47","modified_gmt":"2023-02-08T16:10:47","slug":"volunteer-stories-claire","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/volunteer-stories-claire\/","title":{"rendered":"Volunteer Stories: Claire"},"content":{"rendered":"<p>I love it when the refugees start dancing at the end of a distribution, they always invite the volunteers to join them. It’s almost like they are saying to the police, “you will not beat us, see our spirit and our courage, we will survive.” I haven’t been brave enough to join them yet, but I really hope I will soon.<\/p>\n<p>I’m Claire from the Netherlands and I’ve been volunteering with Care4Calais  for a while now.<\/p>\n<p>What really sets C4C apart from the other NGOs is the services. The organisation doesn’t just drop off items of clothing, food, toiletries, but stays on the site for three hours and delivers a hair station (so they can cut hair and trim beards), a sewing station, a bike station, a phone charging station, hot drinks, and games. It is during services that you get to talk to the guys in depth and really get to know them. It offers a way for the refugees to temporarily relax and play a simple game of jenga or teach volunteers some Arabic. This, I think, really sets C4C apart, and it has made my experience incredibly rewarding.<\/p>\n<p>I study sociology and social anthropology at university, and immigration is the area in which I was most interested in throughout university. The thought of people not being able to have a home, and all policy being directed to keeping these people away just shocked me. Coming from the Netherlands, I was so disappointed in my own countries immigration laws and when I started to look up more and more about the policies other countries, I couldn’t believe it. I had to see it with my own eyes, so that’s why I decided to come to Calais, and to write my dissertation on this topic.<\/p>\n<p>It’s made me realise I want a more concrete skillset to actually be able to change something about the situation of these refugees. I am now planning on doing a law conversion at the end of my degree to make sure I get a law degree as well. Hopefully, I can then continue in human rights law and international law.<\/p>\n<p>But it’s not all singing and games here, warehouse work can be very tiring but I really understand why it’s super necessary. The distributions need to be prepared, donations need to be sorted, and there is just no way of doing this job without that warehouse work. I love the balance of doing warehouse jobs in the morning and going to a site in the afternoon, it keeps the job varied. And, I can now say I know how to efficiently fold up a tent and a sleeping bag, I know how to use a pallet truck and I have definitely had my fitness sessions in with lifting boxes!<\/p>\n<p>The team here is AMAZING! I’ve gotten along with everyone on the team and we’ve become so close. I think the way Care4Calais works is super efficient and organised, which makes the job a lot better to handle! The team leaders are such lovely people as well. On your first day you get a super extensive briefing about how everything works, and you’re always encouraged to ask questions.<\/p>\n<p>But I stay because of the refugees these guys have just been the most positive, uplifting and kind people I have every had the pleasure to meet. They always make me laugh, and I have gotten on with every single one of them. It has been so eye-opening to hear their life stories, and to just provide them with a bit of fun and distraction.<\/p>\n<p>I think I may even have persuaded my mum to come and volunteer soon!<\/p>\n<p>&#8211; Claire, volunteer in Calais<\/p>\n<p>To support our work go to care4calais.org\/donate<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I love it when the refugees start dancing at the end of a distribution, they always invite the volunteers to join them. It’s almost like they are saying to the police, “you will not beat us, see our spirit and our courage, we will survive.” I haven’t been brave enough to join them yet, but I really hope I will soon. I’m Claire from the Netherlands and I’ve been volunteering with Care4Calais  for a while now. What really sets C4C apart from the other NGOs is the services. The organisation doesn’t just drop off items of clothing, food, toiletries, but stays on the site for three hours and delivers a hair station (so they can cut hair and trim beards), a sewing station, a bike station, a phone charging station, hot drinks, and games. It is during services that you get to talk to the guys in depth and really get to know them. It offers a way for the refugees to temporarily relax and play a simple game of jenga or teach volunteers some Arabic. This, I think, really sets C4C apart, and it has made my experience incredibly rewarding. I study sociology and social anthropology at university, and immigration is the area in which I was most interested in throughout university. The thought of people not being able to have a home, and all policy being directed to keeping these people away just shocked me. Coming from the Netherlands, I was so disappointed in my own countries immigration laws and when I started to look up more and more about the policies other countries, I couldn’t believe it. I had to see it with my own eyes, so that’s why I decided to come to Calais, and to write my dissertation on this topic. It’s made me realise I want a more concrete skillset to actually be able to change something about the situation of these refugees. I am now planning on doing a law conversion at the end of my degree to make sure I get a law degree as well. Hopefully, I can then continue in human rights law and international law. But it’s not all singing and games here, warehouse work can be very tiring but I really understand why it’s super necessary. The distributions need to be prepared, donations need to be sorted, and there is just no way of doing this job without that warehouse work. I love the balance of doing warehouse jobs in the morning and going to a site in the afternoon, it keeps the job varied. And, I can now say I know how to efficiently fold up a tent and a sleeping bag, I know how to use a pallet truck and I have definitely had my fitness sessions in with lifting boxes! The team here is AMAZING! I’ve gotten along with everyone on the team and we’ve become so close. I think the way Care4Calais works is super efficient and organised, which makes the job a lot better to handle! The team leaders are such lovely people as well. On your first day you get a super extensive briefing about how everything works, and you’re always encouraged to ask questions. But I stay because of the refugees these guys have just been the most positive, uplifting and kind people I have every had the pleasure to meet. They always make me laugh, and I have gotten on with every single one of them. It has been so eye-opening to hear their life stories, and to just provide them with a bit of fun and distraction. I think I may even have persuaded my mum to come and volunteer soon! &#8211; Claire, volunteer in Calais To support our work go to care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":33056,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28899"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=28899"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28899\/revisions"}],"predecessor-version":[{"id":28902,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28899\/revisions\/28902"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33056"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=28899"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=28899"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=28899"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}