{"id":28929,"date":"2021-08-06T17:08:15","date_gmt":"2021-08-06T17:08:15","guid":{"rendered":"https:\/\/care4calais.org\/?p=28929"},"modified":"2023-02-08T17:10:29","modified_gmt":"2023-02-08T16:10:29","slug":"volunteer-stories-calais-light","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/volunteer-stories-calais-light\/","title":{"rendered":"Volunteer stories: Calais Light"},"content":{"rendered":"<p>“I’ve been going to Calais for about five and a half years now, first on my own, but I felt I had to do more. I run my own business with some large and demanding clients, so I didn’t want a huge commitment. So I thought, let’s try to set up something that suits people with my kind of lifestyle. So That’s why it’s Calais Light, a light touch organisation with a big impact.<\/p>\n<p>Before Covid we had been to Calais 15 times, during the pandemic we’ve still been raising cash and have given Care4Calais around £8,500 in 2020 alone.<\/p>\n<p>So what do we do? Well, we organise weekend convoy trips to Calais for people who may not otherwise go, or those who feel it may all be a bit to daunting to organize and go alone. We do everything from ferry bookings and car sharing to hotel reservations, volunteer placement and even meals out at the infamous Family Pub. We do it all with the least fuss possible, we’re very low on agro and chat and high on action. I think the last trip out we took around 50 people, that’s a lot of manpower to put to work in the warehouses!<\/p>\n<p>Our volunteers have to have a certain mindset, they have to be adaptable and accept uncertainties in the work, last minute changes and sudden initiatives. They have to be open minded, self reliant and willing to work. We don’t take tourists! The formula works, we have so many repeat volunteers. The trips are transformative and reshape other areas of our volunteers lives to- invigorate them to do something more, whether it is for refugees or not, but just to do and be more.<\/p>\n<p>We chose Care4Calais as one of our main beneficiaries as they do something special, something really important, and hopefully after Covid we will do so again. They make sure that anyone who wants to, gets to meet the refugees, spend time with them play cricket or drink a cup of tea after distribution. No other charity does this with short term volunteers, but it’s this aspect that changes hearts and minds and makes people want to return.<\/p>\n<p>Care4Calais have always made us very welcome and organised our days effectively. They give our volunteers a chance to talk to staff and refugees in the evening and to ask any questions they may have over a glass of wine or cup of tea. So although I wish we didn’t have to go back, we can’t wait to get started again. We are like a family now.<\/p>\n<p>We have some fantastic supporters who go above and beyond to help those in Calais and now the U.K. Calais Light is one of them. Small but fierce is how Mary describes her organisation. It’s run totally through digital channels and aims to bring money and manpower to Calais.<\/p>\n<p>If you’d like to give some time to the refugees in Calais, but are a bit nervous going alone? Why not get in touch with Calais light and join one of their convoys?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“I’ve been going to Calais for about five and a half years now, first on my own, but I felt I had to do more. I run my own business with some large and demanding clients, so I didn’t want a huge commitment. So I thought, let’s try to set up something that suits people with my kind of lifestyle. So That’s why it’s Calais Light, a light touch organisation with a big impact. Before Covid we had been to Calais 15 times, during the pandemic we’ve still been raising cash and have given Care4Calais around £8,500 in 2020 alone. So what do we do? Well, we organise weekend convoy trips to Calais for people who may not otherwise go, or those who feel it may all be a bit to daunting to organize and go alone. We do everything from ferry bookings and car sharing to hotel reservations, volunteer placement and even meals out at the infamous Family Pub. We do it all with the least fuss possible, we’re very low on agro and chat and high on action. I think the last trip out we took around 50 people, that’s a lot of manpower to put to work in the warehouses! Our volunteers have to have a certain mindset, they have to be adaptable and accept uncertainties in the work, last minute changes and sudden initiatives. They have to be open minded, self reliant and willing to work. We don’t take tourists! The formula works, we have so many repeat volunteers. The trips are transformative and reshape other areas of our volunteers lives to- invigorate them to do something more, whether it is for refugees or not, but just to do and be more. We chose Care4Calais as one of our main beneficiaries as they do something special, something really important, and hopefully after Covid we will do so again. They make sure that anyone who wants to, gets to meet the refugees, spend time with them play cricket or drink a cup of tea after distribution. No other charity does this with short term volunteers, but it’s this aspect that changes hearts and minds and makes people want to return. Care4Calais have always made us very welcome and organised our days effectively. They give our volunteers a chance to talk to staff and refugees in the evening and to ask any questions they may have over a glass of wine or cup of tea. So although I wish we didn’t have to go back, we can’t wait to get started again. We are like a family now. We have some fantastic supporters who go above and beyond to help those in Calais and now the U.K. Calais Light is one of them. Small but fierce is how Mary describes her organisation. It’s run totally through digital channels and aims to bring money and manpower to Calais. If you’d like to give some time to the refugees in Calais, but are a bit nervous going alone? Why not get in touch with Calais light and join one of their convoys?<\/p>\n","protected":false},"author":21,"featured_media":33053,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28929"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=28929"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28929\/revisions"}],"predecessor-version":[{"id":28931,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/28929\/revisions\/28931"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33053"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=28929"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=28929"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=28929"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}