{"id":31433,"date":"2021-09-01T17:39:21","date_gmt":"2021-09-01T17:39:21","guid":{"rendered":"https:\/\/care4calais.org\/?p=31433"},"modified":"2022-10-20T16:27:40","modified_gmt":"2022-10-20T15:27:40","slug":"volunteer-stories-katie","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/volunteer-stories-katie\/","title":{"rendered":"Volunteer stories: Katie"},"content":{"rendered":"<p>I’m passionate about helping people. I always have been. I believe that every person has a right to safety, and I find helping people is rewarding in itself. Once I started to help with refugees in Calais, I got caught up in it and now I find that it’s impossible to give up.<\/p>\n<p>I’ve been to Calais many times in the last few years and when the pandemic started, I wanted to continue helping Care4Calais here in the UK. I’d no idea you could help here, but it was easy to sign up and get started. I’ve volunteering for about 18 months now<\/p>\n<p>I’m based in the Slough area, and our team looks after some hotels there, as well as dispersal accommodation. I’m the lead volunteer for one of the hotels, which is home to 120 refugees, 20 of them women. Every single one, men and women, is so polite, and really nice to talk to.<\/p>\n<p>I began my UK volunteering by meeting some of the refugees in the hotel car park to give them clothes and toiletries. Then I started getting messages from new arrivals and random callers from anywhere in the UK. For a long time I was the only volunteer helping at the hotel, everyone got to know my name – it was even written on a bit of paper taped to one of the walls!<\/p>\n<p>There’s a lot of camaraderie in the hotel, and a definite unity between the religions. When I got Covid the refugees were really worried about me, and I got lots of text messages wishing me well and telling me they missed me. Some of these encounters have grown into real friendships, and I still take road trips out to see people who have been moved from the hotel to dispersal accommodation.<\/p>\n<p>I do get a lot of donations, and sometimes among them we get some items that are, shall we say, a bit fashion-y and not so practical. We’ve had Hawaiian shirts, long leather jackets, flared jeans, cool new suits, shirts in crazy colours and the most flamboyant jackets you can imagine. We have fun with them at our “Saturday Styling Shop”.<\/p>\n<p>Here refugees can try on fancy outfits, do a bit of fun modelling, walk down the catwalk and have their photo taken. If they like the outfit they can keep it. It’s a good bit of fun.<\/p>\n<p>I post a lot of the photos on my Instagram page – it helps me get more donations as people really like to see where their old beloved clothes go, and they love to see them on another person.<\/p>\n<p>Another great thing is the football games. So many of the refugees are young men, and they just love football. I source and give out as many football boots and shirts as I can, and I love to see their faces light up when they find the shirt and boots fit.<\/p>\n<p>I was talking to this guy the other day about arranging football tournaments and getting some kits and a place to play. He owns a clothing brand, and he ended up giving us the T-shirts, but then he went away and came back with a big banner! So now we are having a five a side tournament. Sadly we have to pay for the pitch, so it’ll be back to more fundraising. But it’s worth it. Waiting for asylum is an incredibly anxious time for refugees, and anything that takes their minds off it for an hour or so is worth its weight in gold.<\/p>\n<p>Of course it can be stressful at times. I can never fill all the requests I get, and I could easily get overwhelmed trying to juggle everything.<\/p>\n<p>Luckily the volunteer team is growing, and we’re now able to set up a women’s group for the ladies in the hotel, who have been a little neglected. They’ve been very shy, but with the new volunteers we can build their confidence, and show them they are wanted here, and that the UK is a good place to be with good people in it.<\/p>\n<p>They are all humans – beautiful humans – and they deserve to have the same as us, who have been so lucky in life. I just wish everyone could see them the way I do.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’m passionate about helping people. I always have been. I believe that every person has a right to safety, and I find helping people is rewarding in itself. Once I started to help with refugees in Calais, I got caught up in it and now I find that it’s impossible to give up. I’ve been to Calais many times in the last few years and when the pandemic started, I wanted to continue helping Care4Calais here in the UK. I’d no idea you could help here, but it was easy to sign up and get started. I’ve volunteering for about 18 months now I’m based in the Slough area, and our team looks after some hotels there, as well as dispersal accommodation. I’m the lead volunteer for one of the hotels, which is home to 120 refugees, 20 of them women. Every single one, men and women, is so polite, and really nice to talk to. I began my UK volunteering by meeting some of the refugees in the hotel car park to give them clothes and toiletries. Then I started getting messages from new arrivals and random callers from anywhere in the UK. For a long time I was the only volunteer helping at the hotel, everyone got to know my name – it was even written on a bit of paper taped to one of the walls! There’s a lot of camaraderie in the hotel, and a definite unity between the religions. When I got Covid the refugees were really worried about me, and I got lots of text messages wishing me well and telling me they missed me. Some of these encounters have grown into real friendships, and I still take road trips out to see people who have been moved from the hotel to dispersal accommodation. I do get a lot of donations, and sometimes among them we get some items that are, shall we say, a bit fashion-y and not so practical. We’ve had Hawaiian shirts, long leather jackets, flared jeans, cool new suits, shirts in crazy colours and the most flamboyant jackets you can imagine. We have fun with them at our “Saturday Styling Shop”. Here refugees can try on fancy outfits, do a bit of fun modelling, walk down the catwalk and have their photo taken. If they like the outfit they can keep it. It’s a good bit of fun. I post a lot of the photos on my Instagram page – it helps me get more donations as people really like to see where their old beloved clothes go, and they love to see them on another person. Another great thing is the football games. So many of the refugees are young men, and they just love football. I source and give out as many football boots and shirts as I can, and I love to see their faces light up when they find the shirt and boots fit. I was talking to this guy the other day about arranging football tournaments and getting some kits and a place to play. He owns a clothing brand, and he ended up giving us the T-shirts, but then he went away and came back with a big banner! So now we are having a five a side tournament. Sadly we have to pay for the pitch, so it’ll be back to more fundraising. But it’s worth it. Waiting for asylum is an incredibly anxious time for refugees, and anything that takes their minds off it for an hour or so is worth its weight in gold. Of course it can be stressful at times. I can never fill all the requests I get, and I could easily get overwhelmed trying to juggle everything. Luckily the volunteer team is growing, and we’re now able to set up a women’s group for the ladies in the hotel, who have been a little neglected. They’ve been very shy, but with the new volunteers we can build their confidence, and show them they are wanted here, and that the UK is a good place to be with good people in it. They are all humans – beautiful humans – and they deserve to have the same as us, who have been so lucky in life. I just wish everyone could see them the way I do.<\/p>\n","protected":false},"author":21,"featured_media":33043,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[236],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31433"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=31433"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31433\/revisions"}],"predecessor-version":[{"id":31439,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31433\/revisions\/31439"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33043"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=31433"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=31433"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=31433"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}