{"id":31870,"date":"2021-09-07T17:39:52","date_gmt":"2021-09-07T17:39:52","guid":{"rendered":"https:\/\/care4calais.org\/?p=31870"},"modified":"2021-11-10T15:10:57","modified_gmt":"2021-11-10T15:10:57","slug":"khalids-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/khalids-story\/","title":{"rendered":"Khalid&#8217;s story"},"content":{"rendered":"<p>I buried my heart in the sands of Sudan when I left. We all do; the war has touched everybody, and no family is whole. My heart will not be whole again, but it will mend in time, when I can bring my children to be with me in England.<\/p>\n<p>&nbsp;<\/p>\n<p>This is the reality of being a refugee.<\/p>\n<p>&nbsp;<\/p>\n<p>I’m from Darfur, and it was a long journey from there to Calais. I was working as a dental technician, but I left home because I was from the wrong tribe, and born in the wrong place. In Khartoum, where I was living, that is enough to put your life in danger.<\/p>\n<p>&nbsp;<\/p>\n<p>It took me three years to reach Calais, and from there I wanted to go to England.<\/p>\n<p>&nbsp;<\/p>\n<p>With a friend, I decided to buy a small boat from the supermarket, the sort that you might use in a swimming pool. It was all we could afford, and anyway, we told ourselves, if anything happens, we can swim.<\/p>\n<p>&nbsp;<\/p>\n<p>When I look back, I have to laugh at this. I don’t know what I was thinking! My mind just wasn’t clear. All I could think of was crossing that narrow strip of water.<\/p>\n<p>&nbsp;<\/p>\n<p>After six hours afloat on the Channel, our boat sank. We didn’t have life jackets, but we continued swimming, and spent another seven hours in the cold sea. I don’t know how we didn’t drown. By the time the French patrols rescued us, I was nearly dead.<\/p>\n<p>&nbsp;<\/p>\n<p>I learned that when you’re that close to death, all you can think of is your family. I kept thinking about how I was going to die in the sea, which meant I wouldn’t be able to say goodbye to them.<\/p>\n<p>&nbsp;<\/p>\n<p>All I wanted was to hear the voice of my children one more time.<\/p>\n<p>&nbsp;<\/p>\n<p>The patrol took me to hospital, where I spent two days before being released. When I left, I had nothing. My clothes, shoes and phone had all been lost in the sea.<\/p>\n<p>&nbsp;<\/p>\n<p>So, when I was walking back to the camp in a T-shirt and flip flops, with no phone and no money, I was not feeling great. In fact, I was desperate.<\/p>\n<p>&nbsp;<\/p>\n<p>As I arrived, I saw that Care4Calais volunteers were at the site. I had met some of them before my boat trip. I saw a woman surrounded by hundreds of people asking<\/p>\n<p>questions and needing attention, and although I didn’t know who she was, and I didn’t think she would listen to me, I decided to approach her.<\/p>\n<p>&nbsp;<\/p>\n<p>I asked if she could help me get a phone and a sim card. She said she couldn’t help me that day, but I will always remember the way she looked at me, it was with such kindness. You know compassion from the eyes, and you feel it in your heart. Her kindness helped me to keep going for another day.<\/p>\n<p>&nbsp;<\/p>\n<p>A few days later she met me again, this time with some clothes and size 13 shoes, they cannot have been easy to find! I didn’t think she’d listen let alone remember what I wanted and then actually bring it to me when hundreds were wanting help. But she did.<\/p>\n<p>&nbsp;<\/p>\n<p>As I spoke English, I started to help Care4Calais when they came to the hospital site.<\/p>\n<p>&nbsp;<\/p>\n<p>A few days later I was out in a storm, it was raining so hard, harder than the monsoon rains in Sudan. Everyone was soaked.<\/p>\n<p>&nbsp;<\/p>\n<p>In the distance I saw someone limping badly. I thought it was a refugee that the police had hurt. When I got closer I found it was the woman I had met.<\/p>\n<p>&nbsp;<\/p>\n<p>“What are you  doing out in this?” I asked.<\/p>\n<p>&nbsp;<\/p>\n<p>She said she had to get some tents and supplies to a family. I pointed out that she could barely walk; she told me she had hurt her knee somehow and it was really bad. I am a strong guy, but I would not have been out in this weather if I had that much pain. Her commitment was incredible. Shaking my head, I helped her carry the tents.<\/p>\n<p>&nbsp;<\/p>\n<p>I got to know her better after that. She is the kindest person ever, but even though she is quite small she can be very fierce and stop the French police.<\/p>\n<p>&nbsp;<\/p>\n<p>Two weeks after that storm, I made it to the UK. This time there were 19 of us, and we got a better boat. The engine still stopped working, though.We spent 19 hours drifting on the water, wondering what would happen.<\/p>\n<p>&nbsp;<\/p>\n<p>I’m in Leicester now. It’s OK, but I’d really like to be in a more rural place, surrounded by nature, or near a river or the sea. Until I find that dream place, I’m helping Care4Calais with interpreting. I mainly work with the access team, who help asylum seekers get access to the services they need.<\/p>\n<p>&nbsp;<\/p>\n<p>The team is amazing, and works so hard; I have seen that there is nearly as much work for them here as there is in Calais.<\/p>\n<p>&nbsp;<\/p>\n<p>In Calais and England now, C4C is so important for people’s mental health. If you haven’t experienced it, it’s impossible to know what it’s like to be a refugee. Everyone is desperate and feeling bad. It’s really hard. But playing card games, football, or just having a cup of tea and a chat, can stop you thinking for a small time. It saves your mental health, or what remains of it, so that you can go another day.<\/p>\n<p>&nbsp;<\/p>\n<p>I miss Darfur of course. I miss the smell of new rain on the soil, I miss the street I used to walk, I miss my morning cup of tea and I miss speaking to my younger sister. I had a good life there, a big car and a house and a family. I even used to work with Eritrean refugees; I never thought it could happen to me. But believe me, it can happen to anyone, and when you are escaping death none of your wealth means anything.<\/p>\n<p>&nbsp;<\/p>\n<p>Last month I finally got my asylum here. Now I can move on, but first I must get my children back. They travelled with me from Sudan, but when I saw the channel I was scared and I did not want to risk them in a boat. At the moment they are in the Netherlands. I hope they can come here to the UK, although right now I do not know how we will do it.<\/p>\n<p>&nbsp;<\/p>\n<p>I’d like to work as a nurse or a care assistant, because I want to help people. I also want to go back to France to wear a white tabard and help Care4Calais and wear a white tabard. If anyone can give me a lift…<\/p>\n<p>&nbsp;<\/p>\n<p>The woman I met, by the way, was Clare, the founder of Care4Calais. I wonder how many other founders of charities can be found walking through storms for the people they help?<\/p>\n<p>&nbsp;<\/p>\n<p>I want to tell you how much love all we refugees have for her and Care4Calais. When I close my eyes, I see Care4Calais volunteers making tea, or playing football or getting help.<\/p>\n<p>&nbsp;<\/p>\n<p>I see them helping me and getting me some size 13 shoes, shoes that fit me, the first I’ve worn in a very long time.<\/p>\n<p>.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I buried my heart in the sands of Sudan when I left. We all do; the war has touched everybody, and no family is whole. My heart will not be whole again, but it will mend in time, when I can bring my children to be with me in England. &nbsp; This is the reality of being a refugee. &nbsp; I’m from Darfur, and it was a long journey from there to Calais. I was working as a dental technician, but I left home because I was from the wrong tribe, and born in the wrong place. In Khartoum, where I was living, that is enough to put your life in danger. &nbsp; It took me three years to reach Calais, and from there I wanted to go to England. &nbsp; With a friend, I decided to buy a small boat from the supermarket, the sort that you might use in a swimming pool. It was all we could afford, and anyway, we told ourselves, if anything happens, we can swim. &nbsp; When I look back, I have to laugh at this. I don’t know what I was thinking! My mind just wasn’t clear. All I could think of was crossing that narrow strip of water. &nbsp; After six hours afloat on the Channel, our boat sank. We didn’t have life jackets, but we continued swimming, and spent another seven hours in the cold sea. I don’t know how we didn’t drown. By the time the French patrols rescued us, I was nearly dead. &nbsp; I learned that when you’re that close to death, all you can think of is your family. I kept thinking about how I was going to die in the sea, which meant I wouldn’t be able to say goodbye to them. &nbsp; All I wanted was to hear the voice of my children one more time. &nbsp; The patrol took me to hospital, where I spent two days before being released. When I left, I had nothing. My clothes, shoes and phone had all been lost in the sea. &nbsp; So, when I was walking back to the camp in a T-shirt and flip flops, with no phone and no money, I was not feeling great. In fact, I was desperate. &nbsp; As I arrived, I saw that Care4Calais volunteers were at the site. I had met some of them before my boat trip. I saw a woman surrounded by hundreds of people asking questions and needing attention, and although I didn’t know who she was, and I didn’t think she would listen to me, I decided to approach her. &nbsp; I asked if she could help me get a phone and a sim card. She said she couldn’t help me that day, but I will always remember the way she looked at me, it was with such kindness. You know compassion from the eyes, and you feel it in your heart. Her kindness helped me to keep going for another day. &nbsp; A few days later she met me again, this time with some clothes and size 13 shoes, they cannot have been easy to find! I didn’t think she’d listen let alone remember what I wanted and then actually bring it to me when hundreds were wanting help. But she did. &nbsp; As I spoke English, I started to help Care4Calais when they came to the hospital site. &nbsp; A few days later I was out in a storm, it was raining so hard, harder than the monsoon rains in Sudan. Everyone was soaked. &nbsp; In the distance I saw someone limping badly. I thought it was a refugee that the police had hurt. When I got closer I found it was the woman I had met. &nbsp; “What are you  doing out in this?” I asked. &nbsp; She said she had to get some tents and supplies to a family. I pointed out that she could barely walk; she told me she had hurt her knee somehow and it was really bad. I am a strong guy, but I would not have been out in this weather if I had that much pain. Her commitment was incredible. Shaking my head, I helped her carry the tents. &nbsp; I got to know her better after that. She is the kindest person ever, but even though she is quite small she can be very fierce and stop the French police. &nbsp; Two weeks after that storm, I made it to the UK. This time there were 19 of us, and we got a better boat. The engine still stopped working, though.We spent 19 hours drifting on the water, wondering what would happen. &nbsp; I’m in Leicester now. It’s OK, but I’d really like to be in a more rural place, surrounded by nature, or near a river or the sea. Until I find that dream place, I’m helping Care4Calais with interpreting. I mainly work with the access team, who help asylum seekers get access to the services they need. &nbsp; The team is amazing, and works so hard; I have seen that there is nearly as much work for them here as there is in Calais. &nbsp; In Calais and England now, C4C is so important for people’s mental health. If you haven’t experienced it, it’s impossible to know what it’s like to be a refugee. Everyone is desperate and feeling bad. It’s really hard. But playing card games, football, or just having a cup of tea and a chat, can stop you thinking for a small time. It saves your mental health, or what remains of it, so that you can go another day. &nbsp; I miss Darfur of course. I miss the smell of new rain on the soil, I miss the street I used to walk, I miss my morning cup of tea and I miss speaking to my younger sister. I had a good life there, a big car and a house and a family. I even used to [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":33038,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31870"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=31870"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31870\/revisions"}],"predecessor-version":[{"id":31872,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31870\/revisions\/31872"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33038"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=31870"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=31870"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=31870"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}