{"id":31944,"date":"2021-09-08T22:50:16","date_gmt":"2021-09-08T22:50:16","guid":{"rendered":"https:\/\/care4calais.org\/?p=31944"},"modified":"2021-11-10T14:46:56","modified_gmt":"2021-11-10T14:46:56","slug":"volunteer-stories-sarah","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/volunteer-stories-sarah\/","title":{"rendered":"Volunteer stories: Sarah"},"content":{"rendered":"<p>My name is Sarah. I live in Germany and I&#8217;ve just returned from three weeks volunteering with Care4Calais.<\/p>\n<p>&nbsp;<\/p>\n<p>When I went there, I was expecting the refugees I met to be people in need. Instead I met the bravest, strongest and most impressive people you can ever imagine.<\/p>\n<p>&nbsp;<\/p>\n<p>My reasons for volunteering in Calais this summer were many, but they come down to one simple fact: it is nothing but a coincidence where, and under which circumstances, someone is born. And since the European Union is failing completely in regard to the interaction with refugees, I felt it was my duty to stand at the refugees&#8217; side and show solidarity.<\/p>\n<p>&nbsp;<\/p>\n<p>But I found there is a world of difference between knowing about the refugees&#8217; situation here in Calais, and then seeing it with your own eyes, and listening to the stories the refugees tell you about their journey.<\/p>\n<p>&nbsp;<\/p>\n<p>Once you&#8217;ve got to know some of the people living there, it&#8217;s really hard to go back to your normal life. That&#8217;s why I changed my plans in order to extend my stay in Calais for a few more days. To be honest, I wish I could have stayed forever!<\/p>\n<p>&nbsp;<\/p>\n<p>I’m so grateful for everything I&#8217;ve learnt in Calais – no book or documentary could ever teach you what I have learnt. I am also very thankful for all the great, lovely and inspiring people I&#8217;ve got to know – the refugees as well as the other volunteers.<\/p>\n<p>&nbsp;<\/p>\n<p>So many strong people who risk their life on dangerous routes due to the lack of safe passages to achieve what should be a given right for everybody.<\/p>\n<p>&nbsp;<\/p>\n<p>So many wholeheartedly committed people who are not willing to accept the injustices of the world.<\/p>\n<p>&nbsp;<\/p>\n<p>It’s the people I&#8217;ve met while volunteering with Care4Calais who made this experience unforgettable; and they’re definitely the main reason I will be returning as soon as possible.<\/p>\n<p>&nbsp;<\/p>\n<p>Sarah, Care4Calais volunteer, Calais<\/p>\n<p>&nbsp;<\/p>\n<p>We urgently need more volunteers like Sarah to help refugees and asylum seekers. Please get in touch with us <a href=\"https:\/\/care4calais.org\/get-involved\/\">here<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>My name is Sarah. I live in Germany and I&#8217;ve just returned from three weeks volunteering with Care4Calais. &nbsp; When I went there, I was expecting the refugees I met to be people in need. Instead I met the bravest, strongest and most impressive people you can ever imagine. &nbsp; My reasons for volunteering in Calais this summer were many, but they come down to one simple fact: it is nothing but a coincidence where, and under which circumstances, someone is born. And since the European Union is failing completely in regard to the interaction with refugees, I felt it was my duty to stand at the refugees&#8217; side and show solidarity. &nbsp; But I found there is a world of difference between knowing about the refugees&#8217; situation here in Calais, and then seeing it with your own eyes, and listening to the stories the refugees tell you about their journey. &nbsp; Once you&#8217;ve got to know some of the people living there, it&#8217;s really hard to go back to your normal life. That&#8217;s why I changed my plans in order to extend my stay in Calais for a few more days. To be honest, I wish I could have stayed forever! &nbsp; I’m so grateful for everything I&#8217;ve learnt in Calais – no book or documentary could ever teach you what I have learnt. I am also very thankful for all the great, lovely and inspiring people I&#8217;ve got to know – the refugees as well as the other volunteers. &nbsp; So many strong people who risk their life on dangerous routes due to the lack of safe passages to achieve what should be a given right for everybody. &nbsp; So many wholeheartedly committed people who are not willing to accept the injustices of the world. &nbsp; It’s the people I&#8217;ve met while volunteering with Care4Calais who made this experience unforgettable; and they’re definitely the main reason I will be returning as soon as possible. &nbsp; Sarah, Care4Calais volunteer, Calais &nbsp; We urgently need more volunteers like Sarah to help refugees and asylum seekers. Please get in touch with us here<\/p>\n","protected":false},"author":21,"featured_media":33037,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31944"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=31944"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31944\/revisions"}],"predecessor-version":[{"id":31948,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31944\/revisions\/31948"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33037"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=31944"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=31944"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=31944"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}