{"id":31956,"date":"2021-09-09T08:55:21","date_gmt":"2021-09-09T08:55:21","guid":{"rendered":"https:\/\/care4calais.org\/?p=31956"},"modified":"2021-11-10T14:45:21","modified_gmt":"2021-11-10T14:45:21","slug":"the-real-reason-for-refugee-pushbacks-at-sea","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-real-reason-for-refugee-pushbacks-at-sea\/","title":{"rendered":"The real reason for refugee pushbacks at sea"},"content":{"rendered":"<p>Last night Priti Patel announced perhaps the most inhuman act of all this Government’s many inhuman acts against innocent refugees.<\/p>\n<p>Border Force, she said, will in future be using ‘pushbacks’ against refugees at sea in the English Channel. That means they will have the right to use their ships to force people in small boats and dinghies to turn back towards France.<\/p>\n<p>This morning, a Conservative MP even suggested the Royal Navy might be deployed.<\/p>\n<p>These small boats are overloaded with men, women and children, and not infrequently in danger of sinking. Simply rescuing them can be risky; to use a large, powerful ship to force them backwards is catastrophically dangerous. In the Mediterranean sea, people have drowned as a result.<\/p>\n<p>Additionally there is a risk that, driven by utter desperation, one of these people might in be induced to jump in the sea.<\/p>\n<p>That is one of the reasons that pushbacks are not allowed by international maritime law. To make it OK for the UK to carry them out, Patel has had to tell Government officials to rewrite the way she “interprets” that law.<\/p>\n<p>To hear that our government is planning to tell British Border Force officers to use tactics deemed illegal in many other countries would be deeply shocking and upsetting at any time.<\/p>\n<p>To hear it less than a month after the British people showed such extraordinary understanding and compassion towards Afghan refugees is staggering.<\/p>\n<p>But simply expressing shock won’t save anyone. We should ask what’s really driving such callous decisions – and what should be done instead.<\/p>\n<p>What these plans reveal is this government’s desperation over the situation in the Channel.<\/p>\n<p>It is by now abundantly clear that their strategies – employed consistently for ten years – have not worked. They are not working now, and they never will. People are crossing, and there is no way to control the crossings when they’re driven by such evident desperation.<\/p>\n<p>The safe and sensible alternative is to provide a safe way that ordinary people, who are guilty of nothing other than being born in a conflict zone or dictatorship, can claim asylum in the UK without risking their lives.<\/p>\n<p>However, whatever their reasons, government ministers choose instead to talk up their aggression towards these people.<\/p>\n<p>That means they need to distract voters from their strategies’ failure.<\/p>\n<p>To do this, they have first created a misinformation campaign about refugees being required to stay in the first safe country.<\/p>\n<p>This is not only technically inaccurate, it is a deliberate attempt to fool us into thinking there is a good reason why Britain has no responsibility to take any refugees at all.<\/p>\n<p>However, it has been enough to lure a significant proportion of voters into believing it. And believing it, they then consider it acceptable to repel these invaders by any means necessary.<\/p>\n<p>The question that should be asked is why, when we already take far, far fewer refugees than our European neighbours such as Germany, Italy, Spain and many others, our government is so determined that we get this small share down to none.<\/p>\n<p>The response to Afghan refugees in the last few weeks has shown us, in an overwhelming fashion, that when the British public see the reality of the horrors that force refugees to leave their homes, the outpouring of compassion and care is genuine and real.<\/p>\n<p>So what should be done? It is simple. That compassion and care should be reflected in a safe, modern system that allows refugees to claim asylum in the UK without endangering themselves.<\/p>\n<p>This would provide control over the process, protect genuine refugees, put people smugglers out of business overnight. It would also maintain the humanity of our country.<\/p>\n<p>The pushback strategy is inhuman and wrong but, perhaps worst of all, it is cynical distraction that uses people’s lives as a cheap political weapon.<\/p>\n<p>It is time our government admitted that their policies are not working, and tried another way.<\/p>\n<p>One that does not require them to order our Border Force and the Royal Navy personnel to put innocent lives at risk.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last night Priti Patel announced perhaps the most inhuman act of all this Government’s many inhuman acts against innocent refugees. Border Force, she said, will in future be using ‘pushbacks’ against refugees at sea in the English Channel. That means they will have the right to use their ships to force people in small boats and dinghies to turn back towards France. This morning, a Conservative MP even suggested the Royal Navy might be deployed. These small boats are overloaded with men, women and children, and not infrequently in danger of sinking. Simply rescuing them can be risky; to use a large, powerful ship to force them backwards is catastrophically dangerous. In the Mediterranean sea, people have drowned as a result. Additionally there is a risk that, driven by utter desperation, one of these people might in be induced to jump in the sea. That is one of the reasons that pushbacks are not allowed by international maritime law. To make it OK for the UK to carry them out, Patel has had to tell Government officials to rewrite the way she “interprets” that law. To hear that our government is planning to tell British Border Force officers to use tactics deemed illegal in many other countries would be deeply shocking and upsetting at any time. To hear it less than a month after the British people showed such extraordinary understanding and compassion towards Afghan refugees is staggering. But simply expressing shock won’t save anyone. We should ask what’s really driving such callous decisions – and what should be done instead. What these plans reveal is this government’s desperation over the situation in the Channel. It is by now abundantly clear that their strategies – employed consistently for ten years – have not worked. They are not working now, and they never will. People are crossing, and there is no way to control the crossings when they’re driven by such evident desperation. The safe and sensible alternative is to provide a safe way that ordinary people, who are guilty of nothing other than being born in a conflict zone or dictatorship, can claim asylum in the UK without risking their lives. However, whatever their reasons, government ministers choose instead to talk up their aggression towards these people. That means they need to distract voters from their strategies’ failure. To do this, they have first created a misinformation campaign about refugees being required to stay in the first safe country. This is not only technically inaccurate, it is a deliberate attempt to fool us into thinking there is a good reason why Britain has no responsibility to take any refugees at all. However, it has been enough to lure a significant proportion of voters into believing it. And believing it, they then consider it acceptable to repel these invaders by any means necessary. The question that should be asked is why, when we already take far, far fewer refugees than our European neighbours such as Germany, Italy, Spain and many others, our government is so determined that we get this small share down to none. The response to Afghan refugees in the last few weeks has shown us, in an overwhelming fashion, that when the British public see the reality of the horrors that force refugees to leave their homes, the outpouring of compassion and care is genuine and real. So what should be done? It is simple. That compassion and care should be reflected in a safe, modern system that allows refugees to claim asylum in the UK without endangering themselves. This would provide control over the process, protect genuine refugees, put people smugglers out of business overnight. It would also maintain the humanity of our country. The pushback strategy is inhuman and wrong but, perhaps worst of all, it is cynical distraction that uses people’s lives as a cheap political weapon. It is time our government admitted that their policies are not working, and tried another way. One that does not require them to order our Border Force and the Royal Navy personnel to put innocent lives at risk.<\/p>\n","protected":false},"author":21,"featured_media":33036,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31956"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=31956"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31956\/revisions"}],"predecessor-version":[{"id":31958,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/31956\/revisions\/31958"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33036"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=31956"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=31956"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=31956"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}