{"id":32056,"date":"2021-09-11T18:36:19","date_gmt":"2021-09-11T18:36:19","guid":{"rendered":"https:\/\/care4calais.org\/?p=32056"},"modified":"2021-12-07T11:45:43","modified_gmt":"2021-12-07T11:45:43","slug":"volunteer-stories-cici","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/volunteer-stories-cici\/","title":{"rendered":"Volunteer stories: Cici"},"content":{"rendered":"<div class=\"\" dir=\"auto\">\n<div id=\"jsc_c_jm\" class=\"ecm0bbzt hv4rvrfc ihqw7lf3 dati1w0a\" data-ad-comet-preview=\"message\" data-ad-preview=\"message\">\n<div class=\"j83agx80 cbu4d94t ew0dbk1b irj2b8pg\">\n<div class=\"qzhwtbm6 knvmm38d\">\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">My name is Cici and I am 12 years old. My mum has been going to Calais for years now to help the refugees. I always helped her pack the donations and liked sorting things out.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Then she got a job helping refugees in England but I didn’t really know what she did to help here. To me refugees were people in France.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">One night about three weeks ago I saw my mum on the telly talking about refugees and how they need help here. I’d also been watching all the stories about Afghanistan on the news and I suddenly made the link between what happens in the world to make people refugees and how my mum helps then here.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I was shocked to see people climbing onto the aeroplane wing and trying to hang on. I saw so many kids in the lines waiting to get in planes, holding their mums hands. That could have been me.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">So when my mum had to go to Manchester to work at the new Care4Calais warehouse I asked if I could go too. I really wanted to do something to help all those people. My school let me have some days off as they said this was important real life learning so off we went.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Watching the news made me realise how lucky I am to live here when so many children now have nothing. It made me think about how I would feel if this happened to me.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">At first I was very shy to start work but soon got stuck in. It’s very easy once you start.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">The warehouse is huge and we spend all day sorting clothes and packing boxes. I’d seen many children in the news’s so I asked if I could help sort the children’s clothes into boxes. We put everything from socks to hats in a box for a child age say 1-2 and then 3-4 and so on.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I love it when we fill a box and tape it closed and then stack it in it he right pile. That means it is ready to go out to help some children who have arrived in Manchester. I like how organised it is and I like to keep it that way!<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">There’s been some amazing donations like the traditional clothing ladies have been bringing it is soooo beautiful, all sparkles and colours.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">There’s been some pretty bad stuff too like stained white T-shirt’s and vests. Why would you send that to people we want to welcome and make feel special?<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">But they need lots more help here. It’s really nice, everyone is friendly and helpful. I like how everyone just helps it doesn’t really matter who you are.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I have asked my mum if we can not have gifts this Christmas and instead send the money to C4C for shoes and coats for the children.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">You can help too <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl py34i1dx gpro0wi8\" tabindex=\"0\" role=\"link\" href=\"http:\/\/Care4Calais.org\/donate?fbclid=IwAR1MkdnUjOqqEdHbWZqQ3pgRJNe0zM0TPgZv5REYuR7tofS94-p_MoFctG4\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org\/donate<\/a><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>My name is Cici and I am 12 years old. My mum has been going to Calais for years now to help the refugees. I always helped her pack the donations and liked sorting things out. Then she got a job helping refugees in England but I didn’t really know what she did to help here. To me refugees were people in France. One night about three weeks ago I saw my mum on the telly talking about refugees and how they need help here. I’d also been watching all the stories about Afghanistan on the news and I suddenly made the link between what happens in the world to make people refugees and how my mum helps then here. I was shocked to see people climbing onto the aeroplane wing and trying to hang on. I saw so many kids in the lines waiting to get in planes, holding their mums hands. That could have been me. So when my mum had to go to Manchester to work at the new Care4Calais warehouse I asked if I could go too. I really wanted to do something to help all those people. My school let me have some days off as they said this was important real life learning so off we went. Watching the news made me realise how lucky I am to live here when so many children now have nothing. It made me think about how I would feel if this happened to me. At first I was very shy to start work but soon got stuck in. It’s very easy once you start. The warehouse is huge and we spend all day sorting clothes and packing boxes. I’d seen many children in the news’s so I asked if I could help sort the children’s clothes into boxes. We put everything from socks to hats in a box for a child age say 1-2 and then 3-4 and so on. I love it when we fill a box and tape it closed and then stack it in it he right pile. That means it is ready to go out to help some children who have arrived in Manchester. I like how organised it is and I like to keep it that way! There’s been some amazing donations like the traditional clothing ladies have been bringing it is soooo beautiful, all sparkles and colours. There’s been some pretty bad stuff too like stained white T-shirt’s and vests. Why would you send that to people we want to welcome and make feel special? But they need lots more help here. It’s really nice, everyone is friendly and helpful. I like how everyone just helps it doesn’t really matter who you are. I have asked my mum if we can not have gifts this Christmas and instead send the money to C4C for shoes and coats for the children. You can help too Care4Calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":33562,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32056"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32056"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32056\/revisions"}],"predecessor-version":[{"id":32271,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32056\/revisions\/32271"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33562"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32056"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32056"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32056"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}