{"id":32061,"date":"2021-09-10T18:48:59","date_gmt":"2021-09-10T18:48:59","guid":{"rendered":"https:\/\/care4calais.org\/?p=32061"},"modified":"2021-11-10T14:43:44","modified_gmt":"2021-11-10T14:43:44","slug":"amins-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/amins-story\/","title":{"rendered":"Amin&#8217;s story"},"content":{"rendered":"<p><strong>Trigger warning: The following story is one of the most brutal we have ever told. It is upsetting, but highlights the need for urgent access to mental health facilities for refugees.<\/strong><\/p>\n<p><em>Death can have many different shapes. The worst one is when you are alive.<\/em><\/p>\n<p>My name is Amin and I am from Darfur. The war in Darfur has been raging since 2003, even with President Bashir’s removal from power, the Janjaweed militia are still destroying villages and lives.<br \/>\nMy village is small, and in a rural area. When I lived there, my daily concern was my cattle: how they were acting, how they felt and where they were grazing. I didn’t go to school. I spent time singing, and throwing a stick in the air and catching it. Just normal things.<br \/>\nOne day I was herding the cattle back from grazing toward the village boundaries when I saw two militia cars in the distance. Militia cars are never good news; I ran towards them to see what was happening. As I got closer I could hear my mum screaming and screaming.<br \/>\nI approached, I saw my mum being held by ten soldiers, her face bloody. “Please, for God’s sake stop,” I yelled, and tried to reach for her. One of the soldiers knocked me back with a hard slap across my face.<br \/>\nThen I saw my sister. She was trying to fight three brutal soldiers who were forcing themselves on her. They tore her clothes off and held her down and raped her. She was 13 years old. In the end she passed out.<br \/>\nI could do nothing. I was an 18-year-old boy against ten armed men. I tried to close my eyes and block out the sound, but another one hit me, this time with his rifle butt. “See your little sister having good sex,” he taunted.<br \/>\nMy mum collapsed, and one of them whoispered to me that she was dead. They had beaten her too badly. She was just a village woman, she did not deserve this. No one in Darfur deserves what happens to them.<br \/>\nThe soldiers then destroyed our home, and killed our cattle.<br \/>\nI stayed with my sister and the body of my mum, feeling so ashamed that I had not been able to save her from these men. I didn’t know what to do, I couldn’t eat, I couldn’t sleep, I couldn’t even kill myself, even though I wanted to. I would have asked my father, but we had lost him when I was young, so I didn’t even have that.<br \/>\nI stayed in the village for two weeks, but then I had to run away. As I went I took every risk there was, I didn’t care. I wanted to be killed.<br \/>\nI travelled through the desert and eventually found myself in Libya.<br \/>\nI had no education and no money, I couldn’t read or write. But I worked for a Libyan man for a year, working day and night, doing anything in any weather. I dreamed of getting away and traveling on the “death boats” people use to try to get across the Mediterranean from Libya. I thought that perhaps one of the waves I would meet my death and be buried in the sea bed.<br \/>\nBut death refused to take me, and I made it to England. I have been here some years now, and although I have a big scar on my soul, I am here and life is slowly improving. My sister’s rape will forever haunt me but I have to live with that. I was only a boy against ten soldiers.<br \/>\nI wanted to get a job so I could send money home to Sudan, and decided to try to become a bus driver.<br \/>\nI struggled to pass my driving test as I had had so little education, I couldn’t read the books, but I finally passed it on my third attempt. I drive buses in Birmingham now, and I try to help all my passengers as much as I can. It is my way to say thank you for all the help I have received here.<br \/>\nThis country has saved my life. I send money home to my family who care for my sister. I still worry about them as Darfur is not safe and one day the militia might come back.<br \/>\nThere are many Darfurians in the UK who have suffered worse than me. There is very little counselling available, and they need your help. Please donate to Care4calais to enable them to help more survivors like me.<br \/>\nCare4Calais.org\/donate<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Trigger warning: The following story is one of the most brutal we have ever told. It is upsetting, but highlights the need for urgent access to mental health facilities for refugees. Death can have many different shapes. The worst one is when you are alive. My name is Amin and I am from Darfur. The war in Darfur has been raging since 2003, even with President Bashir’s removal from power, the Janjaweed militia are still destroying villages and lives. My village is small, and in a rural area. When I lived there, my daily concern was my cattle: how they were acting, how they felt and where they were grazing. I didn’t go to school. I spent time singing, and throwing a stick in the air and catching it. Just normal things. One day I was herding the cattle back from grazing toward the village boundaries when I saw two militia cars in the distance. Militia cars are never good news; I ran towards them to see what was happening. As I got closer I could hear my mum screaming and screaming. I approached, I saw my mum being held by ten soldiers, her face bloody. “Please, for God’s sake stop,” I yelled, and tried to reach for her. One of the soldiers knocked me back with a hard slap across my face. Then I saw my sister. She was trying to fight three brutal soldiers who were forcing themselves on her. They tore her clothes off and held her down and raped her. She was 13 years old. In the end she passed out. I could do nothing. I was an 18-year-old boy against ten armed men. I tried to close my eyes and block out the sound, but another one hit me, this time with his rifle butt. “See your little sister having good sex,” he taunted. My mum collapsed, and one of them whoispered to me that she was dead. They had beaten her too badly. She was just a village woman, she did not deserve this. No one in Darfur deserves what happens to them. The soldiers then destroyed our home, and killed our cattle. I stayed with my sister and the body of my mum, feeling so ashamed that I had not been able to save her from these men. I didn’t know what to do, I couldn’t eat, I couldn’t sleep, I couldn’t even kill myself, even though I wanted to. I would have asked my father, but we had lost him when I was young, so I didn’t even have that. I stayed in the village for two weeks, but then I had to run away. As I went I took every risk there was, I didn’t care. I wanted to be killed. I travelled through the desert and eventually found myself in Libya. I had no education and no money, I couldn’t read or write. But I worked for a Libyan man for a year, working day and night, doing anything in any weather. I dreamed of getting away and traveling on the “death boats” people use to try to get across the Mediterranean from Libya. I thought that perhaps one of the waves I would meet my death and be buried in the sea bed. But death refused to take me, and I made it to England. I have been here some years now, and although I have a big scar on my soul, I am here and life is slowly improving. My sister’s rape will forever haunt me but I have to live with that. I was only a boy against ten soldiers. I wanted to get a job so I could send money home to Sudan, and decided to try to become a bus driver. I struggled to pass my driving test as I had had so little education, I couldn’t read the books, but I finally passed it on my third attempt. I drive buses in Birmingham now, and I try to help all my passengers as much as I can. It is my way to say thank you for all the help I have received here. This country has saved my life. I send money home to my family who care for my sister. I still worry about them as Darfur is not safe and one day the militia might come back. There are many Darfurians in the UK who have suffered worse than me. There is very little counselling available, and they need your help. Please donate to Care4calais to enable them to help more survivors like me. Care4Calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":33035,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32061"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32061"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32061\/revisions"}],"predecessor-version":[{"id":32273,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32061\/revisions\/32273"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33035"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32061"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32061"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32061"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}