{"id":32165,"date":"2021-09-14T22:03:13","date_gmt":"2021-09-14T22:03:13","guid":{"rendered":"https:\/\/care4calais.org\/?p=32165"},"modified":"2021-11-10T14:41:35","modified_gmt":"2021-11-10T14:41:35","slug":"arass-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/arass-story\/","title":{"rendered":"Aras&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">“In Iraq, for a refugee, life is like hell”<\/p>\n<p>&nbsp;<\/p>\n<p>Aras, a Syrian, is living in a camp of over 1000 tents in the Governate of Hasakah, in Iraq.<\/p>\n<p>“I have been in this camp many years, I left Syria when I was 16, I’m now 25.<\/p>\n<p>“This is my home, but there is no future here and no security. I left because of the war – there was no education and the pressure to fight with one side or another was too great. I didn’t know who I was fighting or why . I was only a child.<\/p>\n<p>“My family said I should leave if I did not want to die. There was also no way for me to get money to feed myself, so really I did not have a choice.<\/p>\n<p>“The Iraqi government does not give refugees any support, money or food. We always have to borrow money to buy things to eat, and my wife’s milk dried up because she was not eating enough. So we had to find money to buy baby milk.<\/p>\n<p>“I don’t know how we will repay it all. I met my wife in the camp, and my daughter was born in the camp- she knows nothing else. We named her Naz’gul, it means beautiful rose, a rose that will bloom in the desert and give us hope.<\/p>\n<p>“I used to have a job. I was in a restaurant, but I questioned why I had to work 12 hours a day when the Iraqis were only doing eight hours. In Iraq there is a lot of discrimination and prejudice against refugees, and the boss said, ‘because you are a refugee. You are nothing, you are a slave.’<\/p>\n<p>“As a result of asking questions, I lost my job. And now it is hard to find food. it makes life very hard, it makes you feel so small and worthless. I don’t want that for my daughter.<\/p>\n<p>“I have tried to leave. We went to the UNHCR but they wouldn’t even hear me, I didn’t even care where we were sent, I just hoped for somewhere with human rights and a future for my child.<\/p>\n<p>“The road to Britain is difficult. I tried to cross the sea, but it is not that easy, and many, many people die, far more than you see in the news. You have to be very brave to go on the boats if you only have a little money. My wife was scared too, because she wondered what would happen to her if I died. That drove the idea from my mind.<\/p>\n<p>“I don’t want much; just a future for my child, and the chance to have a job. I’ve a lot of experience in the restaurant and the construction industries, so I am sure I would get a job if I had a chance.<\/p>\n<p>“I want to apply for asylum in Iraq but it is impossible, you have to cross the sea first and get to the UK before you can apply. People want to know why the UK- it’s simple, it’s a place that believes in freedom and human rights. It’s a dream.”<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; “In Iraq, for a refugee, life is like hell” &nbsp; Aras, a Syrian, is living in a camp of over 1000 tents in the Governate of Hasakah, in Iraq. “I have been in this camp many years, I left Syria when I was 16, I’m now 25. “This is my home, but there is no future here and no security. I left because of the war – there was no education and the pressure to fight with one side or another was too great. I didn’t know who I was fighting or why . I was only a child. “My family said I should leave if I did not want to die. There was also no way for me to get money to feed myself, so really I did not have a choice. “The Iraqi government does not give refugees any support, money or food. We always have to borrow money to buy things to eat, and my wife’s milk dried up because she was not eating enough. So we had to find money to buy baby milk. “I don’t know how we will repay it all. I met my wife in the camp, and my daughter was born in the camp- she knows nothing else. We named her Naz’gul, it means beautiful rose, a rose that will bloom in the desert and give us hope. “I used to have a job. I was in a restaurant, but I questioned why I had to work 12 hours a day when the Iraqis were only doing eight hours. In Iraq there is a lot of discrimination and prejudice against refugees, and the boss said, ‘because you are a refugee. You are nothing, you are a slave.’ “As a result of asking questions, I lost my job. And now it is hard to find food. it makes life very hard, it makes you feel so small and worthless. I don’t want that for my daughter. “I have tried to leave. We went to the UNHCR but they wouldn’t even hear me, I didn’t even care where we were sent, I just hoped for somewhere with human rights and a future for my child. “The road to Britain is difficult. I tried to cross the sea, but it is not that easy, and many, many people die, far more than you see in the news. You have to be very brave to go on the boats if you only have a little money. My wife was scared too, because she wondered what would happen to her if I died. That drove the idea from my mind. “I don’t want much; just a future for my child, and the chance to have a job. I’ve a lot of experience in the restaurant and the construction industries, so I am sure I would get a job if I had a chance. “I want to apply for asylum in Iraq but it is impossible, you have to cross the sea first and get to the UK before you can apply. People want to know why the UK- it’s simple, it’s a place that believes in freedom and human rights. It’s a dream.” &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":33033,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32165"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32165"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32165\/revisions"}],"predecessor-version":[{"id":32277,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32165\/revisions\/32277"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33033"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32165"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32165"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}