{"id":32424,"date":"2021-09-18T11:41:14","date_gmt":"2021-09-18T11:41:14","guid":{"rendered":"https:\/\/care4calais.org\/?p=32424"},"modified":"2021-11-10T14:18:27","modified_gmt":"2021-11-10T14:18:27","slug":"yemen-executions","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/yemen-executions\/","title":{"rendered":"Yemen executions"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Today a refugee from Calais messaged me the most horrific picture.<\/p>\n<p>It brought home to me the fear and suffering that drives some people to flee their homeland, and the need for Care4Calais to keep doing what we do.<\/p>\n<p>The message had a picture of helpless, frightened young man being manhandled by armed soldiers. He looked no older than a schoolboy, but he was being dragged roughly to his execution.<\/p>\n<div class=\"text_exposed_show\">\n<p>Minutes later, my friend explained, he was publicly shot to death by a firing squad.<\/p>\n<p>He was 17 years old.<\/p>\n<p>According to reports, the boy was Abdulaziz Ali M A Al-Aswad, and he was executed by Houthi soldiers in Yemen. The Houthi, says Nadwa Dawsari, fellow at the Middle East Institute, abducted Adbulaziz when he was 13; they then tortured him for three years until he was paralysed.<\/p>\n<p>The Houthi said they executed nine men altogether, after convicting them of assisting the 2018 killing of their leader Saleh al-Sammad.<\/p>\n<p>Al-Sammad was actually killed by a Saudi Arabia-led coalition air attack in the city of Hodeidah on Yemen’s west coast. It’s hard to imagine how a 14-year-old boy could have been responsible for that, but then the trial is unlikely to have had standards of fairness.<\/p>\n<p>When you meet Yemeni refugees, they are warm, kind people, whose kindness and patience have somehow survived their terrible suffering through the war and famine in their country.<\/p>\n<p>They deeply love their homeland, and you realise they would not have left unless they were scared and desperate. Today’s awful story is a terrifying reminder of what drives them to run.<\/p>\n<p>There are truly no words to convey the horror of this image but at a time when we have all been made to think about the suffering being inflicted on the Afghan poeple, let us not forget that similar pain and desperation afflict hundreds of thousands of other people around the world.<\/p>\n<p>They all deserve our understanding and support. God bless you, Abdulaziz.<\/p>\n<p><a class=\"_58cn\" href=\"https:\/\/www.facebook.com\/hashtag\/yemen?__eep__=6&amp;source=feed_text&amp;epa=HASHTAG&amp;__xts__%5B0%5D=68.ARDKVZAveAg6pBc8eoSDLYO9ycUVnUsvHFM6vEhEgvckb3veCEP6IcpxCwGua6aGl5LTaQD5yqbZHxo4uv9jjYySZ4twm3GQK_Lj-QBxgseDiGoob04c7w2zpDLzxnahfyWSSr_tlyIcU_ByCflu0u6MgWGpt9We2d66efdQEvKAo2Hno6ej00b4cv23yFwS_tLtQTo09SvIsZtgtHBHKRX0UjBoDI0c72Ox4IqUMn3cX0y9QLQBNU-SsP24D85k4Vfx9YZdlgDeHddLYMC4X0wLA3eKMoog2htDs0Mx0gM4J0ok7W1E-pI&amp;__tn__=%2ANK-R\" data-ft=\"{&quot;type&quot;:104,&quot;tn&quot;:&quot;*N&quot;}\"><span class=\"_5afx\"><span class=\"_58cl _5afz\" aria-label=\"etiketa e thurjes\">#<\/span><span class=\"_58cm\">Yemen<\/span><\/span><\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Today a refugee from Calais messaged me the most horrific picture. It brought home to me the fear and suffering that drives some people to flee their homeland, and the need for Care4Calais to keep doing what we do. The message had a picture of helpless, frightened young man being manhandled by armed soldiers. He looked no older than a schoolboy, but he was being dragged roughly to his execution. Minutes later, my friend explained, he was publicly shot to death by a firing squad. He was 17 years old. According to reports, the boy was Abdulaziz Ali M A Al-Aswad, and he was executed by Houthi soldiers in Yemen. The Houthi, says Nadwa Dawsari, fellow at the Middle East Institute, abducted Adbulaziz when he was 13; they then tortured him for three years until he was paralysed. The Houthi said they executed nine men altogether, after convicting them of assisting the 2018 killing of their leader Saleh al-Sammad. Al-Sammad was actually killed by a Saudi Arabia-led coalition air attack in the city of Hodeidah on Yemen’s west coast. It’s hard to imagine how a 14-year-old boy could have been responsible for that, but then the trial is unlikely to have had standards of fairness. When you meet Yemeni refugees, they are warm, kind people, whose kindness and patience have somehow survived their terrible suffering through the war and famine in their country. They deeply love their homeland, and you realise they would not have left unless they were scared and desperate. Today’s awful story is a terrifying reminder of what drives them to run. There are truly no words to convey the horror of this image but at a time when we have all been made to think about the suffering being inflicted on the Afghan poeple, let us not forget that similar pain and desperation afflict hundreds of thousands of other people around the world. They all deserve our understanding and support. God bless you, Abdulaziz. #Yemen<\/p>\n","protected":false},"author":21,"featured_media":33027,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32424"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32424"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32424\/revisions"}],"predecessor-version":[{"id":32426,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32424\/revisions\/32426"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33027"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32424"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32424"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32424"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}