{"id":32592,"date":"2021-10-07T18:27:33","date_gmt":"2021-10-07T18:27:33","guid":{"rendered":"https:\/\/care4calais.org\/?p=32592"},"modified":"2021-10-07T18:29:44","modified_gmt":"2021-10-07T18:29:44","slug":"volunteer-stories-toni","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/volunteer-stories-toni\/","title":{"rendered":"Volunteer stories: Toni"},"content":{"rendered":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">As I got back to the van after the distribution today, I burst into tears. I couldn’t hold them back any longer. I guess all the pent-up emotions of the last week here in Calais caught up with me, and they came bursting out.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Earlier I’d met a guy called Ahmed at one of the distribution sites. I was helping on one of the game stations, and when Ahmed came over we played ping pong for an hour while getting to know each other.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">He&#8217;s a huge fan of movies and TV shows, and was very excited when I told him I was studying to be a film director. We chatted about the new season of Sex Education, End of the F***ing World, Game of Thrones, Marvel and every other show or movie we could think of. It was quite surprising to find someone from Yemen who found the same shows as I did funny or enthralling.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Then Ahmed began telling me about his journey to Calais.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">He&#8217;d only been here for three days, and had no one with him. He told me he came from Yemen, and travelled through Sudan and Libya. In Sudan he had travelled with around 10 other men and three women. When they reached Libya, the men were lined up and held at gunpoint while the women were raped in front of them.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Ahmed told me how traumatic it was to watch that; he had not been able to do anything to stop it, because if he had tried, he would have been shot.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Afterwards, he said, the women were sold as slaves.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">All through this story we were playing ping pong, without a change of pace. Then he told me of his goal of getting to England, and how he would like to continue his job as a decorator if he gets over. Knowing how rough the asylum system in the UK is, I couldn&#8217;t help but think how difficult that simple dream might be for him to achieve.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">His story was so upsetting to me that I couldn’t help but cry as I packed up the van. I didn’t want him to see me upset – that would help no one. Ahmed’s laughter was so infectious, and it made me happy talking to him about our shared interests; it was just like making a new friend at university, but of course it wasn’t that at all. His situation is horrific and doesn’t need to be, yet he is so cheerful when we’re on site. I think that’s what upset me so much.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I came to Calais to help where I could, and Care4Calais made that easy. I talked and chatted with so many warm and inspiring people, and never once did I feel unprepared – the charity is so well organised and really knows what it is doing. They brief you well before you go out on distributions, but another thing that’s important is the debrief at the end of the day.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">We all gather for a last cup of tea, and talk about what we have seen, heard and done. This allows an outlet for our feelings of anger and sadness, and helps us realise that today we did help, and we made someone’s day a little better. We realise that it’s ok to feel sad, and there are people to share that with and to talk to about it. You are never left alone with your tears.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I’m only 20, and this is all new to me. The experience has made a big impact on me, and I would urge anyone thinking about volunteering to take that step and just do it. You’re really needed right now, and you won’t regret volunteering, I assure you.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">&#8211; Toni Fifield volunteer<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">To find out more, email clare@care4calais.org for a volunteer info pack.<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>As I got back to the van after the distribution today, I burst into tears. I couldn’t hold them back any longer. I guess all the pent-up emotions of the last week here in Calais caught up with me, and they came bursting out. Earlier I’d met a guy called Ahmed at one of the distribution sites. I was helping on one of the game stations, and when Ahmed came over we played ping pong for an hour while getting to know each other. He&#8217;s a huge fan of movies and TV shows, and was very excited when I told him I was studying to be a film director. We chatted about the new season of Sex Education, End of the F***ing World, Game of Thrones, Marvel and every other show or movie we could think of. It was quite surprising to find someone from Yemen who found the same shows as I did funny or enthralling. Then Ahmed began telling me about his journey to Calais. He&#8217;d only been here for three days, and had no one with him. He told me he came from Yemen, and travelled through Sudan and Libya. In Sudan he had travelled with around 10 other men and three women. When they reached Libya, the men were lined up and held at gunpoint while the women were raped in front of them. Ahmed told me how traumatic it was to watch that; he had not been able to do anything to stop it, because if he had tried, he would have been shot. Afterwards, he said, the women were sold as slaves. All through this story we were playing ping pong, without a change of pace. Then he told me of his goal of getting to England, and how he would like to continue his job as a decorator if he gets over. Knowing how rough the asylum system in the UK is, I couldn&#8217;t help but think how difficult that simple dream might be for him to achieve. His story was so upsetting to me that I couldn’t help but cry as I packed up the van. I didn’t want him to see me upset – that would help no one. Ahmed’s laughter was so infectious, and it made me happy talking to him about our shared interests; it was just like making a new friend at university, but of course it wasn’t that at all. His situation is horrific and doesn’t need to be, yet he is so cheerful when we’re on site. I think that’s what upset me so much. I came to Calais to help where I could, and Care4Calais made that easy. I talked and chatted with so many warm and inspiring people, and never once did I feel unprepared – the charity is so well organised and really knows what it is doing. They brief you well before you go out on distributions, but another thing that’s important is the debrief at the end of the day. We all gather for a last cup of tea, and talk about what we have seen, heard and done. This allows an outlet for our feelings of anger and sadness, and helps us realise that today we did help, and we made someone’s day a little better. We realise that it’s ok to feel sad, and there are people to share that with and to talk to about it. You are never left alone with your tears. I’m only 20, and this is all new to me. The experience has made a big impact on me, and I would urge anyone thinking about volunteering to take that step and just do it. You’re really needed right now, and you won’t regret volunteering, I assure you. &#8211; Toni Fifield volunteer To find out more, email clare@care4calais.org for a volunteer info pack.<\/p>\n","protected":false},"author":21,"featured_media":32594,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32592"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32592"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32592\/revisions"}],"predecessor-version":[{"id":32597,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32592\/revisions\/32597"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/32594"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32592"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32592"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32592"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}