{"id":32661,"date":"2021-10-11T10:29:18","date_gmt":"2021-10-11T10:29:18","guid":{"rendered":"https:\/\/care4calais.org\/?p=32661"},"modified":"2021-12-07T11:38:47","modified_gmt":"2021-12-07T11:38:47","slug":"sated-and-fatimas-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/sated-and-fatimas-story\/","title":{"rendered":"Sayed"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Yesterday, at a clothes distribution for Afghan refugees, I met a young family whose suffering and dignity I will never, ever forget.<\/p>\n<p>The quiet young husband, Sayed, and his wife, Fatima, had three young children aged between 6 months and five years old. They had came at the end of the afternoon, when there were fewer people around; Sayed shyly admitted they felt uncomfortable asking for help, but having left Afghanistan with only the clothes they we wearing, they found they had little choice. It made me realise once more how vital it is to make our distributions calm, discreet and dignified.<\/p>\n<p>Sayed had worked with the British army in Afghanistan for ten years. As soon as the Taliban entered Kabul, Fatima said, they had received an email from the army telling them they were in danger, but they didn’t need telling.<\/p>\n<p>As someone working with the British forces Sayed knew he was was a target for the Taliban – he had had too many friends and colleagues murdered to think otherwise. “Someone would disappear for two or three days, and you would know what had happened,” he told me. “Then you hear their body has been tossed out of moving car and left on the street. That’s how it is.”<\/p>\n<p>They didn’t have time to wait for a plane, but immediately left their home and, secretly and in hiding, moved to a friend’s house. The next day, they moved again, and the next day the same thing; on and on for seven days, mum, dad and children being spirited around the city. They heard that men from the Taliban had ransacked their home, stolen their car, and were on the hunt for them; they desperately hoped the Taliban wouldn’t find and question members of Sayed’s family.<\/p>\n<p>“I am thankful we escaped,” Sayed said, glancing at his wife. “But those last days in Kabul will stay with my family forever.”<\/p>\n<p>I noticed faint grimaces on both of their faces, and no wonder. I have a young family myself ,and sometimes complain about how “stressful” it is getting them all in the car to go out. I can’t imagine how I’d cope with moving them from house to house while in fear for all our lives.<\/p>\n<p>And yet this couple that had been so brave, and that had been through so much, now stood in a community centre feeling they were taking too much by accepting help. It was utterly, utterly heartbreaking.<\/p>\n<p>Eventually, they told me, they heard there was a flight they could get on, and they all went to the airport, where they waited anxiously for hours in the sweltering heat and noise. it was terrifying; at one point, Fatima remembers, there was panic because some of the Taliban broke into the airport. At last they were flown to Dubai, and then to London. They said they were grateful because they had been given food; I thought that after ten years service risking your life, a hot meal was the very least they deserved.<\/p>\n<p>The family are now living in a city centre hotel with about 1,000 other Afghans. The conditions were not so bad, they said, although they had been short of clothes for the children. Their biggest worries now were for their families back in Afghanistan, because they know the Taliban had been back searching their home for clues as to Sayed’s whereabouts.<\/p>\n<p>And they were uncertain and apprehensive about the future. While they expected to be moved on and housed, they had had getting little information about what was going to happen to them, and so were here in a strange country, unaware of what strange town or city they might end up in. I know it’s a big operation, but surely the so-called Operation Warm Welcome could stretch to some basic communication with our guests?<\/p>\n<p>I really, really hoped that the government does not now make a crisis out of a drama by leaving in limbo people whose mental health has taken such a battering. But as things are, it’s essential that as compassionate people, we all do what we can to support people like Sayed, Fatima and their family.<\/p>\n<p>To volunteer or donate go to <a href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"noopener nofollow\" data-ft=\"{&quot;tn&quot;:&quot;-U&quot;}\" data-lynx-mode=\"async\" data-lynx-uri=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2FCare4Calais.org%2F&amp;h=AT1evxCQjClaYoxKoTqO7Vinlqe-fWMq2uVeNdbYw3i5NcnhkHZ9YNybTQgJ_dA75pbqDRHEkQESO6lbRhQO9y3Tvr7awVRlWSLeHJt5LsOPqUljAL5Lf0YCJfRQclbpt4P7OE6eBMMEhhYMLrc2gaTablVEw_f0qZ_B8IgJNhEbkOkp6m8p4DlLemWSi_zLKWKf_adet4pLqEExBoNDKx9Ywyn4HannbeqUUYAFEsJoQTm-7H_PPKRUq-j5-AsICElMx3Z3JgxPegKaXRBCMazEKP_uEu5Nx5XLg4QO4eDWSlgq8GIrT8xYrlsNfoXIvI6gHZ5t5y-W5ua8hMgiuP5bEz26TeUFORUKLn-iIBPmX7f-ihGzEUf9UOO_bpftaQIP9NB3doYxOnPwj_fsDj3CbDc_FakTnB2bArCfdQLtbzcgZHlombQiB-lwgSi2BlusJVcbHueIUvFU5z3JisZUSsHEXhmmNk6Xpbi8x5qRkQc8M-C8kb6yNrNZnSUQSxKACB0FmNoD4JbRHVuLqfNCzK0NbQegDlVZZS_7QRZxgwXLCRlXo24PC5KNPu_EaQ0SE-V_ETg5j6Z_sO2WBKPMcUqJjFopTRAKEi8\">Care4Calais.org<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Yesterday, at a clothes distribution for Afghan refugees, I met a young family whose suffering and dignity I will never, ever forget. The quiet young husband, Sayed, and his wife, Fatima, had three young children aged between 6 months and five years old. They had came at the end of the afternoon, when there were fewer people around; Sayed shyly admitted they felt uncomfortable asking for help, but having left Afghanistan with only the clothes they we wearing, they found they had little choice. It made me realise once more how vital it is to make our distributions calm, discreet and dignified. Sayed had worked with the British army in Afghanistan for ten years. As soon as the Taliban entered Kabul, Fatima said, they had received an email from the army telling them they were in danger, but they didn’t need telling. As someone working with the British forces Sayed knew he was was a target for the Taliban – he had had too many friends and colleagues murdered to think otherwise. “Someone would disappear for two or three days, and you would know what had happened,” he told me. “Then you hear their body has been tossed out of moving car and left on the street. That’s how it is.” They didn’t have time to wait for a plane, but immediately left their home and, secretly and in hiding, moved to a friend’s house. The next day, they moved again, and the next day the same thing; on and on for seven days, mum, dad and children being spirited around the city. They heard that men from the Taliban had ransacked their home, stolen their car, and were on the hunt for them; they desperately hoped the Taliban wouldn’t find and question members of Sayed’s family. “I am thankful we escaped,” Sayed said, glancing at his wife. “But those last days in Kabul will stay with my family forever.” I noticed faint grimaces on both of their faces, and no wonder. I have a young family myself ,and sometimes complain about how “stressful” it is getting them all in the car to go out. I can’t imagine how I’d cope with moving them from house to house while in fear for all our lives. And yet this couple that had been so brave, and that had been through so much, now stood in a community centre feeling they were taking too much by accepting help. It was utterly, utterly heartbreaking. Eventually, they told me, they heard there was a flight they could get on, and they all went to the airport, where they waited anxiously for hours in the sweltering heat and noise. it was terrifying; at one point, Fatima remembers, there was panic because some of the Taliban broke into the airport. At last they were flown to Dubai, and then to London. They said they were grateful because they had been given food; I thought that after ten years service risking your life, a hot meal was the very least they deserved. The family are now living in a city centre hotel with about 1,000 other Afghans. The conditions were not so bad, they said, although they had been short of clothes for the children. Their biggest worries now were for their families back in Afghanistan, because they know the Taliban had been back searching their home for clues as to Sayed’s whereabouts. And they were uncertain and apprehensive about the future. While they expected to be moved on and housed, they had had getting little information about what was going to happen to them, and so were here in a strange country, unaware of what strange town or city they might end up in. I know it’s a big operation, but surely the so-called Operation Warm Welcome could stretch to some basic communication with our guests? I really, really hoped that the government does not now make a crisis out of a drama by leaving in limbo people whose mental health has taken such a battering. But as things are, it’s essential that as compassionate people, we all do what we can to support people like Sayed, Fatima and their family. To volunteer or donate go to Care4Calais.org<\/p>\n","protected":false},"author":21,"featured_media":33016,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32661"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32661"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32661\/revisions"}],"predecessor-version":[{"id":33561,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32661\/revisions\/33561"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33016"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32661"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32661"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32661"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}