{"id":32691,"date":"2021-10-13T17:27:28","date_gmt":"2021-10-13T17:27:28","guid":{"rendered":"https:\/\/care4calais.org\/?p=32691"},"modified":"2023-02-08T17:06:37","modified_gmt":"2023-02-08T16:06:37","slug":"getting-help-to-afghan-refugees","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/getting-help-to-afghan-refugees\/","title":{"rendered":"Getting help to Afghan refugees"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">My volunteer group distributed clothes to new Afghan refugees for first time a couple of weeks ago, and it was heartbreakingly upsetting in many ways.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Two hundred people came along, many in flip flops and T-shirts, and with lots of mums carrying little ones along the half-hour walk from their hotel. We knew the need was great, but this really brought home how great it was. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">And with such numbers, it was a struggle to get everyone the things they needed – nevertheless, they were incredibly calm and understanding. Their dignity in these most trying of circumstances constantly impresses and amazes me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">My name is Georgia, I’ve been helping Care4Calais in London, where I live, since August 2020. I’m a British citizen now, but I’m from Cyprus originally, and I’d been watching the situation with refugees in Greece for years before. I had never been able to go to help in Greece because of my job, so when I saw Care4Calais call for volunteers in the UK I jumped right in.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I work full time in the city in financial services for groups like JP Morgan, so volunteering in my free time means my weeks are incredibly busy! I’m lead volunteer for the north London group of hotels now, which is very time -consuming, but so worthwhile. Being busy volunteering has kept me sane during the pandemic!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are so many refugees in London – one of our hotels has 300 in it alone, so you can imagine the degree of need that there is. When the new Afghan refugees began arriving in the summer, we wanted to help them too. As compassionate people we can’t just stand by and do nothing to help.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In London storage and transport are problems, as you can imagine. Still, with a bit of hard work we managed to find storage space for the donations, and then a small place where we could invite people to come to get things. For that first distribution, I got in contact with the hotel and invited refugees to come. Then we volunteers went to meet them, and lead them to the venue. We knew they were in a strange city, and we wanted to be sure they could find it. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I felt like the Pied Piper walking around London with everyone following me. It was quite funny really; everyone was looking the wrong way for the traffic and in totally the wrong clothes for London in October.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With distributions, you learn what works best from experience, and we’ve found that things feel better with smaller groups. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For the second one, we invited 30 people from one of the hotels. They had to show their room key to be allowed to come along.In the end 50 came, but we could manage that. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">At the venue we had a quick lesson on how queues work in the UK so that everyone understood how things would go, and we tried to assure people we had enough to go around and couldn’t allow cutting in. As our time window is limited, we have to be strict about the amount of time we allow each person to look for things. I’m very bad at this, far too soft, but luckily other team members are much tougher than me, and keep things rolling. And if people don’t find exactly what they want, they know we’ll be back again and there’ll be another chance.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Next week we’re going to a third hotel. It’s the biggest one to have Afghans staying, with over 300 people there. Having  visited already, I’ve seen there are a lot of children. In fact the high number of children is one of the things that’s special about this group of refugees – clothes and equipment for kids are in high demand. The hotel management have said they need 60 buggies, but at the time of writing  we have six left, so we’ll be finding more!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some of the Afghan people were so bewildered when they first arrived in the UK. It felt like they had been dropped from the sky, which in a way they had. For some, the UK seems very alien – we do things very differently, and there is so much to learn and do in order to make a life here. The Afghans tend to like different things to the young refugees we’ve become used to. They like smart shoes and shirts, not the usual trainers and skinny jeans. The women want beautiful traditional clothes with pretty headscarves. Mirrors and makeup are in high demand. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">They tell us the days in the hotels are so long and they feel alone. They like to chat with us, and we’ve become friends with many of them. I’ve come to appreciate how huge Afghanistan is, and how diverse and storied its people are. The other day one guy told me his ancestors stem from Alexander the Great.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">They’re worried about being moved after spending two months in London and starting to make a life here. Some people get so little notice of a move to a far flung part of the UK, so little wonder they’re anxious. We try to reassure them that Care4calais has groups all over the UK, and we’ll help them wherever they end up.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We don’t just help the Afghans – we run distributions for all refugees in our area, and we also run online English classes and help people with everyday stuff, like registering with GPs and dentists or problems with Aspen cards or accommodation. We do fun stuff too, like football sessions, game sessions and walks.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The distributions can take a long time, and some days I’m so tired when I get home, but I know it’s worth it to support these people who need our help. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you have the time to help please join us: you’ll meet such interesting people and I assure you that you will find it incredibly worthwhile. To get in touch, email annie@care4calais.org<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; My volunteer group distributed clothes to new Afghan refugees for first time a couple of weeks ago, and it was heartbreakingly upsetting in many ways. Two hundred people came along, many in flip flops and T-shirts, and with lots of mums carrying little ones along the half-hour walk from their hotel. We knew the need was great, but this really brought home how great it was.  And with such numbers, it was a struggle to get everyone the things they needed – nevertheless, they were incredibly calm and understanding. Their dignity in these most trying of circumstances constantly impresses and amazes me. My name is Georgia, I’ve been helping Care4Calais in London, where I live, since August 2020. I’m a British citizen now, but I’m from Cyprus originally, and I’d been watching the situation with refugees in Greece for years before. I had never been able to go to help in Greece because of my job, so when I saw Care4Calais call for volunteers in the UK I jumped right in. I work full time in the city in financial services for groups like JP Morgan, so volunteering in my free time means my weeks are incredibly busy! I’m lead volunteer for the north London group of hotels now, which is very time -consuming, but so worthwhile. Being busy volunteering has kept me sane during the pandemic! There are so many refugees in London – one of our hotels has 300 in it alone, so you can imagine the degree of need that there is. When the new Afghan refugees began arriving in the summer, we wanted to help them too. As compassionate people we can’t just stand by and do nothing to help. In London storage and transport are problems, as you can imagine. Still, with a bit of hard work we managed to find storage space for the donations, and then a small place where we could invite people to come to get things. For that first distribution, I got in contact with the hotel and invited refugees to come. Then we volunteers went to meet them, and lead them to the venue. We knew they were in a strange city, and we wanted to be sure they could find it.  I felt like the Pied Piper walking around London with everyone following me. It was quite funny really; everyone was looking the wrong way for the traffic and in totally the wrong clothes for London in October. With distributions, you learn what works best from experience, and we’ve found that things feel better with smaller groups.  For the second one, we invited 30 people from one of the hotels. They had to show their room key to be allowed to come along.In the end 50 came, but we could manage that.  At the venue we had a quick lesson on how queues work in the UK so that everyone understood how things would go, and we tried to assure people we had enough to go around and couldn’t allow cutting in. As our time window is limited, we have to be strict about the amount of time we allow each person to look for things. I’m very bad at this, far too soft, but luckily other team members are much tougher than me, and keep things rolling. And if people don’t find exactly what they want, they know we’ll be back again and there’ll be another chance. Next week we’re going to a third hotel. It’s the biggest one to have Afghans staying, with over 300 people there. Having  visited already, I’ve seen there are a lot of children. In fact the high number of children is one of the things that’s special about this group of refugees – clothes and equipment for kids are in high demand. The hotel management have said they need 60 buggies, but at the time of writing  we have six left, so we’ll be finding more! Some of the Afghan people were so bewildered when they first arrived in the UK. It felt like they had been dropped from the sky, which in a way they had. For some, the UK seems very alien – we do things very differently, and there is so much to learn and do in order to make a life here. The Afghans tend to like different things to the young refugees we’ve become used to. They like smart shoes and shirts, not the usual trainers and skinny jeans. The women want beautiful traditional clothes with pretty headscarves. Mirrors and makeup are in high demand.  They tell us the days in the hotels are so long and they feel alone. They like to chat with us, and we’ve become friends with many of them. I’ve come to appreciate how huge Afghanistan is, and how diverse and storied its people are. The other day one guy told me his ancestors stem from Alexander the Great. They’re worried about being moved after spending two months in London and starting to make a life here. Some people get so little notice of a move to a far flung part of the UK, so little wonder they’re anxious. We try to reassure them that Care4calais has groups all over the UK, and we’ll help them wherever they end up. We don’t just help the Afghans – we run distributions for all refugees in our area, and we also run online English classes and help people with everyday stuff, like registering with GPs and dentists or problems with Aspen cards or accommodation. We do fun stuff too, like football sessions, game sessions and walks. The distributions can take a long time, and some days I’m so tired when I get home, but I know it’s worth it to support these people who need our help.  If you have the time to help please join us: you’ll meet such interesting people and I assure you that you will find it incredibly worthwhile. To get in touch, email annie@care4calais.org &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32691"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32691"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32691\/revisions"}],"predecessor-version":[{"id":32695,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32691\/revisions\/32695"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32691"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32691"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32691"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}