{"id":32755,"date":"2021-10-16T19:07:58","date_gmt":"2021-10-16T19:07:58","guid":{"rendered":"https:\/\/care4calais.org\/?p=32755"},"modified":"2021-11-10T12:37:05","modified_gmt":"2021-11-10T12:37:05","slug":"esfandiars-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/esfandiars-story\/","title":{"rendered":"Esfandiar&#8217;s story"},"content":{"rendered":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">My name is Esfandiar. I’m from Iran, but I’m also a Kurd, so life in Iran was never easy for me. I’m a teacher, but I couldn’t get a regular teaching job in Iran because I didn’t fit the government’s ideas of what a good Iranian should be and do.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I wouldn’t spy on my fellow teachers or my students, but the Iranian government tried to pressurise me into doing so by making my life as hard as possible. Because I did not give in, they made it impossible for me to teach in regular schools, so I had to take private tutoring jobs wherever I could.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Then, six years ago, I met a woman online.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">She was a bit older than me, and a Christian, and she lived in Iraq, in Erbil. All that meant this was never going to be an easy match. My family were not happy about this woman, and did not want me to continue the relationship. But I went to Iraq anyway and met her there.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">We fell in love and got married, but people in Erbil did not like the idea of us being together. Her family did not want her to have a Muslim husband.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">After a year of feeling unsafe there, we went back to Iran. But there my own family would not accept my wife, and they began to make our lives miserable. They threatened my wife, telling her they would beat her or even kill her.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">It was a matter of honour to them; in their eyes, I had brought shame on the family by marrying an older Christian woman.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">It got so bad that one day someone from my family took a gun and shot her.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">She was pregnant at the time. She lost the baby.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">My wife became very depressed and suicidal, so I sent her back to Iraq for her safety. But her family sent her to a mental institution when she tried to commit suicide.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">It got so bad for me in Iran that I wasn’t safe, and I knew I had to leave. I thought if I went to Turkey I would be able to bring her over there, so I made the journey across the border. But once I was in Turkey, I couldn’t make contact with her. She had somehow disappeared.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I still don’t know where she is.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">There is no life for refugees in Turkey, so I had to leave and try to to find somewhere safe. I set off for the UK, and I spent a month in prison in Calais before I got lucky and made it over.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">At first I was housed in Leeds, but about six months ago I was moved to <a href=\"https:\/\/www.google.com\/search?q=jesmond&amp;rlz=1C5CHFA_enGB946GB946&amp;oq=jesmond&amp;aqs=chrome..69i57.1684j0j7&amp;sourceid=chrome&amp;ie=UTF-8\">Jesmond<\/a> in Newcastle-Upon-Tyne. It’s very cold, but it’s very nice, a good place.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I’m in a house with five others from different countries – they don’t really speak English, so I help them a lot, and that it keeps me busy. When I first arrived here from Leeds though it was so difficult, I thought I had moved to another new, different country. The accent was so hard for me to understand, and some words I just didn’t understand at all. Now I know it’s called a Geordie accent, and maybe one day I will get one too.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I’m volunteering with Care4Calais as an interpreter in Newcastle. I did it mainly because I like helping people, but it also takes my mind off things and helps pass the time. My degree is in English Language, from a university in Iran, so I’m lucky to be able to use it to benefit people.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Care4Calais makes things easier for refugees, so I am pleased to help them.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I don’t really know what I want to do once I get asylum, Inshallah. Maybe a software designer? I love animals – back home I had 25 rabbits, so many birds and two hedgehogs (&#8220;jue jue&#8221; in my language). I also had so many birds, so many different kinds that needed looking after.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Maybe I could volunteer at an animal shelter here in Newcastle, I wonder if that would be possible?<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Of course what I would really like to do is find my wife again. I will keep looking. If I find her, I will bring her to Newcastle.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">She would like it here. It is safe.<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>My name is Esfandiar. I’m from Iran, but I’m also a Kurd, so life in Iran was never easy for me. I’m a teacher, but I couldn’t get a regular teaching job in Iran because I didn’t fit the government’s ideas of what a good Iranian should be and do. I wouldn’t spy on my fellow teachers or my students, but the Iranian government tried to pressurise me into doing so by making my life as hard as possible. Because I did not give in, they made it impossible for me to teach in regular schools, so I had to take private tutoring jobs wherever I could. Then, six years ago, I met a woman online. She was a bit older than me, and a Christian, and she lived in Iraq, in Erbil. All that meant this was never going to be an easy match. My family were not happy about this woman, and did not want me to continue the relationship. But I went to Iraq anyway and met her there. We fell in love and got married, but people in Erbil did not like the idea of us being together. Her family did not want her to have a Muslim husband. After a year of feeling unsafe there, we went back to Iran. But there my own family would not accept my wife, and they began to make our lives miserable. They threatened my wife, telling her they would beat her or even kill her. It was a matter of honour to them; in their eyes, I had brought shame on the family by marrying an older Christian woman. It got so bad that one day someone from my family took a gun and shot her. She was pregnant at the time. She lost the baby. My wife became very depressed and suicidal, so I sent her back to Iraq for her safety. But her family sent her to a mental institution when she tried to commit suicide. It got so bad for me in Iran that I wasn’t safe, and I knew I had to leave. I thought if I went to Turkey I would be able to bring her over there, so I made the journey across the border. But once I was in Turkey, I couldn’t make contact with her. She had somehow disappeared. I still don’t know where she is. There is no life for refugees in Turkey, so I had to leave and try to to find somewhere safe. I set off for the UK, and I spent a month in prison in Calais before I got lucky and made it over. At first I was housed in Leeds, but about six months ago I was moved to Jesmond in Newcastle-Upon-Tyne. It’s very cold, but it’s very nice, a good place. I’m in a house with five others from different countries – they don’t really speak English, so I help them a lot, and that it keeps me busy. When I first arrived here from Leeds though it was so difficult, I thought I had moved to another new, different country. The accent was so hard for me to understand, and some words I just didn’t understand at all. Now I know it’s called a Geordie accent, and maybe one day I will get one too. I’m volunteering with Care4Calais as an interpreter in Newcastle. I did it mainly because I like helping people, but it also takes my mind off things and helps pass the time. My degree is in English Language, from a university in Iran, so I’m lucky to be able to use it to benefit people. Care4Calais makes things easier for refugees, so I am pleased to help them. I don’t really know what I want to do once I get asylum, Inshallah. Maybe a software designer? I love animals – back home I had 25 rabbits, so many birds and two hedgehogs (&#8220;jue jue&#8221; in my language). I also had so many birds, so many different kinds that needed looking after. Maybe I could volunteer at an animal shelter here in Newcastle, I wonder if that would be possible? Of course what I would really like to do is find my wife again. I will keep looking. If I find her, I will bring her to Newcastle. She would like it here. It is safe.<\/p>\n","protected":false},"author":21,"featured_media":33010,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[130,150,104,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32755"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32755"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32755\/revisions"}],"predecessor-version":[{"id":32757,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32755\/revisions\/32757"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33010"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32755"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32755"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32755"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}