{"id":32835,"date":"2021-10-23T05:24:03","date_gmt":"2021-10-23T05:24:03","guid":{"rendered":"https:\/\/care4calais.org\/?p=32835"},"modified":"2021-11-10T12:23:02","modified_gmt":"2021-11-10T12:23:02","slug":"tragedy-in-calais","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/tragedy-in-calais\/","title":{"rendered":"Tragedy in Calais"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>We are heartbroken to hear reports that a Sudanese man in his 30s has died after being hit by a lorry in Calais on Thursday.<\/p>\n<p>Mohammed had fled from Sudan hoping to reach the UK. His friends in Calais say he was hit by a lorry near the settlement known as the Hospital. It is not clear whether he was struck in a nearby lorry park or on the motorway.<\/p>\n<p>He was taken to hospital in Calais but died in the afternoon. A memorial service was held at Richelieu Park for him yesterday eve<span class=\"text_exposed_show\">ning.<\/span><\/p>\n<div class=\"text_exposed_show\">\n<p>Mohammed’s tragic death comes less than a month after a 16-year-old Sudanese boy called Yasser was killed trying to board a lorry in a lorry park in the town.<\/p>\n<p>For desperate people to have travelled so far from their home seeking safety, and survived such treacherous journeys, only to be killed in horrific ways at our border is not just unspeakably tragic and distressing, It is an indictment of years of failed policies by successive UK governments. If an efficient, modern asylum system allowing refugees safe passage across the Channel were in place, Mohammed, Yasser and the 292 others would not have died as they did.<\/p>\n<p>It’s as simple as that.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We are heartbroken to hear reports that a Sudanese man in his 30s has died after being hit by a lorry in Calais on Thursday. Mohammed had fled from Sudan hoping to reach the UK. His friends in Calais say he was hit by a lorry near the settlement known as the Hospital. It is not clear whether he was struck in a nearby lorry park or on the motorway. He was taken to hospital in Calais but died in the afternoon. A memorial service was held at Richelieu Park for him yesterday evening. Mohammed’s tragic death comes less than a month after a 16-year-old Sudanese boy called Yasser was killed trying to board a lorry in a lorry park in the town. For desperate people to have travelled so far from their home seeking safety, and survived such treacherous journeys, only to be killed in horrific ways at our border is not just unspeakably tragic and distressing, It is an indictment of years of failed policies by successive UK governments. If an efficient, modern asylum system allowing refugees safe passage across the Channel were in place, Mohammed, Yasser and the 292 others would not have died as they did. It’s as simple as that.<\/p>\n","protected":false},"author":21,"featured_media":33006,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32835"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32835"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32835\/revisions"}],"predecessor-version":[{"id":32837,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32835\/revisions\/32837"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33006"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32835"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32835"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32835"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}