{"id":32842,"date":"2021-10-26T19:37:29","date_gmt":"2021-10-26T19:37:29","guid":{"rendered":"https:\/\/care4calais.org\/?p=32842"},"modified":"2021-11-10T12:18:02","modified_gmt":"2021-11-10T12:18:02","slug":"the-trauma-of-afghan-children","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-trauma-of-afghan-children\/","title":{"rendered":"The trauma of Afghan children"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Some of the little Afghan girls and boys I see at our distributions seem so sad it’s unbearable. They’re so quiet and withdrawn, and while some just want to be with their mums, others seem quite detached from everything.<\/p>\n<p>At our last distribution, a little boy of about six came along with his mum, but then just found a child’s chair, sat down facing the wall, and stayed like that. He didn’t want to move, or talk, or interact with the other children at all. We tried very gently to encourage him to join in the playing, but he didn’t want to, so we kept an eye on him while his mum went to choose some clothes.<\/p>\n<p>The thing is, one of the Afghan dads told me, it isn’t just that they’re in a strange new place. It’s that the journey here was so long and strange. “My family was travelling for nine days in total,” he said. “Waiting at the airport, going to Dubai, coming to the UK, where we were in quarantine.<\/p>\n<p>“I had three children under seven years old. They had never been on a plane before in their lives. Imagine your first experience of flying in a plane is waiting to get through an airport where you might be killed, running down the runway to climb up into this big cargo plane with 300 people. Children and babies crying and scared. And no-one told us where we were going. Our children asked us, and we could not tell them.”<\/p>\n<p>Most adults would find it terrifying. And my children were scared flying in a nice comfortable passenger for the first time. just can’t imagine the impact it’s made on these poor kids.<\/p>\n<p>I remember reading a few weeks ago that holidaymakers at a hotel hosting some Afghan refugees on the coast had complained that the children were “running amok” there. I found it incredibly hard to believe, because the children we see are very reserved, and their mums keep a very close eye on them. To say such things about children who have been through so much is reprehensible.<\/p>\n<p>We try to make things better for them at distributions by making a little play area for the children, with mats and toys. Most of them are happy there, and it makes it easier for the parents to concentrate on what they need if they can leave their children somewhere safe – so long as they can always see each other, our space works well.<\/p>\n<p>The little boy on the chair did come round a little, and when his mum came back he snuggled into her and he cheered up. When I asked if he was ok, she gave a tired smile, and nodded. The suffering and bravery of these families overwhelms me sometimes. I smiled and back and busied myself with something to keep the tears back. This woman and her little boy don’t need our tears. They needed to know our government’s plans for them.<\/p>\n<p>A lot of the Afghan women have been through so much, you can tell, but often they are so quiet, bearing it all in near-silence. It breaks my heart, but I try to be as welcoming as possible, and help them choose clothes for themselves or their children.<\/p>\n<p>Sometimes they open up. That same day I had a long conversation about winter coats with one lady – we stood there talking about the kinds we preferred, and I helped her choose something that she liked, and she seemed really pleased with it. It felt good to have helped her. Small kindnesses can go a long way, sometimes; I try to imagine the pain of the women, men and children, and do what I can to let them know that decent people here are on their side.<\/p>\n<p>&#8211; J, Care4Calais volunteer, London<\/p>\n<p>Care4Calais will need a lot of warm coats for refugees this winter. If you can help, please go <a href=\"https:\/\/care4calais.org\/donate-now\/\">here<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Some of the little Afghan girls and boys I see at our distributions seem so sad it’s unbearable. They’re so quiet and withdrawn, and while some just want to be with their mums, others seem quite detached from everything. At our last distribution, a little boy of about six came along with his mum, but then just found a child’s chair, sat down facing the wall, and stayed like that. He didn’t want to move, or talk, or interact with the other children at all. We tried very gently to encourage him to join in the playing, but he didn’t want to, so we kept an eye on him while his mum went to choose some clothes. The thing is, one of the Afghan dads told me, it isn’t just that they’re in a strange new place. It’s that the journey here was so long and strange. “My family was travelling for nine days in total,” he said. “Waiting at the airport, going to Dubai, coming to the UK, where we were in quarantine. “I had three children under seven years old. They had never been on a plane before in their lives. Imagine your first experience of flying in a plane is waiting to get through an airport where you might be killed, running down the runway to climb up into this big cargo plane with 300 people. Children and babies crying and scared. And no-one told us where we were going. Our children asked us, and we could not tell them.” Most adults would find it terrifying. And my children were scared flying in a nice comfortable passenger for the first time. just can’t imagine the impact it’s made on these poor kids. I remember reading a few weeks ago that holidaymakers at a hotel hosting some Afghan refugees on the coast had complained that the children were “running amok” there. I found it incredibly hard to believe, because the children we see are very reserved, and their mums keep a very close eye on them. To say such things about children who have been through so much is reprehensible. We try to make things better for them at distributions by making a little play area for the children, with mats and toys. Most of them are happy there, and it makes it easier for the parents to concentrate on what they need if they can leave their children somewhere safe – so long as they can always see each other, our space works well. The little boy on the chair did come round a little, and when his mum came back he snuggled into her and he cheered up. When I asked if he was ok, she gave a tired smile, and nodded. The suffering and bravery of these families overwhelms me sometimes. I smiled and back and busied myself with something to keep the tears back. This woman and her little boy don’t need our tears. They needed to know our government’s plans for them. A lot of the Afghan women have been through so much, you can tell, but often they are so quiet, bearing it all in near-silence. It breaks my heart, but I try to be as welcoming as possible, and help them choose clothes for themselves or their children. Sometimes they open up. That same day I had a long conversation about winter coats with one lady – we stood there talking about the kinds we preferred, and I helped her choose something that she liked, and she seemed really pleased with it. It felt good to have helped her. Small kindnesses can go a long way, sometimes; I try to imagine the pain of the women, men and children, and do what I can to let them know that decent people here are on their side. &#8211; J, Care4Calais volunteer, London Care4Calais will need a lot of warm coats for refugees this winter. If you can help, please go here<\/p>\n","protected":false},"author":21,"featured_media":33004,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[153,154,68,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32842"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32842"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32842\/revisions"}],"predecessor-version":[{"id":33003,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32842\/revisions\/33003"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33004"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32842"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32842"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32842"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}