{"id":32850,"date":"2021-10-27T18:36:17","date_gmt":"2021-10-27T18:36:17","guid":{"rendered":"https:\/\/care4calais.org\/?p=32850"},"modified":"2021-11-10T12:15:44","modified_gmt":"2021-11-10T12:15:44","slug":"another-tragic-incident-on-the-uk-border","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/another-tragic-incident-on-the-uk-border\/","title":{"rendered":"Another tragic incident on the UK border"},"content":{"rendered":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<p dir=\"auto\">As the weekend ended, somewhere on the coast of northern France, three Somalian refugees climbed into a small dinghy and set off to cross the English Channel.<\/p>\n<\/div>\n<p dir=\"auto\">Their boat was notably smaller than dinghies often seen being used to cross the channel, and was certainly not suitable for one of the world’s busiest shipping lanes.<\/p>\n<p dir=\"auto\">The men will most likely have been aiming for the Kent coast, but the tides bore their tiny vessel far off course, out beyond the eastern tip of Kent. Around midday they would have been drifting on past the mouth of the Thames and on past Southend.<\/p>\n<p dir=\"auto\">The fear they must have felt is unimaginable. Four thousand miles they had come looking for safety, across two continents, with unknown suffering along the way. And for want of a sensible way of asking the people of the United Kingdom for help, they had ended up here: lost and adrift in the cold North Sea in a tiny inflatable boat.<\/p>\n<p dir=\"auto\">By mid-afternoon the little boat, now halfway across an 80-mile stretch of water between Harwich in Essex and Belgium, had begun to sink. Around 3 o clock they were spotted by the UK coastguards, who triggered the alarm, and three lifeboats, together with coastguard and Border Force vessels, sped out to them.<\/p>\n<p dir=\"auto\">The boat was by partly under water, and only two men were left with it. The third was missing.<\/p>\n<p dir=\"auto\">As Border Force took two recovered refugees back to shore, coastguards used boats, helicopter and plane, with lifeboats helping, to search into the evening and through the night for the missing man. It was hopeless; by 2pm Tuesday the search was called off, and the man presumed to have drowned. The two rescued men were, according to the Home Office, being processed within UK immigration rules.<\/p>\n<p dir=\"auto\">These are the facts as we know them at this time.<\/p>\n<p dir=\"auto\">That we can only refer to him as “the man” is part of the wider tragedy here. This was not an anonymous individual, but a son, a person with a mum and dad and family and friends. Yet it’s possibke that those friends and family will not know that he has been lost; they could be among many Somalians reading the reports online, and wondering if it is their son or brother or father or friend.<\/p>\n<p dir=\"auto\">Shockingly, the Home Office’s statement on the accident came dangerously close to blaming the men themselves. There was no expression of sympathy for the man presumed to be lost, but thanks for “those who responded to this incident and who continue to work tirelessly to protect lives at sea whilst securing our border.”<\/p>\n<p dir=\"auto\">Fine, but was it really necessary to mention protecting the border? It seems unlikely that two men in a sinking dinghy presented much of a threat.<\/p>\n<p dir=\"auto\">The spokesperson added that the accident “was a reminder of the extreme dangers of crossing the Channel in small boats”, and said the Home Office “was determined to do everything we can to prevent people dying in the Channel.”<\/p>\n<p dir=\"auto\">It has been pointed out many times by many organisations that if the Government wants to do something to prevent these dangerous crossings, they need only put in place a sensible, modern system whereby refugees can apply for asylum in the UK without risking their lives.<\/p>\n<p dir=\"auto\">In the light of the second death of a refugee on the UK-French border in four days, the Government’s continuing refusal to implement such a system looks not only perverse, but almost malevolent.<\/p>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<p dir=\"auto\">And with every incident like this, it becomes clearer that this refusal will condemn more people to this awful, unthinkable suffering, when all they were looking for was safety.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>As the weekend ended, somewhere on the coast of northern France, three Somalian refugees climbed into a small dinghy and set off to cross the English Channel. Their boat was notably smaller than dinghies often seen being used to cross the channel, and was certainly not suitable for one of the world’s busiest shipping lanes. The men will most likely have been aiming for the Kent coast, but the tides bore their tiny vessel far off course, out beyond the eastern tip of Kent. Around midday they would have been drifting on past the mouth of the Thames and on past Southend. The fear they must have felt is unimaginable. Four thousand miles they had come looking for safety, across two continents, with unknown suffering along the way. And for want of a sensible way of asking the people of the United Kingdom for help, they had ended up here: lost and adrift in the cold North Sea in a tiny inflatable boat. By mid-afternoon the little boat, now halfway across an 80-mile stretch of water between Harwich in Essex and Belgium, had begun to sink. Around 3 o clock they were spotted by the UK coastguards, who triggered the alarm, and three lifeboats, together with coastguard and Border Force vessels, sped out to them. The boat was by partly under water, and only two men were left with it. The third was missing. As Border Force took two recovered refugees back to shore, coastguards used boats, helicopter and plane, with lifeboats helping, to search into the evening and through the night for the missing man. It was hopeless; by 2pm Tuesday the search was called off, and the man presumed to have drowned. The two rescued men were, according to the Home Office, being processed within UK immigration rules. These are the facts as we know them at this time. That we can only refer to him as “the man” is part of the wider tragedy here. This was not an anonymous individual, but a son, a person with a mum and dad and family and friends. Yet it’s possibke that those friends and family will not know that he has been lost; they could be among many Somalians reading the reports online, and wondering if it is their son or brother or father or friend. Shockingly, the Home Office’s statement on the accident came dangerously close to blaming the men themselves. There was no expression of sympathy for the man presumed to be lost, but thanks for “those who responded to this incident and who continue to work tirelessly to protect lives at sea whilst securing our border.” Fine, but was it really necessary to mention protecting the border? It seems unlikely that two men in a sinking dinghy presented much of a threat. The spokesperson added that the accident “was a reminder of the extreme dangers of crossing the Channel in small boats”, and said the Home Office “was determined to do everything we can to prevent people dying in the Channel.” It has been pointed out many times by many organisations that if the Government wants to do something to prevent these dangerous crossings, they need only put in place a sensible, modern system whereby refugees can apply for asylum in the UK without risking their lives. In the light of the second death of a refugee on the UK-French border in four days, the Government’s continuing refusal to implement such a system looks not only perverse, but almost malevolent. And with every incident like this, it becomes clearer that this refusal will condemn more people to this awful, unthinkable suffering, when all they were looking for was safety.<\/p>\n","protected":false},"author":21,"featured_media":33001,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[155,156,123,75,104,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32850"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32850"}],"version-history":[{"count":5,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32850\/revisions"}],"predecessor-version":[{"id":33002,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32850\/revisions\/33002"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33001"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32850"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32850"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32850"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}