{"id":32930,"date":"2021-11-04T18:31:21","date_gmt":"2021-11-04T18:31:21","guid":{"rendered":"https:\/\/care4calais.org\/?p=32930"},"modified":"2021-11-10T11:57:01","modified_gmt":"2021-11-10T11:57:01","slug":"yet-another-refugee-death-on-the-border","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/yet-another-refugee-death-on-the-border\/","title":{"rendered":"Yet another refugee death on the border"},"content":{"rendered":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Yesterday, yet another refugee died and one went missing as they tried to cross the English Channel.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Shockingly, you would have to study the news closely to even know this; it seems that such an event becoming more common makes it mundane rather more horrific.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">We understand that yesterday one particularly overloaded little vessel set off from Dunkirk.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">It occupants were frightened people, hoping to find safety in the United Kingdom; one of them, a 30-year-old man, would die before reaching any dry land.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">The boat not gone far from the shore when, perhaps catching a forceful wave, it was capsized, throwing the refugees inside into the sea. The French rescue services rushed out and managed to save most of them, but one was unconscious as he was pulled from the water, and could not be revived. He was declared dead when his body was brought back to dry land.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Meanwhile, elsewhere in the Channel that morning, the captain of the Isle of Inishmore, a ferry operating between Dover-Calais route, spotted a dinghy along his route. The dinghy, carrying 13 refugees, had run out of fuel. Despite the efforts of a man paddling furiously, it was sinking.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Acting with humanity, the captain stopped the ferry, and the crew threw down a rope to the dinghy so the occuptants could pull themselves alongside and be rescued.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">The terror and then relief of the people in the boat can only be be guessed at. Some people who have made the crossing by small boat mention the terrible fear of being caught up in the swell of a ferry, and dragged into the propellors beneath.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">As the day wore on, another boat got into trouble in the waters off Calais, and one man who fell into the sea went missing. The search for him continued through the night into Wednesday.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">This latest death and carnage on the French-UK border comes less than a week after a man was lost off the coast of Essex, and one might well ask why it does not prompt more regret and shame on the part of the authorities. As has been said many times, it is caused directly by UK government policy, and could easily be ended by the introduction of fair, sensible asylum system allowing refugees safe passage.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">As we said, the real shock is perhaps the lack of interest shown in some parts of the media. It is perhaps time for reporters to stop &#8220;explaining&#8221; that the increase in attempted crossings being due to good weather. This unintentionally gives the impression that refugees set off from France on a jolly day out; it is not a question of pleasure, but only of choosing a time when there is marginally smaller risk of death.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Alas, for at least one young man this week, that risk was not small enough.<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday, yet another refugee died and one went missing as they tried to cross the English Channel. Shockingly, you would have to study the news closely to even know this; it seems that such an event becoming more common makes it mundane rather more horrific. We understand that yesterday one particularly overloaded little vessel set off from Dunkirk. It occupants were frightened people, hoping to find safety in the United Kingdom; one of them, a 30-year-old man, would die before reaching any dry land. The boat not gone far from the shore when, perhaps catching a forceful wave, it was capsized, throwing the refugees inside into the sea. The French rescue services rushed out and managed to save most of them, but one was unconscious as he was pulled from the water, and could not be revived. He was declared dead when his body was brought back to dry land. Meanwhile, elsewhere in the Channel that morning, the captain of the Isle of Inishmore, a ferry operating between Dover-Calais route, spotted a dinghy along his route. The dinghy, carrying 13 refugees, had run out of fuel. Despite the efforts of a man paddling furiously, it was sinking. Acting with humanity, the captain stopped the ferry, and the crew threw down a rope to the dinghy so the occuptants could pull themselves alongside and be rescued. The terror and then relief of the people in the boat can only be be guessed at. Some people who have made the crossing by small boat mention the terrible fear of being caught up in the swell of a ferry, and dragged into the propellors beneath. As the day wore on, another boat got into trouble in the waters off Calais, and one man who fell into the sea went missing. The search for him continued through the night into Wednesday. This latest death and carnage on the French-UK border comes less than a week after a man was lost off the coast of Essex, and one might well ask why it does not prompt more regret and shame on the part of the authorities. As has been said many times, it is caused directly by UK government policy, and could easily be ended by the introduction of fair, sensible asylum system allowing refugees safe passage. As we said, the real shock is perhaps the lack of interest shown in some parts of the media. It is perhaps time for reporters to stop &#8220;explaining&#8221; that the increase in attempted crossings being due to good weather. This unintentionally gives the impression that refugees set off from France on a jolly day out; it is not a question of pleasure, but only of choosing a time when there is marginally smaller risk of death. Alas, for at least one young man this week, that risk was not small enough.<\/p>\n","protected":false},"author":21,"featured_media":32994,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32930"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32930"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32930\/revisions"}],"predecessor-version":[{"id":32932,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32930\/revisions\/32932"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/32994"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32930"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32930"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32930"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}