{"id":32949,"date":"2021-11-06T17:41:55","date_gmt":"2021-11-06T17:41:55","guid":{"rendered":"https:\/\/care4calais.org\/?p=32949"},"modified":"2021-11-11T08:25:07","modified_gmt":"2021-11-11T08:25:07","slug":"hassouns-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/hassouns-story\/","title":{"rendered":"Hassoun&#8217;s story"},"content":{"rendered":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">Being a refugee in Calais has shocked me. I don’t understand why some people here hate us so much. I didn’t expect the people here to be like this, chasing us away and shouting horrible things at us. The police are the worst – it’s almost like they are the Janjaweed militia I was running away from.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">My name is Hassoun. I’m 21 and I live in an area of Calais they call Old Lidl. I’m just trying to get to the UK to join my uncle and cousins who are there.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">It’s mostly Sudanese where I live and, as we have no money, it’s very hard for us to get across to the UK. The only chance we have is to try to get on a truck.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I was born in Sudan, but I left there a long time ago now. My father died when I was young, and my mum took me back to Chad where she was from. I grew up in Chad, but really it was no better than Sudan. The Janjaweed are also there, and is so dangerous for small people from villages. The Janjaweed burn and destroy the villages, and take the young men by force.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I did not want to join them because I don’t want to kill my people for no reason. So I left when I was 18 to escape them.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">My uncle and cousins had been in the UK for six years so I decided to try to join them. In Africa family is everything and we stay close all our lives. It wouldn’t have mattered where my family was, I would travel to join them. They happen to be in England, so I will join them there.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I have been in Calais four months now, and it’s hard with the hostility. We really are not doing any harm, just passing through. In Sudan we treat travellers with respect; we offer them food and shelter, and we always share what we have with a stranger, however little we have.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">The police here are the worst. I wonder what happened to them as a child to make them behave like this? They destroy the only shelter we have, and kick and stamp on our possessions. Those few possession are all we have; to them they may be nothing but to us they are is everything. When it is cold and wet and they have taken everything that keeps us dry and warm, don’t they care?<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">We really like to cook our own food, and sometimes from Care4Calais we get flour and beans and some wood to make a fire. But if the police find it they kick the flour into the dirt and pour the oil on the ground so we cannot use them. It is very hard to get flour and oil as we have no money to buy it ourselves, so it is really upsetting when this happens.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Some of the police are really bad. They seem to enjoy what they do so much. Just like some of the Janjaweed liked destroying our crops.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Yasser, who died after being hit by a lorry here in October, was my friend. He was just trying to cross – he didn’t need to die that way. He didn’t want to harm anyone, just have a chance of a life, like everyone wants. All we need is a safe way to pass. We would be happy to do it right, but the boats are too expensive so you have to try for the lorries.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">But sometimes even the lorry drivers try to hurt us. They play on the brakes, stopping and starting suddenly, and playing with the wheel. It’s so dangerous, and they don’t need to do it. If they see me get on the lorry, all they need to do is stop, and I will get off.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">When I got here I found Care4Calais, who always need people to help them interpret and do other work for them. I help them myself with translating now.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">They help us and make us feel better, but of course I do miss my home. I miss the culture of family gatherings, with everyone sitting down to eat or to visit on the weekend. Just talking and drinking, eating something and maybe playing traditional board games or football. Of course I love football.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">But most of all I miss my mum. I miss hearing her voice. I don’t know if I will ever see her again.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">But I am still determined to make a new life.<\/div>\n<\/div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl py34i1dx gpro0wi8\" tabindex=\"0\" role=\"link\" href=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2FCare4Calais.org%2F%3Ffbclid%3DIwAR3YJzcNJJKQyBeQSXAUrHu01nCdaDvCXQewPPFsNpYjJnMSM4X78GhJ6bI&amp;h=AT0NGTo77E9L-WXZO-3-LKoAm8s6aF-ATmNcY1nECPF3H8QHalf0eyTJIWB3dis5o4ADqWav_1utCiX-2gJkVCdr6RmukE7R4TrsrBF872PQ3m9N32ohFVCwUzo0FrlEc8d9gfttRY5QskGUl_zr-8g&amp;__tn__=-UK-R&amp;c[0]=AT0hxhJvpMJcnkFEul56DedK3f_w__r8y21TnAxvSBGKVY3Mdio-25xsHQQ0Vuahxbbp7SBTWq6SX6i6tXtX9Idilgy2bR3ojWg5QIKuWk0FBVfZPen0Udlale6X7mVukXpC-CzzuFNXJQcVu3HxMgknWqy6YLDUbRbVp2bQGeX0_MrOJfM9NzEPJ8GrB5wmcTmTqmDY\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Being a refugee in Calais has shocked me. I don’t understand why some people here hate us so much. I didn’t expect the people here to be like this, chasing us away and shouting horrible things at us. The police are the worst – it’s almost like they are the Janjaweed militia I was running away from. My name is Hassoun. I’m 21 and I live in an area of Calais they call Old Lidl. I’m just trying to get to the UK to join my uncle and cousins who are there. It’s mostly Sudanese where I live and, as we have no money, it’s very hard for us to get across to the UK. The only chance we have is to try to get on a truck. I was born in Sudan, but I left there a long time ago now. My father died when I was young, and my mum took me back to Chad where she was from. I grew up in Chad, but really it was no better than Sudan. The Janjaweed are also there, and is so dangerous for small people from villages. The Janjaweed burn and destroy the villages, and take the young men by force. I did not want to join them because I don’t want to kill my people for no reason. So I left when I was 18 to escape them. My uncle and cousins had been in the UK for six years so I decided to try to join them. In Africa family is everything and we stay close all our lives. It wouldn’t have mattered where my family was, I would travel to join them. They happen to be in England, so I will join them there. I have been in Calais four months now, and it’s hard with the hostility. We really are not doing any harm, just passing through. In Sudan we treat travellers with respect; we offer them food and shelter, and we always share what we have with a stranger, however little we have. The police here are the worst. I wonder what happened to them as a child to make them behave like this? They destroy the only shelter we have, and kick and stamp on our possessions. Those few possession are all we have; to them they may be nothing but to us they are is everything. When it is cold and wet and they have taken everything that keeps us dry and warm, don’t they care? We really like to cook our own food, and sometimes from Care4Calais we get flour and beans and some wood to make a fire. But if the police find it they kick the flour into the dirt and pour the oil on the ground so we cannot use them. It is very hard to get flour and oil as we have no money to buy it ourselves, so it is really upsetting when this happens. Some of the police are really bad. They seem to enjoy what they do so much. Just like some of the Janjaweed liked destroying our crops. Yasser, who died after being hit by a lorry here in October, was my friend. He was just trying to cross – he didn’t need to die that way. He didn’t want to harm anyone, just have a chance of a life, like everyone wants. All we need is a safe way to pass. We would be happy to do it right, but the boats are too expensive so you have to try for the lorries. But sometimes even the lorry drivers try to hurt us. They play on the brakes, stopping and starting suddenly, and playing with the wheel. It’s so dangerous, and they don’t need to do it. If they see me get on the lorry, all they need to do is stop, and I will get off. When I got here I found Care4Calais, who always need people to help them interpret and do other work for them. I help them myself with translating now. They help us and make us feel better, but of course I do miss my home. I miss the culture of family gatherings, with everyone sitting down to eat or to visit on the weekend. Just talking and drinking, eating something and maybe playing traditional board games or football. Of course I love football. But most of all I miss my mum. I miss hearing her voice. I don’t know if I will ever see her again. But I am still determined to make a new life. To volunteer or donate go to Care4Calais.org<\/p>\n","protected":false},"author":21,"featured_media":33115,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[22,104],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32949"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32949"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32949\/revisions"}],"predecessor-version":[{"id":32951,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32949\/revisions\/32951"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33115"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32949"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32949"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32949"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}