{"id":32971,"date":"2021-11-08T18:17:47","date_gmt":"2021-11-08T18:17:47","guid":{"rendered":"https:\/\/care4calais.org\/?p=32971"},"modified":"2023-02-08T17:04:57","modified_gmt":"2023-02-08T16:04:57","slug":"how-we-made-a-true-community","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/how-we-made-a-true-community\/","title":{"rendered":"Refugees and volunteers together: a true community"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Before the Taliban picked on him, Abas had a good, happy life in Afghanistan. In his late-twenties, he had a loving family and a good job working in international trade.<\/p>\n<p>Then one day, the Taliban got wind of his relationship with the West, they called him an infidel, told him he should give up his job, when he refused, they came to his house to kill him.<\/p>\n<p>“I had to escape through the neighbour’s house” he remembers. “I ran to the house of a family friend and with their help I managed to escape over the border to Iran”<\/p>\n<p>After that came a horrific, year-long nightmare. He was marched over mountains, held in makeshift cells along the way, and smuggled around Europe, with the constant threat of violence. By the time he made it to the UK Abas was stricken with PTSD and afraid to speak to anyone in case they were connected to the Taliban.<\/p>\n<p>He was put in a hotel while he waited for his interview, and he began seeing doctors. And he didn’t speak to anyone, or leave his hotel.<\/p>\n<p>And then, a few months ago he was transferred elsewhere in the UK. Through our network he was connected to the Care 4 Calais closest to his new home, the volunteers there invited him to play football; he came, met another guy from Afghanistan, and talked to some other refugees and volunteers in the group.<\/p>\n<p>Those refugees and volunteers instinctively realised he needed support and friendship to rebuild his trust in people. As a member, I’ve watched Abas grow in confidence as he’s begun coming to our meetings, and playing football. When Little Amal came to St Pauls Cathedral, our group had to provide four flag-bearers.<\/p>\n<p>Three of our refugees volunteered straight away, and with lots of love and encouragement we persuaded him to be the fourth. Abas agreed. His presence on the Millennium Bridge that day was a symbol of what kindness and support and community can do.<\/p>\n<p>I say community because that’s what our Care4Calais group really is. We’re friends, and we trust each other, and you can’t underestimate how important that is for refugees, because so many of them have been deceived and victimised. Over the last few weeks the famous photographer Frédéric Aranda has been photographing our group. These are some of his pictures are here.<\/p>\n<p>I love the way the photographs capture the warmth and friendship between the people. You can see it in the playing around at the phone boxes &#8211; something vitally important, because just playing around is a massive part of being human, and so many of our refugees have had their basic humanity eaten away by the experiences at home, and then in our immigration system.<\/p>\n<p>We may all be from all over the world, but somehow that pulls us together.. As one of our residents said earlier we&#8217;re just people from all over the world coming together to make each others lives better. I think our community is as strong as any you’ll find anywhere &#8211; and I think Abas would agree.<\/p>\n<p>(Abas is not in the images here)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Before the Taliban picked on him, Abas had a good, happy life in Afghanistan. In his late-twenties, he had a loving family and a good job working in international trade. Then one day, the Taliban got wind of his relationship with the West, they called him an infidel, told him he should give up his job, when he refused, they came to his house to kill him. “I had to escape through the neighbour’s house” he remembers. “I ran to the house of a family friend and with their help I managed to escape over the border to Iran” After that came a horrific, year-long nightmare. He was marched over mountains, held in makeshift cells along the way, and smuggled around Europe, with the constant threat of violence. By the time he made it to the UK Abas was stricken with PTSD and afraid to speak to anyone in case they were connected to the Taliban. He was put in a hotel while he waited for his interview, and he began seeing doctors. And he didn’t speak to anyone, or leave his hotel. And then, a few months ago he was transferred elsewhere in the UK. Through our network he was connected to the Care 4 Calais closest to his new home, the volunteers there invited him to play football; he came, met another guy from Afghanistan, and talked to some other refugees and volunteers in the group. Those refugees and volunteers instinctively realised he needed support and friendship to rebuild his trust in people. As a member, I’ve watched Abas grow in confidence as he’s begun coming to our meetings, and playing football. When Little Amal came to St Pauls Cathedral, our group had to provide four flag-bearers. Three of our refugees volunteered straight away, and with lots of love and encouragement we persuaded him to be the fourth. Abas agreed. His presence on the Millennium Bridge that day was a symbol of what kindness and support and community can do. I say community because that’s what our Care4Calais group really is. We’re friends, and we trust each other, and you can’t underestimate how important that is for refugees, because so many of them have been deceived and victimised. Over the last few weeks the famous photographer Frédéric Aranda has been photographing our group. These are some of his pictures are here. I love the way the photographs capture the warmth and friendship between the people. You can see it in the playing around at the phone boxes &#8211; something vitally important, because just playing around is a massive part of being human, and so many of our refugees have had their basic humanity eaten away by the experiences at home, and then in our immigration system. We may all be from all over the world, but somehow that pulls us together.. As one of our residents said earlier we&#8217;re just people from all over the world coming together to make each others lives better. I think our community is as strong as any you’ll find anywhere &#8211; and I think Abas would agree. (Abas is not in the images here)<\/p>\n","protected":false},"author":21,"featured_media":32991,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32971"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=32971"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32971\/revisions"}],"predecessor-version":[{"id":32975,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/32971\/revisions\/32975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/32991"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=32971"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=32971"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=32971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}