{"id":33112,"date":"2021-11-11T08:17:16","date_gmt":"2021-11-11T08:17:16","guid":{"rendered":"https:\/\/care4calais.org\/?p=33112"},"modified":"2021-11-11T08:17:16","modified_gmt":"2021-11-11T08:17:16","slug":"anguish-on-the-polish-border","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/anguish-on-the-polish-border\/","title":{"rendered":"Anguish on the Polish border"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Fatemah and her family are Iraqi refugees, likely to be killed if they return to Iraq; to make things even worse, Fatemah herself has a medical condition requiring attention.<\/p>\n<p>A few weeks ago, she and her husband Aras saw an ad for package holidays to Belarus that included visas that allowed you to visit the EU; thinking they could use the visa to claim asylum in Poland, they bought places for Fatemah, their two young children, and Fatemah’s father. Her husband stayed behind in Dubai, planning to join them later.<\/p>\n<p>Once in Belarus, Fatemah, her dad and two children headed for the Polish border near the town of Bialowieza – only to find there were hundreds of other refugees like them doing the same thing. They had been duped. The visas were bogus.<\/p>\n<p>They tried to cross, but found themselves in the nightmare now being seen in the media: armed Belorussian troops behind them forcing them on, armed Polish troops on the other side of the barbed wire in front threatening them. In the terror and panic, Fatemah and her young daughter (shown in the picture) were separated from her father and her son.<\/p>\n<p>They couldn’t find each other, but in her desperation Fatemah did find a people smuggler, who said they could get her and her daughter to Germany. Knowing she couldn’t even look after daughter if she herself didn’t get seen by a doctor, and thinking she could try to track down her dad later, she agreed to pay.<\/p>\n<p>It ought to have been the beginning of the end of the story. In fact it was only the beginning.<\/p>\n<p>Once over the border, the smuggler kidnapped her and her daughter, and demanded a ransom of €9000 from Aras in Dubai. Utterly distraught, he found the money and paid. The smuggler responded by telling him they wanted another €20,000.<\/p>\n<p>It was at this point that Aras got in touch with me. I’m Polish and work for Care4Calais in London, and have been trying to help a lot of people stuck on the border in the last few days. It’s utterly, utterly horrific there.<\/p>\n<p>I called the police in Poland. Eventually, as I had names, telephone numbers and a location, they were able to track down the smugglers. When I called them later that night, the police told me that they had been found, and in fact eleven refugees in total had been kidnapped. They couldn’t tell me more but told me to call back the next day so they could update me on Fatemah and her son’s location, and get them in touch with Aras.<\/p>\n<p>The next day I called. There was no reply. I tried and tried and tried, and eventually got through to a new policeman who told me he had no idea what I was talking about, and couldn’t help me. I gave him all the details, and said the whole story was in an email chain that he could find.<\/p>\n<p>“I get hundreds of emails,” he said. “How do you expect me to find yours?”<\/p>\n<p>Thinking of this poor, agonised family, I begged for help. In the end I was told only that they had been returned to the border.<\/p>\n<p>According to reports more than 1,000 refugees have been escorted to the border and are now stuck there between Belarusian and Polish troops. Some have tried to break through the fence to Poland and been violently driven back. Poland, the EU, and Nato blame Belarus for deliberately causing the crisis by allowing people seeking to come to the EU from Africa and the Middle East to travel to Minsk, then transporting them to the border with Poland.<\/p>\n<p>To think of the family there in the chaos and violence is completely heart-rending; it seems impossible that human beings can have so little compassion for one another.<\/p>\n<p>I have asked the UN refugee agency if they can help, but while they will try, they have told me that the probability of locating Fatemah and her daughter “are extremely low in such a fast evolving and dangerous situation.”<\/p>\n<p>It is distressing beyond words.<\/p>\n<p>If nothing else, we need to tell people that the refugees on the border are victims of some horrific game, and desperately deserving of help. And they have a right to enter Poland as refugees. Please pledge to point this out to everyone you talk to as this situation escalates.<\/p>\n<p>As word has gotten round that I am Polish I am getting more and more calls like this. My heart is breaking with every new request for help, as I know there are so many people who don’t even have a chance to share it and be heard. I am documenting all the cases I hear of and sending them to UNHCR. If you have time, you can tweet @UNHCRPoland and say “Please help refugees at the Poland-Belarus border.”<\/p>\n<p>Julita, Care4Calais<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Fatemah and her family are Iraqi refugees, likely to be killed if they return to Iraq; to make things even worse, Fatemah herself has a medical condition requiring attention. A few weeks ago, she and her husband Aras saw an ad for package holidays to Belarus that included visas that allowed you to visit the EU; thinking they could use the visa to claim asylum in Poland, they bought places for Fatemah, their two young children, and Fatemah’s father. Her husband stayed behind in Dubai, planning to join them later. Once in Belarus, Fatemah, her dad and two children headed for the Polish border near the town of Bialowieza – only to find there were hundreds of other refugees like them doing the same thing. They had been duped. The visas were bogus. They tried to cross, but found themselves in the nightmare now being seen in the media: armed Belorussian troops behind them forcing them on, armed Polish troops on the other side of the barbed wire in front threatening them. In the terror and panic, Fatemah and her young daughter (shown in the picture) were separated from her father and her son. They couldn’t find each other, but in her desperation Fatemah did find a people smuggler, who said they could get her and her daughter to Germany. Knowing she couldn’t even look after daughter if she herself didn’t get seen by a doctor, and thinking she could try to track down her dad later, she agreed to pay. It ought to have been the beginning of the end of the story. In fact it was only the beginning. Once over the border, the smuggler kidnapped her and her daughter, and demanded a ransom of €9000 from Aras in Dubai. Utterly distraught, he found the money and paid. The smuggler responded by telling him they wanted another €20,000. It was at this point that Aras got in touch with me. I’m Polish and work for Care4Calais in London, and have been trying to help a lot of people stuck on the border in the last few days. It’s utterly, utterly horrific there. I called the police in Poland. Eventually, as I had names, telephone numbers and a location, they were able to track down the smugglers. When I called them later that night, the police told me that they had been found, and in fact eleven refugees in total had been kidnapped. They couldn’t tell me more but told me to call back the next day so they could update me on Fatemah and her son’s location, and get them in touch with Aras. The next day I called. There was no reply. I tried and tried and tried, and eventually got through to a new policeman who told me he had no idea what I was talking about, and couldn’t help me. I gave him all the details, and said the whole story was in an email chain that he could find. “I get hundreds of emails,” he said. “How do you expect me to find yours?” Thinking of this poor, agonised family, I begged for help. In the end I was told only that they had been returned to the border. According to reports more than 1,000 refugees have been escorted to the border and are now stuck there between Belarusian and Polish troops. Some have tried to break through the fence to Poland and been violently driven back. Poland, the EU, and Nato blame Belarus for deliberately causing the crisis by allowing people seeking to come to the EU from Africa and the Middle East to travel to Minsk, then transporting them to the border with Poland. To think of the family there in the chaos and violence is completely heart-rending; it seems impossible that human beings can have so little compassion for one another. I have asked the UN refugee agency if they can help, but while they will try, they have told me that the probability of locating Fatemah and her daughter “are extremely low in such a fast evolving and dangerous situation.” It is distressing beyond words. If nothing else, we need to tell people that the refugees on the border are victims of some horrific game, and desperately deserving of help. And they have a right to enter Poland as refugees. Please pledge to point this out to everyone you talk to as this situation escalates. As word has gotten round that I am Polish I am getting more and more calls like this. My heart is breaking with every new request for help, as I know there are so many people who don’t even have a chance to share it and be heard. I am documenting all the cases I hear of and sending them to UNHCR. If you have time, you can tweet @UNHCRPoland and say “Please help refugees at the Poland-Belarus border.” Julita, Care4Calais<\/p>\n","protected":false},"author":21,"featured_media":33113,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[159,150,158,104,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33112"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33112"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33112\/revisions"}],"predecessor-version":[{"id":33114,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33112\/revisions\/33114"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33113"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33112"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33112"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33112"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}