{"id":33161,"date":"2021-11-16T07:59:57","date_gmt":"2021-11-16T07:59:57","guid":{"rendered":"https:\/\/care4calais.org\/?p=33161"},"modified":"2021-11-16T07:59:57","modified_gmt":"2021-11-16T07:59:57","slug":"feys-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/feys-story\/","title":{"rendered":"Fey&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>TW: r*pe, mental illness<\/p>\n<p><span style=\"font-weight: 400;\">I think I have always known I was born in the wrong body. When I was little I loved all the ‘My Little Pony’ and She-ra Princess of the Universe stuff and wanted to dress like a girl and didn’t like “boys things”. As I got older I wanted to express myself more and just be me, but in Kuwait that is not possible. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are laws there that even prosecute you for just imitating another gender, never mind living as one. That meant I had to suppress who I was and how I wanted to be and dress most of the time. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I had a job working in a bank, but life got so hard. I felt it wasn’t worth living if I couldn’t be me, and I decided I had to escape.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Leaving everything behind, I went to England. I’d been for holidays there as a child for holidays, I spoke good English, and I knew UK law would allow me to live as whatever gender I chose – so it was the natural place. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But getting there was the easy part. Because claiming asylum on LGBTQ grounds is incredibly tough. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I arrived 14 months ago during the pandemic, and I was put in a hotel which was isolating. I didn’t meet many English people to begin with because of COVID, but those I did meet were really nice to me. They didn’t even ask why I dressed or acted like I did, they just liked me as I was. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I did have some problems with some of the other people in the hotel – some of them were from countries where being gay or transgender is still a crime, and they were pretty horrible to me. I think they just didn’t know any better yet.*<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So I was very lonely and I got so depressed and I had panic attacks sometimes twice a day that I was pretty much suicidal. But then I found Ged, from Care4Calais’ Access Team.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can contact the Access team if you had a problem with your asylum claim, and they will help you.  They put me in touch with Ged, and then a guy called Tristan from the Legal team, and they were both amazingly kind and helpful.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Tristan found me a fantastic lawyer, but he also answered my questions, supported me with psychological help, and became my friend. It was him who helped me become psychologically strong to get through my interview and prepare my case. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If it hadn’t been for them, I genuinely doubt I’d still be here.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">My asylum interview was nerve-racking, eight hours of questions looking for weaknesses in my story. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I don’t know why they kept on asking how did I know I was a transgender or how it started. It’s like asking a cis person how did you know you belonged to your gender or when did you know you were male or female!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Saying I’d be safe living as a woman back in Kuwait. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When I was at the hotel, someone tried to rape me. He tried to get into my room. There were other guys who told me that in the Quran and the Bible I am cursed forever in hell and I am an infidel. Some guys bullied me and said so many awful things to me that made my life really miserable and even worse. I had been depressed and having panic attacks even before this; now things were just horrific for me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I talked to someone from Refugee Action, who helped me find a flat for me where I could be on my own and safe, and I’m grateful for them for that.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">And then, gradually, with Tristan and Ged’s support, I reached a turning point in my life.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Enough was enough. No, I was not going to hide in my room. No, I wasn’t going to stay there, cry and panic anymore. I did not leave my country and family to be afraid and scared of bullies here too. I was going to be emotionally strong, and live my life as I wanted to. I was going to fight for myself.. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">And no one was going to intimidate me or hurt me again.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Since then I have far fewer anxiety attacks, and felt much better in myself. I’ve started looking to the future now.  I really like helping people so I would love to study nursing and become one. If not, I&#8217;d like to work as an interpreter or just find some job where I can help people. Right now, I am helping Care4Calais and other organisations as an interpreter.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I do miss some things about Kuwait like the constant hot weather, the music, the food and the family gatherings at the weekend. My mum is still there  and is on her own, but I can talk to her often, and Kuwait is not so far way. I am hoping once I get my refugee status that she visits me. Being away from her and my siblings was heartbreaking especially that it’s against my will.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I am in Manchester now and I love it, it is so cosmopolitan! There’s so many things to do. I love the music and food and culture, and I feel like I belong here. I feel like I can be me. I’ve started using the right pronouns for my gender, and saying my name out loud. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">These are really big steps for me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The world is such an unsafe place for so many people. All over, there are wars and famine, hate and poverty. That means we all need to be kind, and take care of each other; that has to be the first step. That’s what Care4Calais’ Access Team, and the whole organisation does, and it’s why I thank them, and am pleased to work for them now as a volunteer myself.<\/span><\/p>\n<p>Fey<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; TW: r*pe, mental illness I think I have always known I was born in the wrong body. When I was little I loved all the ‘My Little Pony’ and She-ra Princess of the Universe stuff and wanted to dress like a girl and didn’t like “boys things”. As I got older I wanted to express myself more and just be me, but in Kuwait that is not possible.  There are laws there that even prosecute you for just imitating another gender, never mind living as one. That meant I had to suppress who I was and how I wanted to be and dress most of the time.  I had a job working in a bank, but life got so hard. I felt it wasn’t worth living if I couldn’t be me, and I decided I had to escape. Leaving everything behind, I went to England. I’d been for holidays there as a child for holidays, I spoke good English, and I knew UK law would allow me to live as whatever gender I chose – so it was the natural place.  But getting there was the easy part. Because claiming asylum on LGBTQ grounds is incredibly tough.  I arrived 14 months ago during the pandemic, and I was put in a hotel which was isolating. I didn’t meet many English people to begin with because of COVID, but those I did meet were really nice to me. They didn’t even ask why I dressed or acted like I did, they just liked me as I was.  I did have some problems with some of the other people in the hotel – some of them were from countries where being gay or transgender is still a crime, and they were pretty horrible to me. I think they just didn’t know any better yet.* So I was very lonely and I got so depressed and I had panic attacks sometimes twice a day that I was pretty much suicidal. But then I found Ged, from Care4Calais’ Access Team. You can contact the Access team if you had a problem with your asylum claim, and they will help you.  They put me in touch with Ged, and then a guy called Tristan from the Legal team, and they were both amazingly kind and helpful. Tristan found me a fantastic lawyer, but he also answered my questions, supported me with psychological help, and became my friend. It was him who helped me become psychologically strong to get through my interview and prepare my case.  If it hadn’t been for them, I genuinely doubt I’d still be here. My asylum interview was nerve-racking, eight hours of questions looking for weaknesses in my story.  I don’t know why they kept on asking how did I know I was a transgender or how it started. It’s like asking a cis person how did you know you belonged to your gender or when did you know you were male or female! Saying I’d be safe living as a woman back in Kuwait.  When I was at the hotel, someone tried to rape me. He tried to get into my room. There were other guys who told me that in the Quran and the Bible I am cursed forever in hell and I am an infidel. Some guys bullied me and said so many awful things to me that made my life really miserable and even worse. I had been depressed and having panic attacks even before this; now things were just horrific for me. I talked to someone from Refugee Action, who helped me find a flat for me where I could be on my own and safe, and I’m grateful for them for that. And then, gradually, with Tristan and Ged’s support, I reached a turning point in my life. Enough was enough. No, I was not going to hide in my room. No, I wasn’t going to stay there, cry and panic anymore. I did not leave my country and family to be afraid and scared of bullies here too. I was going to be emotionally strong, and live my life as I wanted to. I was going to fight for myself..  And no one was going to intimidate me or hurt me again. Since then I have far fewer anxiety attacks, and felt much better in myself. I’ve started looking to the future now.  I really like helping people so I would love to study nursing and become one. If not, I&#8217;d like to work as an interpreter or just find some job where I can help people. Right now, I am helping Care4Calais and other organisations as an interpreter. I do miss some things about Kuwait like the constant hot weather, the music, the food and the family gatherings at the weekend. My mum is still there  and is on her own, but I can talk to her often, and Kuwait is not so far way. I am hoping once I get my refugee status that she visits me. Being away from her and my siblings was heartbreaking especially that it’s against my will. I am in Manchester now and I love it, it is so cosmopolitan! There’s so many things to do. I love the music and food and culture, and I feel like I belong here. I feel like I can be me. I’ve started using the right pronouns for my gender, and saying my name out loud.  These are really big steps for me. The world is such an unsafe place for so many people. All over, there are wars and famine, hate and poverty. That means we all need to be kind, and take care of each other; that has to be the first step. That’s what Care4Calais’ Access Team, and the whole organisation does, and it’s why I thank them, and am pleased to work for them now as a volunteer myself. Fey &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":33162,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33161"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33161"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33161\/revisions"}],"predecessor-version":[{"id":33163,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33161\/revisions\/33163"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33162"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}