{"id":33172,"date":"2021-11-16T20:52:18","date_gmt":"2021-11-16T20:52:18","guid":{"rendered":"https:\/\/care4calais.org\/?p=33172"},"modified":"2023-02-08T17:04:43","modified_gmt":"2023-02-08T16:04:43","slug":"another-shocking-eviction-at-dunkirk","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/another-shocking-eviction-at-dunkirk\/","title":{"rendered":"Another shocking eviction at Dunkirk"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Today 300 French police brutally evicted hundreds of refugees, including many families with young children, from the camp in Dunkirk.<\/p>\n<p>Officers armed with riot shields surrounded the camp early on Tuesday morning. Surprised and alarmed, refugees had to pack their belongings hurriedly, fearful of tents being slashed and possessions taken.<\/p>\n<p>Between 1000 and 1500 people were estimated to be living in the Dunkirk camp. As we reported on Sunday, living conditions have become atrocious, with overcrowding worsening the muddy ground, and the lack of shelter exposing tents to the wind.<\/p>\n<p>Having endured life there, refugees were now bussed off with just about a hundred left. Care4Calais distributed tents to those people remaining.<\/p>\n<p>It makes our hearts heavy to post the pictures here showing the Dunkirk site before and after the eviction. They serve as a stark reminder of cruel evictions sweeping France.<\/p>\n<p>This truly was a surprise to us all. Not only are temperatures dropping, but the small amount of belongings these humans have – like their winter coats – have been lost, depriving them of protection against the cold.<\/p>\n<p>How inhumane.<\/p>\n<p>The eviction comes after two months when five refugees have died on the French-England border, and another five have gone missing while trying to cross the Channel. Less than two weeks ago, French police agreed to soften their treatment of refugees, persuading 72-year old French priest Philippe Demeestere to give up his hunger strike in protest at conditions in northern France.<\/p>\n<p>Meanwhile French and English politicians have bickered over responsibility for the Channel crossing attempts, using refugees as pawns rather than acknowledging their desperation.<\/p>\n<p>Looking at these images of Dunkirk, surely no one can doubt that desperation now. As winter approaches we are deeply concerned about conditions in France, but we are do all we can to help refugees cope.<\/p>\n<p>We will be distributing coats and other supplies to those affected. Please consider donating the coat of a winter coat via the link in our bio.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Today 300 French police brutally evicted hundreds of refugees, including many families with young children, from the camp in Dunkirk. Officers armed with riot shields surrounded the camp early on Tuesday morning. Surprised and alarmed, refugees had to pack their belongings hurriedly, fearful of tents being slashed and possessions taken. Between 1000 and 1500 people were estimated to be living in the Dunkirk camp. As we reported on Sunday, living conditions have become atrocious, with overcrowding worsening the muddy ground, and the lack of shelter exposing tents to the wind. Having endured life there, refugees were now bussed off with just about a hundred left. Care4Calais distributed tents to those people remaining. It makes our hearts heavy to post the pictures here showing the Dunkirk site before and after the eviction. They serve as a stark reminder of cruel evictions sweeping France. This truly was a surprise to us all. Not only are temperatures dropping, but the small amount of belongings these humans have – like their winter coats – have been lost, depriving them of protection against the cold. How inhumane. The eviction comes after two months when five refugees have died on the French-England border, and another five have gone missing while trying to cross the Channel. Less than two weeks ago, French police agreed to soften their treatment of refugees, persuading 72-year old French priest Philippe Demeestere to give up his hunger strike in protest at conditions in northern France. Meanwhile French and English politicians have bickered over responsibility for the Channel crossing attempts, using refugees as pawns rather than acknowledging their desperation. Looking at these images of Dunkirk, surely no one can doubt that desperation now. As winter approaches we are deeply concerned about conditions in France, but we are do all we can to help refugees cope. We will be distributing coats and other supplies to those affected. Please consider donating the coat of a winter coat via the link in our bio.<\/p>\n","protected":false},"author":21,"featured_media":33173,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,172,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33172"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33172"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33172\/revisions"}],"predecessor-version":[{"id":33174,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33172\/revisions\/33174"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33173"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33172"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33172"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33172"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}