{"id":33182,"date":"2021-11-17T18:03:56","date_gmt":"2021-11-17T18:03:56","guid":{"rendered":"https:\/\/care4calais.org\/?p=33182"},"modified":"2021-11-17T18:03:56","modified_gmt":"2021-11-17T18:03:56","slug":"paul-and-chiefs-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/paul-and-chiefs-story\/","title":{"rendered":"Paul and Chief&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Paul fled from Liberia to the UK in 2004, after his parents, brothers and sisters were killed in the second Liberian civil war.<\/p>\n<p>He had lived in London for five years, waiting on a decision on his asylum claim, when glaucoma in one eye began to damage his eyesight. Unfortunately, hospital treatments didn’t work, and then a problem with his other eye, has left him severely sight-impaired. He tries to stay active, but his eyesight is getting worse.<\/p>\n<p>The Home Office housed Paul in an east London hotel 14 months ago. At first he felt very depressed and isolated there, but then he discovered the Care4Calais group for refugees housed in the hotel; in particular he met a refugee from Nigeria known as “Chief”.<\/p>\n<p>Every Saturday the group went on a guided walk around London. Paul didn’t feel able to go because of his eyesight, but one morning Chief offered to guide him. Paul accepted, and as they walked around, they got along really well. Watching them, you can see Chief has a great, calm manner, and just seems to know what Paul needs when he needs it.<\/p>\n<p>The two of them have become close friends now, and you rarely see one without the other. “It was like having someone from your family to help,” Paul remembers. “But that’s what the group is like &#8211; a big family. Some of us have each other’s numbers so we can call and talk, sometimes people just come to take me out for a walk. The volunteers are like family too. Rosemary, one of them, calls me to see how I’m doing.<\/p>\n<p>“Because of Chief and the others I’m not depressed any more. I look forward to every Saturday.”<\/p>\n<p>Everyone at Care4Calais was delighted when after years of waiting, Paul recently got leave to remain; he can now start to rebuild his life.<\/p>\n<p>“Care4Calais groups can foster a small communities where refugees and volunteers build confidence and dignity,” says Rosemary. “Paul and Chief capture that. It makes me really happy and proud to be a volunteer.”<\/p>\n<p>We need more kindness like Chief and Paul’s in the world. If you can to help to support refugees, please get in touch with us at care4calais.org\/get-involved<\/p>\n<p>Picture @fredericaranda<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Paul fled from Liberia to the UK in 2004, after his parents, brothers and sisters were killed in the second Liberian civil war. He had lived in London for five years, waiting on a decision on his asylum claim, when glaucoma in one eye began to damage his eyesight. Unfortunately, hospital treatments didn’t work, and then a problem with his other eye, has left him severely sight-impaired. He tries to stay active, but his eyesight is getting worse. The Home Office housed Paul in an east London hotel 14 months ago. At first he felt very depressed and isolated there, but then he discovered the Care4Calais group for refugees housed in the hotel; in particular he met a refugee from Nigeria known as “Chief”. Every Saturday the group went on a guided walk around London. Paul didn’t feel able to go because of his eyesight, but one morning Chief offered to guide him. Paul accepted, and as they walked around, they got along really well. Watching them, you can see Chief has a great, calm manner, and just seems to know what Paul needs when he needs it. The two of them have become close friends now, and you rarely see one without the other. “It was like having someone from your family to help,” Paul remembers. “But that’s what the group is like &#8211; a big family. Some of us have each other’s numbers so we can call and talk, sometimes people just come to take me out for a walk. The volunteers are like family too. Rosemary, one of them, calls me to see how I’m doing. “Because of Chief and the others I’m not depressed any more. I look forward to every Saturday.” Everyone at Care4Calais was delighted when after years of waiting, Paul recently got leave to remain; he can now start to rebuild his life. “Care4Calais groups can foster a small communities where refugees and volunteers build confidence and dignity,” says Rosemary. “Paul and Chief capture that. It makes me really happy and proud to be a volunteer.” We need more kindness like Chief and Paul’s in the world. If you can to help to support refugees, please get in touch with us at care4calais.org\/get-involved Picture @fredericaranda &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":33183,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[104,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33182"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33182"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33182\/revisions"}],"predecessor-version":[{"id":33184,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33182\/revisions\/33184"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33183"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}