{"id":33199,"date":"2021-11-19T19:56:45","date_gmt":"2021-11-19T19:56:45","guid":{"rendered":"https:\/\/care4calais.org\/?p=33199"},"modified":"2021-11-19T19:56:45","modified_gmt":"2021-11-19T19:56:45","slug":"piyazs-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/piyazs-story\/","title":{"rendered":"Piyaz&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Today I met an amazing man whose spirit and strength really inspired me. His journey had been incredibly long and hard, but in just an hour or so, he filled me with admiration for the resilience and resourcefulness he had built up during his long life as a refugee.<\/p>\n<p>Piyaz left his native Afghanistan in 2013, and to get to Calais, where he’s living hoping to get to the UK, he had walked most of the way. “Eight years walking. That’s being a refugee. No place to stay, and it’s hard on your body. Hard on your feet!”<\/p>\n<p>Even living in Calais he had to walk a lot, he said, because places offering help can be far apart. He lifted up his feet to show me his boots. “They’re worn, so soon water will get in. I will mend them, or try to find new ones.”<\/p>\n<p>It made me realise yet again important it was that Care4Calais distributes new boots in winter.<\/p>\n<p>We were at a food distribution near a site where many refugees moved to following recent evictions. Piyaz and his friends had stored their food, and he was now cleaning and fixing those boots.<\/p>\n<p>In Afghanistan he had worked as a builder, but it was “hard to work, and hard to live”. Even then, the Taliban meant you lived in fear of being singled out; he would see people being beaten seemingly at random. Just wanting a peaceful life, he crossed into Iran, worked and kept himself to himself, but kept getting deported.<\/p>\n<p>He had to go somewhere, and having friends in England, he decided on there. It’s friends that are important, not countries, he said.<\/p>\n<p>Why is that fundamental truth so obvious to us, yet so hard for our leaders to grasp? I suddenly found myself thinking of the refugees on the Polish border.<\/p>\n<p>Piyaz walked alone over the mountains (“so many mountains!”) from Iran into Turkey, and then trekked up through Europe. Now in Calais, he just wishes he could work while waiting for a chance to cross.<\/p>\n<p>Talking to this determined, warm-hearted human who had taught himself the skills he needed, you knew he’d be an amazing member of any community. I really hope he joins the UK’s soon.<\/p>\n<p>We need donations to help people like Piyaz get through the winter. If you can help, please get in touch at care4calais.org\/get-involved\/<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Today I met an amazing man whose spirit and strength really inspired me. His journey had been incredibly long and hard, but in just an hour or so, he filled me with admiration for the resilience and resourcefulness he had built up during his long life as a refugee. Piyaz left his native Afghanistan in 2013, and to get to Calais, where he’s living hoping to get to the UK, he had walked most of the way. “Eight years walking. That’s being a refugee. No place to stay, and it’s hard on your body. Hard on your feet!” Even living in Calais he had to walk a lot, he said, because places offering help can be far apart. He lifted up his feet to show me his boots. “They’re worn, so soon water will get in. I will mend them, or try to find new ones.” It made me realise yet again important it was that Care4Calais distributes new boots in winter. We were at a food distribution near a site where many refugees moved to following recent evictions. Piyaz and his friends had stored their food, and he was now cleaning and fixing those boots. In Afghanistan he had worked as a builder, but it was “hard to work, and hard to live”. Even then, the Taliban meant you lived in fear of being singled out; he would see people being beaten seemingly at random. Just wanting a peaceful life, he crossed into Iran, worked and kept himself to himself, but kept getting deported. He had to go somewhere, and having friends in England, he decided on there. It’s friends that are important, not countries, he said. Why is that fundamental truth so obvious to us, yet so hard for our leaders to grasp? I suddenly found myself thinking of the refugees on the Polish border. Piyaz walked alone over the mountains (“so many mountains!”) from Iran into Turkey, and then trekked up through Europe. Now in Calais, he just wishes he could work while waiting for a chance to cross. Talking to this determined, warm-hearted human who had taught himself the skills he needed, you knew he’d be an amazing member of any community. I really hope he joins the UK’s soon. We need donations to help people like Piyaz get through the winter. If you can help, please get in touch at care4calais.org\/get-involved\/ &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":33200,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[104,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33199"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33199"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33199\/revisions"}],"predecessor-version":[{"id":33201,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33199\/revisions\/33201"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33200"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33199"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}