{"id":33213,"date":"2021-11-21T12:16:06","date_gmt":"2021-11-21T12:16:06","guid":{"rendered":"https:\/\/care4calais.org\/?p=33213"},"modified":"2023-02-08T17:04:50","modified_gmt":"2023-02-08T16:04:50","slug":"fatemahs-family-and-the-polish-border-update","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/fatemahs-family-and-the-polish-border-update\/","title":{"rendered":"Fatemah&#8217;s family and the Polish border: update"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Yesterday we received news from Fatemah and her family, Iraqi refugees stranded in Belarus who Care4Calais is helping. Although media reports suggest things are improving, the family is terrified of what might now happen to them. Their situation is extremely dangerous, and they need support.<\/p>\n<p>Fatemah was on the border near the Polish town of Bialowieza with with her dad and three children, but they became separated in attacks by Bielarussian border guards, as we previously reported. Fatemah is with her son and daughter, and her dad has her other son. Her husband Aras remains in Dubai.<\/p>\n<p>Fatemah has a heart condition and, needing medical attention, she paid a people smuggler to take her and her two children to Germany. Instead the smuggler kidnapped her. After we spoke to her husband and alerted the police, Polish police freed Fatemah and her children &#8211; but then contact with them was lost.<\/p>\n<p>Yesterday we were relieved to hear from Aras that he had contacted them. They are now united with Fatemah’s dad and other son, and have been taken to a big shelter with many others, where they are sleeping on concrete floors. The anxiety and discomfort would unimaginable for anyone, but with Fatemah’s heart condition is now in urgent need of attention its deeply troubling.<\/p>\n<p>Bielarussian authorities have reportedly organised return flights for some of the asylum seekers. But now she, and her closest family fear they’ll be flown to the country of their birth, ie Iraq. This is terrible news.<\/p>\n<p>The whole reason they were desperate to get to Europe was that Aras cannot be in Iraq for fear of government persecution for his involvement in protests there many years ago.<\/p>\n<p>Aras is distraught. What can he do? His wife will possibly be receiving attention in hospital there, so there will be no-one to look after the children unless he goes, he told us. But if he goes, the police will prosecute him and his family.<\/p>\n<p>The only hope is that Fatemah is well enough to leave when she arrives. Whether she will be allowed to is another question.<\/p>\n<p>This nightmare applies to many if not most of the refugees in Belarus, and seems unspeakably cruel. It’s essential that people like Fatemah and her family are allowed to return to the country of their choice, as anyone else would be.<\/p>\n<p>It’s vital that we all keep up pressure on Poland and Belorussia by speaking out and making our voices heard. The fate of people like Fatemah and her family may depend on it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Yesterday we received news from Fatemah and her family, Iraqi refugees stranded in Belarus who Care4Calais is helping. Although media reports suggest things are improving, the family is terrified of what might now happen to them. Their situation is extremely dangerous, and they need support. Fatemah was on the border near the Polish town of Bialowieza with with her dad and three children, but they became separated in attacks by Bielarussian border guards, as we previously reported. Fatemah is with her son and daughter, and her dad has her other son. Her husband Aras remains in Dubai. Fatemah has a heart condition and, needing medical attention, she paid a people smuggler to take her and her two children to Germany. Instead the smuggler kidnapped her. After we spoke to her husband and alerted the police, Polish police freed Fatemah and her children &#8211; but then contact with them was lost. Yesterday we were relieved to hear from Aras that he had contacted them. They are now united with Fatemah’s dad and other son, and have been taken to a big shelter with many others, where they are sleeping on concrete floors. The anxiety and discomfort would unimaginable for anyone, but with Fatemah’s heart condition is now in urgent need of attention its deeply troubling. Bielarussian authorities have reportedly organised return flights for some of the asylum seekers. But now she, and her closest family fear they’ll be flown to the country of their birth, ie Iraq. This is terrible news. The whole reason they were desperate to get to Europe was that Aras cannot be in Iraq for fear of government persecution for his involvement in protests there many years ago. Aras is distraught. What can he do? His wife will possibly be receiving attention in hospital there, so there will be no-one to look after the children unless he goes, he told us. But if he goes, the police will prosecute him and his family. The only hope is that Fatemah is well enough to leave when she arrives. Whether she will be allowed to is another question. This nightmare applies to many if not most of the refugees in Belarus, and seems unspeakably cruel. It’s essential that people like Fatemah and her family are allowed to return to the country of their choice, as anyone else would be. It’s vital that we all keep up pressure on Poland and Belorussia by speaking out and making our voices heard. The fate of people like Fatemah and her family may depend on it.<\/p>\n","protected":false},"author":21,"featured_media":33220,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33213"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33213"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33213\/revisions"}],"predecessor-version":[{"id":33215,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33213\/revisions\/33215"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33220"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33213"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33213"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33213"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}