{"id":33226,"date":"2021-11-22T18:09:35","date_gmt":"2021-11-22T18:09:35","guid":{"rendered":"https:\/\/care4calais.org\/?p=33226"},"modified":"2021-11-22T18:09:35","modified_gmt":"2021-11-22T18:09:35","slug":"anurs-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/anurs-story\/","title":{"rendered":"Anur&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>I’ve been in the UK since July now, and while I am glad I am safe here I can’t help but wonder why we spent 20 years fighting the Taliban. Was it worth it now everything’s gone? It’s a really hard thing to stomach when you look at everything we sacrificed and lost so that we could have a future for our children, and then saw that future ripped from us.<\/p>\n<p>I worked with the British Special Forces. I was with the Afghani Special Forces Commando, and being out there on the front line I saw what was coming, and I knew I would be one of the first targets. I applied for the ARAP scheme as soon as it opened, and I left Afghanistan early in July.<\/p>\n<p>It wasn’t as organized as that makes it sound, because when the Taliban took the outskirts of Kabul I had to leave immediately. There was no time to get my wife and six children – two boys and four girls – out, so they’re still there in Kabul waiting to leave. I talk to them every day, and they’re as safe as they can be. They don’t live at home, but move from house to house trying to stay out of the Taliban’s sight.<\/p>\n<p>My girls are still in school when they can be, but they have to keep moving schools too. This is becoming normal – no one questions who comes to school, unless the Taliban are there. But then if the Taliban are there, the girls do not go to school. Everything is getting harder. There’s no money and no jobs, and everything is collapsing.<\/p>\n<p>My family is registered to come to the UK, but I don’t know when it will happen, and it is impossible to find anyone who can tell me. I have confidence in the British to get my family out, though; they looked after us in the army, so I hope they keep their promises.<\/p>\n<p>When I first arrived in the UK I was sent to a hotel in London. I didn’t know anyone there though, so I asked if I could go to stay with my cousins in Manchester. I was allowed to do this. My cousin knew about Care4Calais, and said they would help me find some clothes, so I went to meet them at a hotel where they were doing a distribution. I got talking to the volunteers, and one day I found they needed a lot of help moving boxes, so I did this for them. I much prefer to work than sit around. In Afghanistan I was very busy with my job.<\/p>\n<p>I worked in Helmand, Kandahar, Herat and Jalalabad, always on special missions on the front line. I was a major in the Quick Reaction Team (QRT). If you’ve watched The OutPost on Amazon you’ll know the sort of thing I did. We’d be flown in for 72 hours or less and have to move back out quickly, so we couldn’t be found. By June we were surrounded, and I knew we couldn’t do anything when America left; I saw it happen, and I knew that was the end. I knew there would be nowhere to hide, and I knew that I was a major target. If I stayed, they would have been able to use my family to make me surrender. I had no choice.<\/p>\n<p>I spent some time training other soldiers in the Afghan army. I really enjoyed this, and I thought we were making progress in making a good army that could keep Afghanistan safe.<\/p>\n<p>I miss the army and my friends both Afghan and British, but I do like Manchester and its people. They are very friendly. Back in Afghanistan I liked to play volleyball and chess; I was pretty good at chess, and it would be good to find someone to play with here. Right now I just play online, which is OK but it would be good to sit outside with chai and play for real. I think that would help me learn English faster too!<\/p>\n<p>Anur, Manchester<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; I’ve been in the UK since July now, and while I am glad I am safe here I can’t help but wonder why we spent 20 years fighting the Taliban. Was it worth it now everything’s gone? It’s a really hard thing to stomach when you look at everything we sacrificed and lost so that we could have a future for our children, and then saw that future ripped from us. I worked with the British Special Forces. I was with the Afghani Special Forces Commando, and being out there on the front line I saw what was coming, and I knew I would be one of the first targets. I applied for the ARAP scheme as soon as it opened, and I left Afghanistan early in July. It wasn’t as organized as that makes it sound, because when the Taliban took the outskirts of Kabul I had to leave immediately. There was no time to get my wife and six children – two boys and four girls – out, so they’re still there in Kabul waiting to leave. I talk to them every day, and they’re as safe as they can be. They don’t live at home, but move from house to house trying to stay out of the Taliban’s sight. My girls are still in school when they can be, but they have to keep moving schools too. This is becoming normal – no one questions who comes to school, unless the Taliban are there. But then if the Taliban are there, the girls do not go to school. Everything is getting harder. There’s no money and no jobs, and everything is collapsing. My family is registered to come to the UK, but I don’t know when it will happen, and it is impossible to find anyone who can tell me. I have confidence in the British to get my family out, though; they looked after us in the army, so I hope they keep their promises. When I first arrived in the UK I was sent to a hotel in London. I didn’t know anyone there though, so I asked if I could go to stay with my cousins in Manchester. I was allowed to do this. My cousin knew about Care4Calais, and said they would help me find some clothes, so I went to meet them at a hotel where they were doing a distribution. I got talking to the volunteers, and one day I found they needed a lot of help moving boxes, so I did this for them. I much prefer to work than sit around. In Afghanistan I was very busy with my job. I worked in Helmand, Kandahar, Herat and Jalalabad, always on special missions on the front line. I was a major in the Quick Reaction Team (QRT). If you’ve watched The OutPost on Amazon you’ll know the sort of thing I did. We’d be flown in for 72 hours or less and have to move back out quickly, so we couldn’t be found. By June we were surrounded, and I knew we couldn’t do anything when America left; I saw it happen, and I knew that was the end. I knew there would be nowhere to hide, and I knew that I was a major target. If I stayed, they would have been able to use my family to make me surrender. I had no choice. I spent some time training other soldiers in the Afghan army. I really enjoyed this, and I thought we were making progress in making a good army that could keep Afghanistan safe. I miss the army and my friends both Afghan and British, but I do like Manchester and its people. They are very friendly. Back in Afghanistan I liked to play volleyball and chess; I was pretty good at chess, and it would be good to find someone to play with here. Right now I just play online, which is OK but it would be good to sit outside with chai and play for real. I think that would help me learn English faster too! Anur, Manchester<\/p>\n","protected":false},"author":21,"featured_media":33227,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[154,104],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33226"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33226"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33226\/revisions"}],"predecessor-version":[{"id":33228,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33226\/revisions\/33228"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33227"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33226"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33226"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33226"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}