{"id":33407,"date":"2021-11-29T18:14:01","date_gmt":"2021-11-29T18:14:01","guid":{"rendered":"https:\/\/care4calais.org\/?p=33407"},"modified":"2021-11-29T18:16:01","modified_gmt":"2021-11-29T18:16:01","slug":"eids-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/eids-story\/","title":{"rendered":"Eid&#8217;s story"},"content":{"rendered":"<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">“If you have a passion you must believe in it, and go with it with everything you have. That way, you will find your dream.”  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In December 2017 a young Syrian refugee arrived at Glasgow Airport. People smugglers had brought him there, but he didn’t know where he was, and asked the Border Control guards who had detained him if he could walk into London to buy some food, as he was hungry.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“I guess it broke the ice, as they all laughed. They said that would be fine, if I had about five days to spare.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When he finally made it into Glasgow itself, he was bowled over. “I loved the city. It was so beautifully friendly, and although I was homeless there were lots of places that helped me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When I arrived I had no English, so I set about learning it. I watched The Vampire Diaries on TV, and finding it so much fun to watch I learned a lot of English from it. After that, I started to learn some funny English slang, like like ‘hunky dory’ and ‘alright mate?&#8217;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“After a few months in Glasgow I was moved to London, and I lived in a hostel. And it was there that my story really begins.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“One night I was just flicking through YouTube and I stumbled across a video of a guy swimming. He looked as if he was flying through the water, with nothing stopping him. I watched more of his videos, and something just got caught hold of me, and I knew what I wanted to do. I was going to be a swimmer; I was going to be the next Michael Phelps and I was going to go to the Olympics! I was 23 at the time. There was just one small problem in that I couldn’t swim, but hey, you’ve got to start somewhere.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“It was a bit odd I chose swimming I suppose, because I nearly died in a boat crossing the Mediterranean. That was a really terrifying experience, and I’ve only swum in the sea once, since then – I prefer pools.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“Anyway, I got some swimming trunks and I went to the pool. I couldn’t afford lessons so I hung about in the corners of pools watching the trainers. I’m actually surprised I wasn’t arrested now I think about it! I copied the swimmers and some of the trainers noticed me and I explained what I was doing. Some invited me to join the groups. But mostly I taught myself.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“Living on £5 a day as a refugee was very tough. It really doesn’t go very far, but I didn’t let it stop me swimming. People asked me why I bothered with swimming when I had barely enough to feed myself, but you have to have a dream or a purpose, because that’s what keeps you going. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">“I learned to swim.  I am a sprinter mainly &#8211; freestyle &#8211; but I like Butterfly too. I got better. I watched videos, and went to the pool every day and I became fast. The trainer was actually amazed. I started to win races, progressing to bigger and bigger ones. I dream of qualifying to swim in the olympics ones day. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">“I have been supported by so many people, and my story has even been mentioned in parliament! I was in the YMCA for a year before my asylum was granted, now I live with an amazing family I met while I was at the YMCA. We became friends and eventually I moved into their house.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“I’ve not just been learning to swim though; I’ve just completed my foundation year for my bachelor’s degree in accounting and finance from Kings College London. t is so tough doing a degree in a second language. I’m still learning English, and this has been a big challenge for me, but I’ve just completed my first year exams in English.<\/span><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">“I have also worked as an intern at Convex, an insurance and finance company in London, but I always train at least four hours a day. I still need to get a bit faster on my time, but I’ll get there.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“I had a wonderful life in Syria, a good job and a home, but that is gone. There is no home to go back to for me. Some of my family are still there. I will see them again when the war is over.  London is my home now and I love it, you have to look forward and focus on what you want, and be positive.<\/span><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">“In London, I love Camden Market and Covent Garden, the theatre and Portobello Road. I’m a city boy, for sure and I want to make my life here. Most of all I want to go to the olympics, and swim for the refugee team.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>  “If you have a passion you must believe in it, and go with it with everything you have. That way, you will find your dream.”   In December 2017 a young Syrian refugee arrived at Glasgow Airport. People smugglers had brought him there, but he didn’t know where he was, and asked the Border Control guards who had detained him if he could walk into London to buy some food, as he was hungry. “I guess it broke the ice, as they all laughed. They said that would be fine, if I had about five days to spare.” When he finally made it into Glasgow itself, he was bowled over. “I loved the city. It was so beautifully friendly, and although I was homeless there were lots of places that helped me. When I arrived I had no English, so I set about learning it. I watched The Vampire Diaries on TV, and finding it so much fun to watch I learned a lot of English from it. After that, I started to learn some funny English slang, like like ‘hunky dory’ and ‘alright mate?&#8217; “After a few months in Glasgow I was moved to London, and I lived in a hostel. And it was there that my story really begins. “One night I was just flicking through YouTube and I stumbled across a video of a guy swimming. He looked as if he was flying through the water, with nothing stopping him. I watched more of his videos, and something just got caught hold of me, and I knew what I wanted to do. I was going to be a swimmer; I was going to be the next Michael Phelps and I was going to go to the Olympics! I was 23 at the time. There was just one small problem in that I couldn’t swim, but hey, you’ve got to start somewhere. “It was a bit odd I chose swimming I suppose, because I nearly died in a boat crossing the Mediterranean. That was a really terrifying experience, and I’ve only swum in the sea once, since then – I prefer pools. “Anyway, I got some swimming trunks and I went to the pool. I couldn’t afford lessons so I hung about in the corners of pools watching the trainers. I’m actually surprised I wasn’t arrested now I think about it! I copied the swimmers and some of the trainers noticed me and I explained what I was doing. Some invited me to join the groups. But mostly I taught myself. “Living on £5 a day as a refugee was very tough. It really doesn’t go very far, but I didn’t let it stop me swimming. People asked me why I bothered with swimming when I had barely enough to feed myself, but you have to have a dream or a purpose, because that’s what keeps you going.  “I learned to swim.  I am a sprinter mainly &#8211; freestyle &#8211; but I like Butterfly too. I got better. I watched videos, and went to the pool every day and I became fast. The trainer was actually amazed. I started to win races, progressing to bigger and bigger ones. I dream of qualifying to swim in the olympics ones day.  “I have been supported by so many people, and my story has even been mentioned in parliament! I was in the YMCA for a year before my asylum was granted, now I live with an amazing family I met while I was at the YMCA. We became friends and eventually I moved into their house. “I’ve not just been learning to swim though; I’ve just completed my foundation year for my bachelor’s degree in accounting and finance from Kings College London. t is so tough doing a degree in a second language. I’m still learning English, and this has been a big challenge for me, but I’ve just completed my first year exams in English.  “I have also worked as an intern at Convex, an insurance and finance company in London, but I always train at least four hours a day. I still need to get a bit faster on my time, but I’ll get there. “I had a wonderful life in Syria, a good job and a home, but that is gone. There is no home to go back to for me. Some of my family are still there. I will see them again when the war is over.  London is my home now and I love it, you have to look forward and focus on what you want, and be positive.  “In London, I love Camden Market and Covent Garden, the theatre and Portobello Road. I’m a city boy, for sure and I want to make my life here. Most of all I want to go to the olympics, and swim for the refugee team.”         &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":33406,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[104,162,160,161],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33407"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33407"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33407\/revisions"}],"predecessor-version":[{"id":33408,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33407\/revisions\/33408"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33406"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33407"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33407"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33407"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}