{"id":33574,"date":"2021-12-07T16:00:22","date_gmt":"2021-12-07T16:00:22","guid":{"rendered":"https:\/\/care4calais.org\/?p=33574"},"modified":"2022-09-08T11:37:00","modified_gmt":"2022-09-08T10:37:00","slug":"hayats-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/hayats-story\/","title":{"rendered":"Hayat&#8217;s family: the pictures that tell an awful story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>These pictures tell a story that needs to be told.<\/p>\n<p>After the tragic events in the Channel recently, Hayat told me her story. The first picture shows Hayat’s four children who are now happy at school in the UK. She is so proud of them.<\/p>\n<p>However, there is one child missing.<\/p>\n<div class=\"text_exposed_show\">\n<p>Two years ago, her eldest son, Yusuf, 13, was shot dead in Kuwait by the police. Why?Because he is Bidoon.<\/p>\n<p>Bidoon are a stateless Arab minority in Kuwait who were not included as citizens at the time of the country’s independence, or thereafter. They live in slums outside the cities with no access to education or healthcare.<\/p>\n<p>It was because of his death that her family chose to leave Kuwait. Wouldn’t you?<\/p>\n<p>The journey to Europe was treacherous, and her youngest daughter was born in terrible conditions en route.<\/p>\n<p>But let’s focus closer to home. Here is a picture of the boat that she took from Calais to the UK in the dead of night one year ago. Thirteen hours in a cold, overloaded, dangerous boat. They were picked up by the the “Dauntless Dover” a few miles off the coast of Kent. You can see the pictures of her daughter being passed to safety.<\/p>\n<p>Hayat’s family were lucky. They could have easily been “a family that drowned in the Channel”. Instead, Hayat feels lucky that her children are safe and attending school.<\/p>\n<p>But, make no mistake, Hayat has not come here for an easy life or the benefit system. She is doing her best to forge a future in a completely different culture with no family support or friends. Trying to negotiate school runs, homework, shopping, foodbanks, bus routes, a new language, paperwork, appointments and occasional racism.<\/p>\n<p>It’s a lonely life she leads. She has done it all for the safety of her children. She has good reason.<\/p>\n<p>Hayat is one of the bravest women I know.<br \/>\nBrave to take action after the murder of her son, to leave her country, her family, to walk hundreds of miles, to give birth alone en route, and finally… to get in a small rubber boat with her children and cross the English Channel, in late November.<\/p>\n<p>When I look at the photos below, I cannot fathom why she was obliged to take this last step. We all know it’s a treacherous route.<br \/>\nOne of the most dangerous shipping lanes in the world. Why this is the only option for someone like Hayat?<\/p>\n<p>There has to be a better way.<\/p>\n<p><a class=\"_58cn\" href=\"https:\/\/www.facebook.com\/hashtag\/saferoutesnow?__eep__=6&amp;source=feed_text&amp;epa=HASHTAG&amp;__xts__%5B0%5D=68.ARAQEV0DwxgLz8dkKzEWvoVbjznw18E6D_R8MbY2wzbrGRi3yae9ZH-VGj-fKmBIEkvRVONQrH42KZ8u2jt-rT46njvrZCZDZvUMSVS4kJxCMo44XkV24_5PaxFU9kLxP45_dtTqPu9cAnjJr-o7_I6Ox2B-07Eq46dzQrDPKUq-nFmZHn53J85kHypI9hdNiYTmBcSBaVarJUms5RJ2dTkaTgyXh4QEhk0vBY0xp-kzKDNSXqloah7F90jS7cCP8AzlZwngZvYEAlpEp1ksSVZXzkJ5AuiH7DTkTxBucYIFbt8Ksi1AmwQ&amp;__tn__=%2ANK-R\" data-ft=\"{&quot;type&quot;:104,&quot;tn&quot;:&quot;*N&quot;}\"><span class=\"_5afx\"><span class=\"_58cl _5afz\" aria-label=\"hashtag\">#<\/span><span class=\"_58cm\">SafeRoutesNow<\/span><\/span><\/a> <a class=\"_58cn\" href=\"https:\/\/www.facebook.com\/hashtag\/antirefugeebill?__eep__=6&amp;source=feed_text&amp;epa=HASHTAG&amp;__xts__%5B0%5D=68.ARAQEV0DwxgLz8dkKzEWvoVbjznw18E6D_R8MbY2wzbrGRi3yae9ZH-VGj-fKmBIEkvRVONQrH42KZ8u2jt-rT46njvrZCZDZvUMSVS4kJxCMo44XkV24_5PaxFU9kLxP45_dtTqPu9cAnjJr-o7_I6Ox2B-07Eq46dzQrDPKUq-nFmZHn53J85kHypI9hdNiYTmBcSBaVarJUms5RJ2dTkaTgyXh4QEhk0vBY0xp-kzKDNSXqloah7F90jS7cCP8AzlZwngZvYEAlpEp1ksSVZXzkJ5AuiH7DTkTxBucYIFbt8Ksi1AmwQ&amp;__tn__=%2ANK-R\" data-ft=\"{&quot;type&quot;:104,&quot;tn&quot;:&quot;*N&quot;}\"><span class=\"_5afx\"><span class=\"_58cl _5afz\" aria-label=\"hashtag\">#<\/span><span class=\"_58cm\">AntiRefugeeBill<\/span><\/span><\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; These pictures tell a story that needs to be told. After the tragic events in the Channel recently, Hayat told me her story. The first picture shows Hayat’s four children who are now happy at school in the UK. She is so proud of them. However, there is one child missing. Two years ago, her eldest son, Yusuf, 13, was shot dead in Kuwait by the police. Why?Because he is Bidoon. Bidoon are a stateless Arab minority in Kuwait who were not included as citizens at the time of the country’s independence, or thereafter. They live in slums outside the cities with no access to education or healthcare. It was because of his death that her family chose to leave Kuwait. Wouldn’t you? The journey to Europe was treacherous, and her youngest daughter was born in terrible conditions en route. But let’s focus closer to home. Here is a picture of the boat that she took from Calais to the UK in the dead of night one year ago. Thirteen hours in a cold, overloaded, dangerous boat. They were picked up by the the “Dauntless Dover” a few miles off the coast of Kent. You can see the pictures of her daughter being passed to safety. Hayat’s family were lucky. They could have easily been “a family that drowned in the Channel”. Instead, Hayat feels lucky that her children are safe and attending school. But, make no mistake, Hayat has not come here for an easy life or the benefit system. She is doing her best to forge a future in a completely different culture with no family support or friends. Trying to negotiate school runs, homework, shopping, foodbanks, bus routes, a new language, paperwork, appointments and occasional racism. It’s a lonely life she leads. She has done it all for the safety of her children. She has good reason. Hayat is one of the bravest women I know. Brave to take action after the murder of her son, to leave her country, her family, to walk hundreds of miles, to give birth alone en route, and finally… to get in a small rubber boat with her children and cross the English Channel, in late November. When I look at the photos below, I cannot fathom why she was obliged to take this last step. We all know it’s a treacherous route. One of the most dangerous shipping lanes in the world. Why this is the only option for someone like Hayat? There has to be a better way. #SafeRoutesNow #AntiRefugeeBill<\/p>\n","protected":false},"author":21,"featured_media":33575,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33574"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33574"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33574\/revisions"}],"predecessor-version":[{"id":33577,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33574\/revisions\/33577"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33575"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33574"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33574"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33574"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}