{"id":33717,"date":"2021-12-16T07:00:14","date_gmt":"2021-12-16T07:00:14","guid":{"rendered":"https:\/\/care4calais.org\/?p=33717"},"modified":"2023-02-08T17:03:09","modified_gmt":"2023-02-08T16:03:09","slug":"a-visit-from-dr-rosena","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/a-visit-from-dr-rosena\/","title":{"rendered":"A visit from Dr Rosena"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>This week we were delighted to welcome to Calais <a class=\"profileLink\" href=\"https:\/\/www.facebook.com\/DrRosena\/?fref=mentions&amp;__xts__%5B0%5D=68.ARA8MCtQK2J6Bzeyp3oNEOGKgmKb7tYrW8OYQ_CL0OY4lQqxZn5-kO3A_UB9a7_6EmlixgswEFJ4HrhNSyTtpmeKwyezoM0rIxsEwydGQbiUffVKMZzap4o0aswtsyXgXhjoLPc2-LxwVT0wF5uEME6QWSTu3ezs8xeGVH2mUY4QGcabUvkI1bD0CUeoYbGTfYU81lKs3PEQQ33pn9356ZcD4OGCHwMwczbClkaey3syNQ1A6S9FxB3Q_nlUIZr651dxj_zoCuoVRur-N31VtWt_ssLWgF9uBHQ7Vy6X_a26__sG2YxAH6E&amp;__tn__=K-R\">Dr Rosena Allin-Khan<\/a>, the Shadow Cabinet Minister for Mental Health and MP for Tooting in London. She spent the last few days working with our team and talking to refugees.<\/p>\n<p>She found out how refugees’ mental health is impacted by the appalling conditions that they’re forced to live in. When she went out on distributions – food packs in Calais clothing packs in Dunkirk &#8211; she was shocked by some of the horrors they endured. T<span class=\"text_exposed_show\">hree children she met had hardly eaten for almost two days, and wouldn’t have been eating that day either had not been for a Care4Calais food pack.<\/span><\/p>\n<div class=\"text_exposed_show\">\n<p>On her second day, Dr Rosena got a particularly harrowing insight into the brutality affecting refugee lives in northern France when there was an eviction in Dunkirk. She was fantastic at getting involved with us, and that morning she mucked in as we all worked extra hard to get tents for 200 people to those whose belongings had been confiscated. She was moved by the fact that Care4Calais’ work meant 200 men, women and children didn’t have to sleep out in the freezing cold that night.<\/p>\n<p>Dr Rosena has done a lot to raise awareness of the plight of refugees, and did great work on her social media when she was out with us. She said she’d been heartbroken but inspired by the experience.<\/p>\n<p>“It’s unimaginable to think that so close to Christmas there are families that are having to live like this, and many waiting to make that treacherous crossing across the English Channel. Some of the stories I heard from refugees were really quite heart wrenching , but I’m so impressed with all the work Care4Calais are doing. The real love that comes from the volunteers emanates from the whole operation.”<\/p>\n<p>Everything we do is driven by empathy and love, so it was wonderful to hear these words spoken by such a great woman and campaigner. Thanks Dr Rosena &#8211; we hope to see you again soon.<\/p>\n<p>To volunteer or donate go to <a href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"noopener nofollow\" data-ft=\"{&quot;tn&quot;:&quot;-U&quot;}\" data-lynx-mode=\"async\" data-lynx-uri=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2FCare4Calais.org%2F&amp;h=AT2RtTFrILhl_RKIflPeNoCGYl6DkYTpNWy00iZeKlMwLvP8u7JzPGw-jg2pN63pZxNlPMWl2E8u_DLzasgAfhFg8pr6SumzXrDAHYQwBOdaeKsZgOvM3mvfjUoHWjDxBEHyY35XHopOsfxPudgKE2FRnuCFkVgYM1Iun9MJl4luhiJjujqo6W6SOtHaZ_-ovA-vbAIZU_LuHF9HPci8a6Pv-2gHOLcWW4ozz46sfG_HMGCv-awT1UCTNHDS1Q2VYhtjiIGpiSdGxuvtIX0m8Q8g15KaOnDH613p4HFI_nPNGjoE4f8vDxZqmokaZnS2ASHx9yJOTyazpv0CNsCIKPK05i07EmGF9GUCpx6wUinSic110UmCgZhSGxmUF7QI5U871mHGgpUhgrCtmctfmK13en0ErKynxATVMbaORDuiJzix-EOq70kopRQbLiaisG8YRvbmCtahGKNUBVKSRhFThMtd9kTQ4QNn3Gsf4CB8RTF6Y2yYi-3NeWZ9ZHZ7DCBCaSIY66_wyinW4XOC1uRMs8xafqYSLu_ag9Ey6R1TodJb-_4jJvgdJ_2D65-lsAh0JaZZdI3CQLRAR1BOpMOt8ZOXID-Vz5pbkM8\">Care4Calais.org<\/a><\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; This week we were delighted to welcome to Calais Dr Rosena Allin-Khan, the Shadow Cabinet Minister for Mental Health and MP for Tooting in London. She spent the last few days working with our team and talking to refugees. She found out how refugees’ mental health is impacted by the appalling conditions that they’re forced to live in. When she went out on distributions – food packs in Calais clothing packs in Dunkirk &#8211; she was shocked by some of the horrors they endured. Three children she met had hardly eaten for almost two days, and wouldn’t have been eating that day either had not been for a Care4Calais food pack. On her second day, Dr Rosena got a particularly harrowing insight into the brutality affecting refugee lives in northern France when there was an eviction in Dunkirk. She was fantastic at getting involved with us, and that morning she mucked in as we all worked extra hard to get tents for 200 people to those whose belongings had been confiscated. She was moved by the fact that Care4Calais’ work meant 200 men, women and children didn’t have to sleep out in the freezing cold that night. Dr Rosena has done a lot to raise awareness of the plight of refugees, and did great work on her social media when she was out with us. She said she’d been heartbroken but inspired by the experience. “It’s unimaginable to think that so close to Christmas there are families that are having to live like this, and many waiting to make that treacherous crossing across the English Channel. Some of the stories I heard from refugees were really quite heart wrenching , but I’m so impressed with all the work Care4Calais are doing. The real love that comes from the volunteers emanates from the whole operation.” Everything we do is driven by empathy and love, so it was wonderful to hear these words spoken by such a great woman and campaigner. Thanks Dr Rosena &#8211; we hope to see you again soon. To volunteer or donate go to Care4Calais.org<\/p>\n","protected":false},"author":21,"featured_media":33718,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,235,70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33717"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33717"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33717\/revisions"}],"predecessor-version":[{"id":33719,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33717\/revisions\/33719"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33718"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33717"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33717"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33717"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}