{"id":33721,"date":"2021-12-19T09:48:54","date_gmt":"2021-12-19T09:48:54","guid":{"rendered":"https:\/\/care4calais.org\/?p=33721"},"modified":"2021-12-20T09:51:12","modified_gmt":"2021-12-20T09:51:12","slug":"georgina","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/georgina\/","title":{"rendered":"Georgina"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>As a volunteer helping Afghan refugees in Manchester, the work can be demanding. Sometimes though, you meet someone so inspiring they take your breath away.<\/p>\n<p>I’ll never forget one weekend when I was supervising at a hotel, another volunteer was offering haircuts and it was exceptionally busy. There were lots of children and I was struggling to give them all as much attention as I’d like.<\/p>\n<p>I don’t speak any of the Afghan languages and it was difficult to understand what people needed as the volume of people gathering in the corridor started to grow.<\/p>\n<p>Suddenly, an amazing 13-year-old girl appeared at my side and asked if she could help me.<\/p>\n<p>She was incredible. Her English was brilliant, and recognising that my slow loud English wasn’t getting me very far, she started shouting in her native language. As if by magic, there was order! The people moved neatly into two lines, one for haircuts and one for everything else.<\/p>\n<p>The girl grabbed the door handle, and told me not to let anyone in until she said so!<\/p>\n<p>The people looked as relieved and amused as me, that this child had taken control of a most chaotic situation.<\/p>\n<p>I remember thinking: if this girl gets the right support in the UK, she is going to do truly amazing things. Under the current regime in Afghanistan, she wouldn’t even be permitted to study.<\/p>\n<p>Meeting this child brought back some powerful memories for me.<\/p>\n<p>I’m a TV Producer Director, and although I’ve worked on all kinds of interesting programmes including The Island with Bear Grylls, Hunted and Race Across the World, the one that really stayed with me is a series I worked on called ‘The Refugee Camp &#8211; Our Desert Home’.<\/p>\n<p>It was a BBC2 series about life in Zaatari Refugee Camp in Jordan, made in 2016.<\/p>\n<p>Of course, I knew all about the refugee crisis, but only from the comfort of my sofa, and in the safety of my home. Spending six weeks in Zaatari changed my understanding completely.<\/p>\n<p>It’s a Syrian refugee camp, home to around 77,000 people, and now Jordan’s fourth largest city. The camp is really a permanent settlement now, although most people still live in tents provided by big aid agencies.<\/p>\n<p>We produced two one hour programmes, fly-on-the-wall style. I filmed marriages, births, weddings and protests &#8211; every aspect of daily life.<\/p>\n<p>It was the first time I’d ever experienced life in a Refugee camp first hand, and it was both eye opening and challenging.<\/p>\n<p>The thing that really struck me was how incredible the people were. I felt a great sense of admiration for their strength and resilience as they rebuilt their lives in what was once a barren desert.<\/p>\n<p>I still stay in touch with some of the people I met. I will never forget the kindness and warmth they showed me and how openly they shared their stories.<\/p>\n<p>That was the first time I grasped the enormity of the refugee crisis, and I have never forgotten it.<\/p>\n<p>When the news broke about Afghanistan in the summer, it gripped me like nothing had for a long time, and I knew I wanted to help.<\/p>\n<p>When I saw on the news that refugees were arriving in Manchester, I thought about how truly petrifying it must be to leave everything you’ve ever known behind. I’m lucky that this isn’t an experience I’ve ever had to face.<\/p>\n<p>I work in a privileged job and meet so many people from different walks of life, and I also have an incredible network of friends and family. I know from experience that when I ask for help, they all race to help if they can!<\/p>\n<p>I asked for donations to help me buy shoes for the children who were holed up in the many hotels around the region.<\/p>\n<p>My generous network didn’t let me down, and with their help, I bought a trolley load of kids shoes, socks and underwear. I had no idea where to take it.<\/p>\n<p>I scoured FaceBook, and found that Care4Calais had some storage at Stockport so I decided to pop down with my donation and drop it off.<\/p>\n<p>When I arrived, I found they were surrounded by mountains of clothes and toiletries, and needed some serious help to sort through it all, ready to distribute to the hotels. I stayed, and spent the day sorting clothes &#8211; and then found myself going back again and again. It was hard work, but I enjoyed it.<\/p>\n<p>The best thing is knowing that you have sorted through enough items for a distribution and then being able to take it to a hotel, hand it out and then see people wearing it. These people have arrived in the UK with nothing but the clothes on their backs. The gratitude for something as simple as handing out a jumper is truly humbling.<\/p>\n<p>As things began to settle, I was asked to watch over the hairdressing sessions in one of the hotels, which is how I ended up meeting the wonderful young girl.<\/p>\n<p>My task was to keep the kids entertained while the mums and dads got a well deserved treatment.<\/p>\n<p>Despite my inability to speak Pashto or Dari, we still managed to communicate. Thankfully, a smile is a universal language which says more than many words.<\/p>\n<p>Some days the queues were long and the ladies were bringing me donated hair products and asking me to explain what they were. Some of the packaging was a mystery and the ladies had no idea what hair relaxer, curl relaxer might be. Some impromptu miming was called for.<\/p>\n<p>I’m still helping out at Care4Calais. It worries me that some may fall through the gaps and I want to help where I can to make sure that does not happen.<\/p>\n<p>There’s still a desperate need for volunteers in the Manchester warehouse, and there is always something to do, whether it is moving boxes or pairing shoes. The warehouse has now moved to Smithfield Market, which is great for me as I only live a mile up the road. The camaraderie of the volunteers and their passion to help is infectious and you really feel you’ve made a difference by the time you leave.<\/p>\n<p>It’s really easy to volunteer for Care4Calais, red tape is minimal with no compromise to safety. If you want to help &#8211; just rock up at the warehouse for a few hours. See <a class=\"profileLink\" href=\"https:\/\/www.facebook.com\/groups\/902565640335507\/?fref=mentions&amp;__xts__%5B0%5D=68.ARBQ5djIrIOtyzBUIBrJcOhgvb2lpP2CQvowg-Y3qdpIRhEtXDf8lRGLCRiQRrtuPPPWV9ao0kxZlGU8FT7yU2TaVDRFmUZlHiErX-B-aQ7zQl7OTyUvF3E8doZhXlsqn4n8dtaCwC1MCONQ_FH8ol2gyCKTC9Bc_TIEftfCbIlIEJPlT41jsjGynyckquJ_9p5JDnD_Q8RYVb4hXQeBvALUIbxfwdj0psTI1MpA-287ytUHCzY5vk5pdJnF4-NUV-YmynTn4H2f8EVkRAbBaX73R9x2PVT-2D-DcxnAQd07MMBKD8KKCXw&amp;__tn__=K-R\">www.facebook.com\/groups\/902565640335507\/<\/a> to get involved<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; As a volunteer helping Afghan refugees in Manchester, the work can be demanding. Sometimes though, you meet someone so inspiring they take your breath away. I’ll never forget one weekend when I was supervising at a hotel, another volunteer was offering haircuts and it was exceptionally busy. There were lots of children and I was struggling to give them all as much attention as I’d like. I don’t speak any of the Afghan languages and it was difficult to understand what people needed as the volume of people gathering in the corridor started to grow. Suddenly, an amazing 13-year-old girl appeared at my side and asked if she could help me. She was incredible. Her English was brilliant, and recognising that my slow loud English wasn’t getting me very far, she started shouting in her native language. As if by magic, there was order! The people moved neatly into two lines, one for haircuts and one for everything else. The girl grabbed the door handle, and told me not to let anyone in until she said so! The people looked as relieved and amused as me, that this child had taken control of a most chaotic situation. I remember thinking: if this girl gets the right support in the UK, she is going to do truly amazing things. Under the current regime in Afghanistan, she wouldn’t even be permitted to study. Meeting this child brought back some powerful memories for me. I’m a TV Producer Director, and although I’ve worked on all kinds of interesting programmes including The Island with Bear Grylls, Hunted and Race Across the World, the one that really stayed with me is a series I worked on called ‘The Refugee Camp &#8211; Our Desert Home’. It was a BBC2 series about life in Zaatari Refugee Camp in Jordan, made in 2016. Of course, I knew all about the refugee crisis, but only from the comfort of my sofa, and in the safety of my home. Spending six weeks in Zaatari changed my understanding completely. It’s a Syrian refugee camp, home to around 77,000 people, and now Jordan’s fourth largest city. The camp is really a permanent settlement now, although most people still live in tents provided by big aid agencies. We produced two one hour programmes, fly-on-the-wall style. I filmed marriages, births, weddings and protests &#8211; every aspect of daily life. It was the first time I’d ever experienced life in a Refugee camp first hand, and it was both eye opening and challenging. The thing that really struck me was how incredible the people were. I felt a great sense of admiration for their strength and resilience as they rebuilt their lives in what was once a barren desert. I still stay in touch with some of the people I met. I will never forget the kindness and warmth they showed me and how openly they shared their stories. That was the first time I grasped the enormity of the refugee crisis, and I have never forgotten it. When the news broke about Afghanistan in the summer, it gripped me like nothing had for a long time, and I knew I wanted to help. When I saw on the news that refugees were arriving in Manchester, I thought about how truly petrifying it must be to leave everything you’ve ever known behind. I’m lucky that this isn’t an experience I’ve ever had to face. I work in a privileged job and meet so many people from different walks of life, and I also have an incredible network of friends and family. I know from experience that when I ask for help, they all race to help if they can! I asked for donations to help me buy shoes for the children who were holed up in the many hotels around the region. My generous network didn’t let me down, and with their help, I bought a trolley load of kids shoes, socks and underwear. I had no idea where to take it. I scoured FaceBook, and found that Care4Calais had some storage at Stockport so I decided to pop down with my donation and drop it off. When I arrived, I found they were surrounded by mountains of clothes and toiletries, and needed some serious help to sort through it all, ready to distribute to the hotels. I stayed, and spent the day sorting clothes &#8211; and then found myself going back again and again. It was hard work, but I enjoyed it. The best thing is knowing that you have sorted through enough items for a distribution and then being able to take it to a hotel, hand it out and then see people wearing it. These people have arrived in the UK with nothing but the clothes on their backs. The gratitude for something as simple as handing out a jumper is truly humbling. As things began to settle, I was asked to watch over the hairdressing sessions in one of the hotels, which is how I ended up meeting the wonderful young girl. My task was to keep the kids entertained while the mums and dads got a well deserved treatment. Despite my inability to speak Pashto or Dari, we still managed to communicate. Thankfully, a smile is a universal language which says more than many words. Some days the queues were long and the ladies were bringing me donated hair products and asking me to explain what they were. Some of the packaging was a mystery and the ladies had no idea what hair relaxer, curl relaxer might be. Some impromptu miming was called for. I’m still helping out at Care4Calais. It worries me that some may fall through the gaps and I want to help where I can to make sure that does not happen. There’s still a desperate need for volunteers in the Manchester warehouse, and there is always something to do, whether it is moving boxes or pairing shoes. The warehouse has now moved to Smithfield [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":33722,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33721"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33721"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33721\/revisions"}],"predecessor-version":[{"id":33723,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33721\/revisions\/33723"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33722"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33721"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33721"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}