{"id":33835,"date":"2021-12-31T11:42:25","date_gmt":"2021-12-31T11:42:25","guid":{"rendered":"https:\/\/care4calais.org\/?p=33835"},"modified":"2022-10-18T13:14:16","modified_gmt":"2022-10-18T12:14:16","slug":"problems-at-a-calais-eviction","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/problems-at-a-calais-eviction\/","title":{"rendered":"Problems at a Calais eviction"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Despite a promise made just eight weeks ago to allow people to collect their belongings when evictions are carried out, this morning the French police formed a cordon around a settlement of around 200 people, herded them out and seized their possessions.<\/p>\n<p>Official reports say the police arrived at the usual time of 9.30am, but refugees have told us that the time was 7am, which meant they were utterly unprepared.<\/p>\n<p>Violence broke out between refugees and police as refugees tried to retrieve possessions such as clothes and phones. There are reports of tear gas, rubber bullets and batons being used. Several refugees were injured and we have been told that at least five were hospitalised. The French authorities claim 14 officers were hospitalised, one with a dislocated shoulder and another with a possible broken leg.<\/p>\n<p>First aid volunteers report treating eyes irritated from tear gas, and injuries which are compatible with rubber bullets and batons. Many of the injured had heavy bruising on the hands, backs, and backs of their legs. One person had a groin injury, and another who said he was shot by a rubber bullet in the abdomen was suspected of having internal bleeding.<\/p>\n<p>The police presence included ten vans of police, which usually carry twelve men per van. Debris of tear gas canisters and rubber bullets littered the ground around the site, showing how much was used.<\/p>\n<p>It is incredibly sad to see this turn of events in Calais, and to see such horrific treatment being visited upon those who have come here to escape from the worst places in the world.<\/p>\n<p>We continue our daily to support for people living in conditions no one should face. Please help at <a href=\"https:\/\/care4calais.org\/donate-now\/\">https:\/\/care4calais.org\/donate-now\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Despite a promise made just eight weeks ago to allow people to collect their belongings when evictions are carried out, this morning the French police formed a cordon around a settlement of around 200 people, herded them out and seized their possessions. Official reports say the police arrived at the usual time of 9.30am, but refugees have told us that the time was 7am, which meant they were utterly unprepared. Violence broke out between refugees and police as refugees tried to retrieve possessions such as clothes and phones. There are reports of tear gas, rubber bullets and batons being used. Several refugees were injured and we have been told that at least five were hospitalised. The French authorities claim 14 officers were hospitalised, one with a dislocated shoulder and another with a possible broken leg. First aid volunteers report treating eyes irritated from tear gas, and injuries which are compatible with rubber bullets and batons. Many of the injured had heavy bruising on the hands, backs, and backs of their legs. One person had a groin injury, and another who said he was shot by a rubber bullet in the abdomen was suspected of having internal bleeding. The police presence included ten vans of police, which usually carry twelve men per van. Debris of tear gas canisters and rubber bullets littered the ground around the site, showing how much was used. It is incredibly sad to see this turn of events in Calais, and to see such horrific treatment being visited upon those who have come here to escape from the worst places in the world. We continue our daily to support for people living in conditions no one should face. Please help at https:\/\/care4calais.org\/donate-now\/<\/p>\n","protected":false},"author":21,"featured_media":33836,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33835"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33835"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33835\/revisions"}],"predecessor-version":[{"id":33852,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33835\/revisions\/33852"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33836"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33835"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33835"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33835"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}