{"id":33830,"date":"2021-12-26T11:31:45","date_gmt":"2021-12-26T11:31:45","guid":{"rendered":"https:\/\/care4calais.org\/?p=33830"},"modified":"2023-02-08T17:02:43","modified_gmt":"2023-02-08T16:02:43","slug":"the-young-refugees-of-calais","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-young-refugees-of-calais\/","title":{"rendered":"The young refugees of Calais"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Today on Boxing Day we went to the Fort site which is mainly visited by Sudanese men, though today there was a Kurd, an Afghan, an Iranian and a Romanian who was carrying all his worldly possessions with him.<\/p>\n<p>You could see he was struggling with anxiety and fear. Mental distress is a problem amongst the refugees, some have been trafficked, tortured, enslaved, beaten, hunted and hated, many before they even set off from their home country. I don’t think I could endure their<span class=\"text_exposed_show\"> life without my head fragmenting, in fact I’m certain of it. Many of the men I spoke to today had run away from Darfur in the Sudan which is a dangerous and brutal place to live.<\/span><\/p>\n<div class=\"text_exposed_show\">\n<p>We had many under 18s visiting us today, the youngest of whom was 13 years old, he’d set off from the Sudan when he was 11. I can not from my privileged position as a European imagine how an 11 year old walks from the Sudan to Calais, how they negotiate the dangers of Libya and the slavers, how he’d escaped the child traffickers who are everywhere along the refugee routes. It’s truly a miracle he’s here and heartbreaking that he has to be.<\/p>\n<p>I was struck by how all the older refugees treated the under 18s or bambino’s as they called them. There was real compassion and affection for them and they looked out for them. They asked me how my country allowed them to have to take the same dangerous routes as grown men, how they couldn’t see these children needed safety. I had to agree with them of course .. what has England become, or maybe it was always like this and I just hadn’t noticed.<\/p>\n<p>The picture is of Abdullah, a skilled barber who cut many of the men’s hair today. It helps to stay clean and well groomed when you can control nothing else.<\/p>\n<p>&#8211; Bob, volunteer<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Today on Boxing Day we went to the Fort site which is mainly visited by Sudanese men, though today there was a Kurd, an Afghan, an Iranian and a Romanian who was carrying all his worldly possessions with him. You could see he was struggling with anxiety and fear. Mental distress is a problem amongst the refugees, some have been trafficked, tortured, enslaved, beaten, hunted and hated, many before they even set off from their home country. I don’t think I could endure their life without my head fragmenting, in fact I’m certain of it. Many of the men I spoke to today had run away from Darfur in the Sudan which is a dangerous and brutal place to live. We had many under 18s visiting us today, the youngest of whom was 13 years old, he’d set off from the Sudan when he was 11. I can not from my privileged position as a European imagine how an 11 year old walks from the Sudan to Calais, how they negotiate the dangers of Libya and the slavers, how he’d escaped the child traffickers who are everywhere along the refugee routes. It’s truly a miracle he’s here and heartbreaking that he has to be. I was struck by how all the older refugees treated the under 18s or bambino’s as they called them. There was real compassion and affection for them and they looked out for them. They asked me how my country allowed them to have to take the same dangerous routes as grown men, how they couldn’t see these children needed safety. I had to agree with them of course .. what has England become, or maybe it was always like this and I just hadn’t noticed. The picture is of Abdullah, a skilled barber who cut many of the men’s hair today. It helps to stay clean and well groomed when you can control nothing else. &#8211; Bob, volunteer<\/p>\n","protected":false},"author":21,"featured_media":33848,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33830"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33830"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33830\/revisions"}],"predecessor-version":[{"id":33831,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33830\/revisions\/33831"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33848"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33830"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33830"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33830"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}