{"id":33878,"date":"2022-01-06T18:55:29","date_gmt":"2022-01-06T18:55:29","guid":{"rendered":"https:\/\/care4calais.org\/?p=33878"},"modified":"2022-01-06T18:55:29","modified_gmt":"2022-01-06T18:55:29","slug":"shauns-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/shauns-story\/","title":{"rendered":"Shaun&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Anyone can become an asylum seeker; you just don’t think it can happen to you.<br \/>\nI came to the UK because it is safe, and I speak English. It’s a fair country, and I knew I’d have a chance here. Last week I got my refugee status after two years of waiting, and today I picked up my card!<br \/>\nI grew up in Uganda. There are four of us in my family, and my father died when I was quite young so my mother brought us up. I went to a good school in Kampala with a lot of international students. That’s where my love of language began. I speak six languages: English, Arabic, Japanese, Swahili, Kikuyu, Taita, Portuguese, and some Chinese. French and German are next on my list to learn now I have asylum.<br \/>\nOverall I did well in school. I went to university in Nairobi to study cyber security management, and I got a good job when I finished. Everything was fine, but then something really bad happened, and I had to leave. I cannot talk about that, it is too hard. My journey here was also very traumatic and I cannot bear to think about.<br \/>\nBeing an asylum seeker is difficult. After you’re processed you’re given a room, a duvet, a mattress, and a few cooking utensils, nothing else.<br \/>\nFor two years I lived on £37 a week. It’s hard, but you just have to do it. If you have a roof over your head and somewhere to sleep you will survive.<br \/>\nWhat reality helped was when I was in a hotel last year, and I met a wonderful woman called Pauline. She was outside our hotel in Runcorn one night. She had brought things for the refugees in the hotel, and I talked with her, and I’ve been helping her ever since. She is my friend now.<br \/>\nNow with my card I can start my life again. I’ll wait to see where God takes me, but there are so many things I’d like to do. I’d quite like to be a nurse, as I really like helping people.<br \/>\nI cannot talk about the past. I wish I could erase it. But please understand how much I love my country and the family I left.<br \/>\nAnd please be kind to refugees; you do not know what we have had to leave behind us.<br \/>\nTo volunteer or donate please go <a href=\"https:\/\/care4calais.org\/get-involved\/\">here<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Anyone can become an asylum seeker; you just don’t think it can happen to you. I came to the UK because it is safe, and I speak English. It’s a fair country, and I knew I’d have a chance here. Last week I got my refugee status after two years of waiting, and today I picked up my card! I grew up in Uganda. There are four of us in my family, and my father died when I was quite young so my mother brought us up. I went to a good school in Kampala with a lot of international students. That’s where my love of language began. I speak six languages: English, Arabic, Japanese, Swahili, Kikuyu, Taita, Portuguese, and some Chinese. French and German are next on my list to learn now I have asylum. Overall I did well in school. I went to university in Nairobi to study cyber security management, and I got a good job when I finished. Everything was fine, but then something really bad happened, and I had to leave. I cannot talk about that, it is too hard. My journey here was also very traumatic and I cannot bear to think about. Being an asylum seeker is difficult. After you’re processed you’re given a room, a duvet, a mattress, and a few cooking utensils, nothing else. For two years I lived on £37 a week. It’s hard, but you just have to do it. If you have a roof over your head and somewhere to sleep you will survive. What reality helped was when I was in a hotel last year, and I met a wonderful woman called Pauline. She was outside our hotel in Runcorn one night. She had brought things for the refugees in the hotel, and I talked with her, and I’ve been helping her ever since. She is my friend now. Now with my card I can start my life again. I’ll wait to see where God takes me, but there are so many things I’d like to do. I’d quite like to be a nurse, as I really like helping people. I cannot talk about the past. I wish I could erase it. But please understand how much I love my country and the family I left. And please be kind to refugees; you do not know what we have had to leave behind us. To volunteer or donate please go here<\/p>\n","protected":false},"author":21,"featured_media":33879,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[104],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33878"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33878"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33878\/revisions"}],"predecessor-version":[{"id":33880,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33878\/revisions\/33880"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33879"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33878"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33878"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33878"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}