{"id":33927,"date":"2022-01-10T18:56:22","date_gmt":"2022-01-10T18:56:22","guid":{"rendered":"https:\/\/care4calais.org\/?p=33927"},"modified":"2022-01-10T19:04:45","modified_gmt":"2022-01-10T19:04:45","slug":"the-photography-of-former-refugee-abdul-saboor","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-photography-of-former-refugee-abdul-saboor\/","title":{"rendered":"The photography of former refugee Abdul Saboor"},"content":{"rendered":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">I left Afghanistan because they shot me. Not once, but three times. I don’t know who shot me or why, they were too far away to see. Afghanistan is a dangerous country – people do not follow rules, they do what they like.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The first time I was shot, it was was in my arm, and I treated the wound myself. The next time it was my leg, and the doctors wanted me to stay in hospital, but I wouldn’t stay. The last time was in my back, and that was bad; I stayed in the hospital for 10 days with that. The doctor said I should have stayed 40, and they were very cross with me when I wouldn’t stay. But when I was well, I left Afghanistan.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’ve not been back.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">When I left, I crossed into Pakistan, then Iran where they put me in prison and deported me back to Afghanistan. So I got back into Pakistan, and this time made it through Iran and into Turkey. Then I walked up through the Balkans, and I saw the horror the refugees suffer on this walk. In Serbia I started taking photos to show the stories.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I don’t really know why I started to take the photos, I just knew someone had to document the journeys that were being made in a way that the media were not. I used my phone at first, but later on in France, a kind volunteer have me a camera.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I kept taking photographs because I thought it was important to document everything. In many places, especially in the Balkans there were no journalists so many details of the refugee’s journey are not known.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I spent a year in Serbia, then I moved from Germany to France. I wasn’t really aiming at France – I didn’t know where would accept me. But two years ago I got my French papers so I’ll be staying here.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In Afghanistan I operated heavy machinery. Now in France I take photographs and teach photography at a university in Paris. I’ve done quite a bit with my pictures – I’ve done several exhibitions and been featured in newspaper articles. I live in Paris most of the time, but I spend a lot of time in Calais and Dunkirk in the refugee camps there.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I find it hard taking the photographs in the camps, because I know the pain of refugees. I have been there, I am them. I know the pain of loss, the fear of the journey and the crossing. I know how scared they are of the future, and how they are afraid for their children. I know how hard the life is, how cold they are and how hungry. And yet I must ask to take the photo. I stay with them though, I live there with them for sometime. They get to trust me, and let me tell their stories.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I keep going back because if I don’t tell their story who will? The media who are there for a day? They do not understand the life of a migrant. They do not look into a refugee’s eyes and see the pain, understand the suffering, but I do. Because I have been in that situation myself.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My best photo? It was when I found a group of refugees who had found a good place to sleep. They put up tents and cleaned the ground. Then the police came and destroyed the camp. When I photographed it, I saw the spear of light piercing the dark destruction. That is the hope of a refugee and it is always there, but sometimes you must look closely to find it.<\/div>\n<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-33932\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/01\/saboor-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/01\/saboor-300x200.jpg 300w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/01\/saboor-1024x683.jpg 1024w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/01\/saboor-768x512.jpg 768w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/01\/saboor-1536x1025.jpg 1536w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/01\/saboor.jpg 2048w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I like to take photos of the dark where the light finds a way through. The light is hope, it is a spiritual thing; there is always hope, but lately that light has become less and less. The darkness is the despair we feel when we leave our homes and find the hostility that welcomes us, but the light will always find a way in.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’m 29, I think (birthdays are not a thing in Afghanistan) but I’m tired today so I feel older – tomorrow I might be 28. I have a life in France now, and I must be happy with that, but I do miss Afghanistan. I miss my home, my family, and the countryside. I’ve missed important weddings and funerals, I’ve missed seeing my nephews grow. and I miss the food and the sun, the festivals and the music. Oh, and cricket – I really, really miss playing cricket.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But as long as there are refugees and there is light I will keep telling the story, but we must keep fighting for the light, because they cannot go back. Behind them, the light has gone out.<\/div>\n<\/div>\n<div dir=\"auto\">Abdul Saboor<\/div>\n","protected":false},"excerpt":{"rendered":"<p>I left Afghanistan because they shot me. Not once, but three times. I don’t know who shot me or why, they were too far away to see. Afghanistan is a dangerous country – people do not follow rules, they do what they like. The first time I was shot, it was was in my arm, and I treated the wound myself. The next time it was my leg, and the doctors wanted me to stay in hospital, but I wouldn’t stay. The last time was in my back, and that was bad; I stayed in the hospital for 10 days with that. The doctor said I should have stayed 40, and they were very cross with me when I wouldn’t stay. But when I was well, I left Afghanistan. I’ve not been back. When I left, I crossed into Pakistan, then Iran where they put me in prison and deported me back to Afghanistan. So I got back into Pakistan, and this time made it through Iran and into Turkey. Then I walked up through the Balkans, and I saw the horror the refugees suffer on this walk. In Serbia I started taking photos to show the stories. I don’t really know why I started to take the photos, I just knew someone had to document the journeys that were being made in a way that the media were not. I used my phone at first, but later on in France, a kind volunteer have me a camera. I kept taking photographs because I thought it was important to document everything. In many places, especially in the Balkans there were no journalists so many details of the refugee’s journey are not known. I spent a year in Serbia, then I moved from Germany to France. I wasn’t really aiming at France – I didn’t know where would accept me. But two years ago I got my French papers so I’ll be staying here. In Afghanistan I operated heavy machinery. Now in France I take photographs and teach photography at a university in Paris. I’ve done quite a bit with my pictures – I’ve done several exhibitions and been featured in newspaper articles. I live in Paris most of the time, but I spend a lot of time in Calais and Dunkirk in the refugee camps there. I find it hard taking the photographs in the camps, because I know the pain of refugees. I have been there, I am them. I know the pain of loss, the fear of the journey and the crossing. I know how scared they are of the future, and how they are afraid for their children. I know how hard the life is, how cold they are and how hungry. And yet I must ask to take the photo. I stay with them though, I live there with them for sometime. They get to trust me, and let me tell their stories. I keep going back because if I don’t tell their story who will? The media who are there for a day? They do not understand the life of a migrant. They do not look into a refugee’s eyes and see the pain, understand the suffering, but I do. Because I have been in that situation myself. My best photo? It was when I found a group of refugees who had found a good place to sleep. They put up tents and cleaned the ground. Then the police came and destroyed the camp. When I photographed it, I saw the spear of light piercing the dark destruction. That is the hope of a refugee and it is always there, but sometimes you must look closely to find it. I like to take photos of the dark where the light finds a way through. The light is hope, it is a spiritual thing; there is always hope, but lately that light has become less and less. The darkness is the despair we feel when we leave our homes and find the hostility that welcomes us, but the light will always find a way in. I’m 29, I think (birthdays are not a thing in Afghanistan) but I’m tired today so I feel older – tomorrow I might be 28. I have a life in France now, and I must be happy with that, but I do miss Afghanistan. I miss my home, my family, and the countryside. I’ve missed important weddings and funerals, I’ve missed seeing my nephews grow. and I miss the food and the sun, the festivals and the music. Oh, and cricket – I really, really miss playing cricket. But as long as there are refugees and there is light I will keep telling the story, but we must keep fighting for the light, because they cannot go back. Behind them, the light has gone out. Abdul Saboor<\/p>\n","protected":false},"author":21,"featured_media":33928,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[153,166,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33927"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33927"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33927\/revisions"}],"predecessor-version":[{"id":33933,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33927\/revisions\/33933"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33928"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33927"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33927"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33927"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}