{"id":33956,"date":"2022-01-11T19:57:37","date_gmt":"2022-01-11T19:57:37","guid":{"rendered":"https:\/\/care4calais.org\/?p=33956"},"modified":"2022-01-11T22:02:38","modified_gmt":"2022-01-11T22:02:38","slug":"solafas-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/solafas-story\/","title":{"rendered":"Solafa&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">It’s Heaven, really – it’s like Heaven. My children are in school, and the teachers are so kind. The education system in Gaza was a catastrophe. I’m Solafa and I’m from the Gaza strip. I lived there with my husband and our four young children, but it was a terrible place to live, just like a big jail, with no way out for us. It took us more than ten years to find a way to leave – we finally found a way out in July 2019, but it took us quite a while to get here.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I have a university degree in English and French and I worked as an interpreter for various organisations, online jobs and face-to-face work. I did not have a problem with the government in Gaza, but the political situation affects everyone. Raids and offensives happen frequently, and then there are the big fights.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’ll tell you about them, as you need to understand what it is like living in a never- ending war, and why we needed to leave.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The first big offensive I remember was 2008. It was horrible and very scary, with people running through the streets shouting and covered in blood. We had no electricity, and food supplies were very low. The Israeli army was bombing Gaza and we were hearing reports of attacks all the time. Then we heard about phosphorus attacks in our area. That was really scary, and there was no working transport to get out to other areas. My father was ill and needed dialysis every other day, so we had to put him in a donkey cart to find a taxi to get to the hotel where he could have the treatment.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Then we heard tanks were in the city, and we could hear shooting. At one point shrapnel from the bombs burst into my house. The reports I was reading said nowhere was safe.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Then in 2014 there was another offensive. That one lasted 50 days. I was eight months pregnant with my second child at the time. The building opposite me was fired on so much that it collapsed. Our building shook and the plaster fell off the ceiling from a missile being fired from an F16 plane overhead. I put my son on the bed and stood over him to protect him. The plaster fell on my back.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">All our windows were shattered, and the walls had long cracks in them. I can still feel the building shaking.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We called family to leave the city and stay outside. But even there, the planes were dropping leaflets telling us to leave – we just ignored them, as we had nowhere to go. We did try staying at a friend’s house, but missiles were landing there too. There was no safe place in Gaza.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Soon after that, my husband started having problems with Hamas and the government. He worked for the charity Caritas as a security driver. He would transport people from Gaza to Israel and back. Hamas wanted him to collect information for them. He refused and was arrested three times but still he refused.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But even when there are not offensives or problems like this, everyday life in Gaza is unsafe. There are no services, and even if you can go to hospital you’re scared because you do not know what will happen to you there. The one place you can relax is the seaside, but that is polluted with the detritus of prohibited weapons, and sewage is pumped into the seas making it impossible to swim. Often there is no drinking water and you have to buy it from trucks in the street.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Everyone wants to leave Gaza, but it’s still hard to go because it is home. It is everything you know.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It was not in our minds to come to the UK, we just wanted a safe life. We made plans to leave. We had passports but most countries do not accept Palestinian documents, and when you try to cross with them you are humiliated, ridiculed, and most likely detained. Hamas controls Gaza, and we tried many ways to get out but none worked. As I said, Gaza is like one big jail, and it’s impossible to get out. You have to have money and connections.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Eventually we paid an agent to get a Turkish visa in our passports. It was for one week only, from the Turkish embassy in the West Bank. I had a friend from university who was now in Abu Dhabi and she worked for a Palestinian politician with Egyptian connections. He exerted pressure on the Egyptians at the border and they let us in – that was the only crossing we could use.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">From Egypt we got a plane to Turkey via Greece. We were very lucky that we got this flight. Usually they do not let Palestinians get flights that stop in Europe because they know we will get off.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In Athens we claimed asylum. The authorities put us all in a detention centre for ten days, which was a nightmare. There were lice and bed bugs in the bedding, no sunlight and really bad food. We had to buy water from the vendors. There were all sorts of people coming and going with no thought for the safety of my children. Finally, after ten days we were released to the street.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We found a sublet in Athens for two months, but the children could not go to school because we had no papers. It was hard but we stayed 14 months in the end, trying to survive. But there are no jobs in Athens. We went on a programme to help refugees, but as that came to an end we faced the problem of being unable to pay our rent. It took eight months of queuing and battling horrific bureaucracy to finally get Greek documents that allowed us to travel.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Then we were so lucky. I managed to get a weekend return flight to London. We had thought of Belgium and Sweden, but for political reasons they do not grant asylum to Palestinians. When we got to London, on 13 September 13 2020 we claimed asylum once again. Two weeks ago I had my main interview, and now we have to wait.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">At first we were in emergency accommodation, but we were moved to a street that was all asylum seekers, all 22 houses. There were a lot of Kurdish people living there, but others too. We all arrived at the same time so we have become good friends.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Some of my new neighbours knew Care4Calais from the Crowne Plaza hotel in London. They called them and some lovely volunteers came out to see us. At first I really did not want to ask for anything, but I got to know one volunteer well and she became my friend. She would come and have tea and a chat with me as well as bring me clothes for the children.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">She asked if I had a solicitor. I said no, I didn’t know I needed one, and she put me in touch with the access team and I was put on the waiting list. After about a month a man called Aiden called me, he was great, and put me at ease as he really knew about Palestine and what was happening there. He kept in touch all the way through, asking if things had happened yet, pushing for things to happen.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My children are in school and that is so important to me. I like it here. No one makes me take my headscarf off, no one is rude about me wearing it. Even sorting out my documents only meant things had to be pushed back a little, and they were so nice about it too. Nowhere else in Europe is like this. It makes me confident we are in the right place. I can look forward to a future now.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; It’s Heaven, really – it’s like Heaven. My children are in school, and the teachers are so kind. The education system in Gaza was a catastrophe. I’m Solafa and I’m from the Gaza strip. I lived there with my husband and our four young children, but it was a terrible place to live, just like a big jail, with no way out for us. It took us more than ten years to find a way to leave – we finally found a way out in July 2019, but it took us quite a while to get here. I have a university degree in English and French and I worked as an interpreter for various organisations, online jobs and face-to-face work. I did not have a problem with the government in Gaza, but the political situation affects everyone. Raids and offensives happen frequently, and then there are the big fights. I’ll tell you about them, as you need to understand what it is like living in a never- ending war, and why we needed to leave. The first big offensive I remember was 2008. It was horrible and very scary, with people running through the streets shouting and covered in blood. We had no electricity, and food supplies were very low. The Israeli army was bombing Gaza and we were hearing reports of attacks all the time. Then we heard about phosphorus attacks in our area. That was really scary, and there was no working transport to get out to other areas. My father was ill and needed dialysis every other day, so we had to put him in a donkey cart to find a taxi to get to the hotel where he could have the treatment. Then we heard tanks were in the city, and we could hear shooting. At one point shrapnel from the bombs burst into my house. The reports I was reading said nowhere was safe. Then in 2014 there was another offensive. That one lasted 50 days. I was eight months pregnant with my second child at the time. The building opposite me was fired on so much that it collapsed. Our building shook and the plaster fell off the ceiling from a missile being fired from an F16 plane overhead. I put my son on the bed and stood over him to protect him. The plaster fell on my back. All our windows were shattered, and the walls had long cracks in them. I can still feel the building shaking. We called family to leave the city and stay outside. But even there, the planes were dropping leaflets telling us to leave – we just ignored them, as we had nowhere to go. We did try staying at a friend’s house, but missiles were landing there too. There was no safe place in Gaza. Soon after that, my husband started having problems with Hamas and the government. He worked for the charity Caritas as a security driver. He would transport people from Gaza to Israel and back. Hamas wanted him to collect information for them. He refused and was arrested three times but still he refused. But even when there are not offensives or problems like this, everyday life in Gaza is unsafe. There are no services, and even if you can go to hospital you’re scared because you do not know what will happen to you there. The one place you can relax is the seaside, but that is polluted with the detritus of prohibited weapons, and sewage is pumped into the seas making it impossible to swim. Often there is no drinking water and you have to buy it from trucks in the street. Everyone wants to leave Gaza, but it’s still hard to go because it is home. It is everything you know. It was not in our minds to come to the UK, we just wanted a safe life. We made plans to leave. We had passports but most countries do not accept Palestinian documents, and when you try to cross with them you are humiliated, ridiculed, and most likely detained. Hamas controls Gaza, and we tried many ways to get out but none worked. As I said, Gaza is like one big jail, and it’s impossible to get out. You have to have money and connections. Eventually we paid an agent to get a Turkish visa in our passports. It was for one week only, from the Turkish embassy in the West Bank. I had a friend from university who was now in Abu Dhabi and she worked for a Palestinian politician with Egyptian connections. He exerted pressure on the Egyptians at the border and they let us in – that was the only crossing we could use. From Egypt we got a plane to Turkey via Greece. We were very lucky that we got this flight. Usually they do not let Palestinians get flights that stop in Europe because they know we will get off. In Athens we claimed asylum. The authorities put us all in a detention centre for ten days, which was a nightmare. There were lice and bed bugs in the bedding, no sunlight and really bad food. We had to buy water from the vendors. There were all sorts of people coming and going with no thought for the safety of my children. Finally, after ten days we were released to the street. We found a sublet in Athens for two months, but the children could not go to school because we had no papers. It was hard but we stayed 14 months in the end, trying to survive. But there are no jobs in Athens. We went on a programme to help refugees, but as that came to an end we faced the problem of being unable to pay our rent. It took eight months of queuing and battling horrific bureaucracy to finally get Greek documents that allowed us to travel. Then we were so lucky. I managed to get a weekend [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":33957,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33956"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=33956"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33956\/revisions"}],"predecessor-version":[{"id":33958,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/33956\/revisions\/33958"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/33957"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=33956"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=33956"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=33956"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}