{"id":34123,"date":"2022-01-26T18:14:55","date_gmt":"2022-01-26T18:14:55","guid":{"rendered":"https:\/\/care4calais.org\/?p=34123"},"modified":"2022-01-26T18:14:55","modified_gmt":"2022-01-26T18:14:55","slug":"andreas-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/andreas-story\/","title":{"rendered":"Andrea&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">I left my home in Mexico three years ago just hoping to get a job paying enough for me to live on. I only meant to go to Cancun, but horrible things began to happen on the way, and I was abused and exploited in different countries for the next three years.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">My name is Andrea and I am 29. I was born in Tapachula, a small city near the Guatemala border. In Mexico gangs are always looking to see who has some money – they’re connected to the police, who look away or even organize kidnappings. One day people came to my house with guns and knives, and took my father away, and then we got demands to pay a ransom.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">It was a lot of money, but we paid. When we went to get him he was at the police station; it had been a weekend when the station was empty, and some of the police used it to hold my father. <\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">After that we moved to the countryside. It was a very beautiful place. In the night I could smell the coffee from the plantations, and the wild flowers that grew in the mountains. I used to sleep with my mum and she’d ask me to smell the coffee, it was very good coffee. It was a quiet, beautiful time. We were near a river and I would take a picnic there two or three times a week and read my books. I loved the history of the UK, and Emily Bronte’s Wuthering Heights.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">When I grew up and went to University, I planned to work  for some time and keep returning to the mountains and my family. I studied for a nursing degree at uni, but after I left I realised that Mexican public hospitals pay nothing, and the conditions are appalling. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">I worked for a while as a hostess in Mexican Caribbean, but had to work 6.30am to 11pm, and it was exhausting (I have poor health anyway) so I decided to go to Cancun to look for work with a friend. We got a taxi driver we knew to drive us (you have to use friends so you can be safe, you can’t just call any taxi) but on the way we were stopped at a supermarket when a car with black windows drove up and men inside told our driver to give him the girls. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">In Mexico gangs are always looking to see who has some money, even a small bit, and the police help them so it’s easy to take people. These men tried the doors, shouting, and I was so scared. Our taxi driver sped away with us and we escaped, but that was the start. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">In Cancun I checked into a hostel, and one night the receptionist came to say someone called Juan was there looking for me. I didn’t know a Juan, but I went to reception and this man, accompanied by four others, introduced himself with that name. When I said I wouldn’t go with them, he got cross. He said he would be back for me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I could not stay in Cancun, but my friend told me about an app you can use to find a sponsor to get you out of Mexico. I tried it, and I found a person in Dubai. I worried about what I was doing, but I had nothing, and no way to survive, so I accepted. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">He bought me a return ticket to Dubai and off I went. When I got there he took me to a hotel, and said I had to pay him back with my body. I had no choice. I was locked up there for five days until one day he went out, and I escaped to the airport. Luckily he had not taken my travel documents, and I got on a plane home.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">As it stopped in France I decided to get off there and try to get the UK, because I heard good things about it being a country of freedom. I had one friend in France from my university days, and he helped me with a ticket. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">I didn’t know how anything worked in England, and I could not speak the language, but I found another hostel, where I met a girl called Leoni. Leoni befriended me and bought everything I needed as I had no money. And she introduced me to a man she knew who she said could help me make some money to survive.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I trusted her, but the man put my body on his website and sold it. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">When I got sick with a fever, he got very mad at me for being ill. A Romanian man who worked with him took me to his house, and was good with me. He didn’t ask anything from me, and told me about claiming asylum.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">I read about asylum, and went to apply at the Home Office in Croydon, but it was closed. I waited for four hours, and then I went to a restaurant to eat. The restaurant was run by a Colombian man, and when I said I was from Mexico he invited me to his house saying his family would look after me. I was so happy, but there was no family; he was horrible, and wanted to have sex with me. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">At last I got my claim processed at the Home Office, but they wouldn’t give me accommodation or money as I had no port reference number, or Section 95 notice, which would have shown I was destitute. I had to go back to the hostel.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">I couldn’t pay as I had no money, but the manager said if I worked here I could stay free &#8211; it wasn’t brilliant work, but it was safe. And then one day, four months after I had been to the Home Office, a friend who is an asylum seeker gave me a telephone number and told me to text it. So I did. And that’s how I met Aiden.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Aiden works for the Care4Calais Access Team, which helps refugees find solicitors who help them to get their legal rights and make your claim progress. I got a text back from Aiden saying he could help me, and I should send him my information. He got me a section 95 quickly, and now I have a home and a little bit of money. I was moved to Stockton-on-Tees, but I’m very happy here. I like British culture, especially the music. I love the Rolling Stones.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I have a friend called Katie, who helps refugees like me, and she found that after one year I could get permission to work. Now I have a job in a care home for the elderly, and Katie still looks after me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">My journey took three years but it feels like three hundred; I’ve seen the ugly side of life, and I’ve aged so much. But England is different, the people are different – they make you safe and I am so happy for that. I miss my family of course – I talk to my mum all the time, she has been so worried about me. I really hope that this year she’ll visit me in the UK.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">My dad always said, in life there are no mistakes, only lessons; I have learned many of those.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; I left my home in Mexico three years ago just hoping to get a job paying enough for me to live on. I only meant to go to Cancun, but horrible things began to happen on the way, and I was abused and exploited in different countries for the next three years. &nbsp; My name is Andrea and I am 29. I was born in Tapachula, a small city near the Guatemala border. In Mexico gangs are always looking to see who has some money – they’re connected to the police, who look away or even organize kidnappings. One day people came to my house with guns and knives, and took my father away, and then we got demands to pay a ransom. &nbsp; It was a lot of money, but we paid. When we went to get him he was at the police station; it had been a weekend when the station was empty, and some of the police used it to hold my father.    After that we moved to the countryside. It was a very beautiful place. In the night I could smell the coffee from the plantations, and the wild flowers that grew in the mountains. I used to sleep with my mum and she’d ask me to smell the coffee, it was very good coffee. It was a quiet, beautiful time. We were near a river and I would take a picnic there two or three times a week and read my books. I loved the history of the UK, and Emily Bronte’s Wuthering Heights. &nbsp; When I grew up and went to University, I planned to work  for some time and keep returning to the mountains and my family. I studied for a nursing degree at uni, but after I left I realised that Mexican public hospitals pay nothing, and the conditions are appalling.  &nbsp; I worked for a while as a hostess in Mexican Caribbean, but had to work 6.30am to 11pm, and it was exhausting (I have poor health anyway) so I decided to go to Cancun to look for work with a friend. We got a taxi driver we knew to drive us (you have to use friends so you can be safe, you can’t just call any taxi) but on the way we were stopped at a supermarket when a car with black windows drove up and men inside told our driver to give him the girls.  &nbsp; In Mexico gangs are always looking to see who has some money, even a small bit, and the police help them so it’s easy to take people. These men tried the doors, shouting, and I was so scared. Our taxi driver sped away with us and we escaped, but that was the start.  &nbsp; In Cancun I checked into a hostel, and one night the receptionist came to say someone called Juan was there looking for me. I didn’t know a Juan, but I went to reception and this man, accompanied by four others, introduced himself with that name. When I said I wouldn’t go with them, he got cross. He said he would be back for me.   I could not stay in Cancun, but my friend told me about an app you can use to find a sponsor to get you out of Mexico. I tried it, and I found a person in Dubai. I worried about what I was doing, but I had nothing, and no way to survive, so I accepted.  &nbsp; He bought me a return ticket to Dubai and off I went. When I got there he took me to a hotel, and said I had to pay him back with my body. I had no choice. I was locked up there for five days until one day he went out, and I escaped to the airport. Luckily he had not taken my travel documents, and I got on a plane home. &nbsp; As it stopped in France I decided to get off there and try to get the UK, because I heard good things about it being a country of freedom. I had one friend in France from my university days, and he helped me with a ticket.  &nbsp; I didn’t know how anything worked in England, and I could not speak the language, but I found another hostel, where I met a girl called Leoni. Leoni befriended me and bought everything I needed as I had no money. And she introduced me to a man she knew who she said could help me make some money to survive.   I trusted her, but the man put my body on his website and sold it.  &nbsp; When I got sick with a fever, he got very mad at me for being ill. A Romanian man who worked with him took me to his house, and was good with me. He didn’t ask anything from me, and told me about claiming asylum. &nbsp; I read about asylum, and went to apply at the Home Office in Croydon, but it was closed. I waited for four hours, and then I went to a restaurant to eat. The restaurant was run by a Colombian man, and when I said I was from Mexico he invited me to his house saying his family would look after me. I was so happy, but there was no family; he was horrible, and wanted to have sex with me.  &nbsp; At last I got my claim processed at the Home Office, but they wouldn’t give me accommodation or money as I had no port reference number, or Section 95 notice, which would have shown I was destitute. I had to go back to the hostel. &nbsp; I couldn’t pay as I had no money, but the manager said if I worked here I could stay free &#8211; it wasn’t brilliant work, but it was safe. And then one day, four months after I had been to the Home Office, a [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":34122,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34123"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34123"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34123\/revisions"}],"predecessor-version":[{"id":34124,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34123\/revisions\/34124"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34122"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34123"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34123"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34123"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}