{"id":34167,"date":"2022-01-31T17:00:37","date_gmt":"2022-01-31T17:00:37","guid":{"rendered":"https:\/\/care4calais.org\/?p=34167"},"modified":"2022-02-01T10:35:29","modified_gmt":"2022-02-01T10:35:29","slug":"azizs-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/azizs-story\/","title":{"rendered":"Aziz&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Care4Calais helped me when I got to the UK, and I am so grateful, I can’t say the words to tell you how much. The most important thing they did was find me a solicitor, a very good one. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I am Aziz. I am 27, and from Darfur in Sudan.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sudan is a hard place, even the city, But Darfur is brutal. The war has been going too many years. It is not unusual to walk into the bush and find dead bodies or people who are dying. In the villages you see people shot for no reason every day.  Most people in Darfur are small farmers, they grow peanuts, corn, dura things like that, I did not want to do this. I don’t know why I was different, but I was determined to make a better life.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, when I was 19 I moved to Khartoum to study electrical engineering in the university. It wasn’t an easy time because there is so much racism against Darfurians there, but I finished my studies. It was quite a challenge getting to university. Darfur is very poor, and my family did not have jobs, so they couldn’t help me. But I was focused on my goal – I was smart, and I wanted to do something with my life. My brother helped me a lot, paying fees when I couldn’t. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I worked hard, and I taught myself English along the way. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Then in 2019 the revolution began. The universities closed and we started to demonstrate. The militia started shooting people, putting people in prison and beating people up. They knew me, and I was on their hit list. I am a street artist (I do painting and sculpture too) and I do graffiti on buildings. I had written anti-government slogans and drawn the Sudanese flag, so they were looking for me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I went back to my village in Darfur, but they followed me there, so I returned to the city where it is easier to hide. I went back and forth for some time, but finally the Janjaweed were in my village and they couldn’t  find me, so they set fire to my village and shot my brother. They destroyed the shambas (fields) and killed the livestock, leaving nothing so people could not live there anymore.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">After that I had to leave Sudan. I went to Chad, and then crossed the deserts in a small car with five others crammed in the back. It took three weeks to cross the Sahara; we saw many cars that did not make it. Finally we arrived in south Libya, a place you cannot really avoid if you want to cross the Mediterranean. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I found a smuggler to get me to Tripoli. Libya is a huge danger, there is no law and order and people do what they want but I had to take the chance; unfortunately he didn’t keep his word and he sold me to a kidnapper. This one moved us to another city and demanded money.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I said “I can’t pay, there is no one left in Sudan to pay you.” And so for four days we were left in a room with no water and no food while the guards beat us every day. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">After two weeks he asked me my job, and when he found out I was an electrician he told me I could work for him. After some time, he said, he would release me. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">He showed me the job, and I said I would need six or seven people to help me complete the job. I asked for all Sudani people and he gave them to me.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We worked day and night on the job, but always I was watching the guards, who got used to us. One night they smoked too much hashish and got very high, and they were drinking beer. They were not watching us – one of them was so drunk he could not even stand. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We took our chance and jumped over the wall and ran. One of the guards saw us but he was too drunk to chase us.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> <\/span><span style=\"font-weight: 400;\">I went back to Tripoli and this time found a smuggler to get me to Italy. This time I knew I could pay my way by working as an electrician. It took three months before he agreed to get me on a boat, but at last I got to Lampedusa. I was then moved to Sicily and held in a camp. The camp was like a prison. I was there for 36 days without going out.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Finally they released me and I went to Venice and then Milan, Ventimiglia and Nice. Getting into France was hard – I went back and forward a few times trying to evade the police. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The last time I met a French lady who said she would help me When the police came I said we must both go into the toilet and wait for them to knock. She trusted me and she did this thing. When the police knocked on the door she opened it and came out, and I stayed inside and they did not find me and I got into France.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">She later helped me get a train to Paris too. But in Paris I was very ill, and I had to sleep under a bridge. I couldn’t stay there, so I made my way to Calais.<\/span><\/p>\n<p><span style=\"font-weight: 400;\"> I went to a “jungle” but it was very unfriendly and no one wanted me there. I went to the beach to sleep instead. In the morning I got up and started making sand sculptures on the beach near the tourist area. So many people came to look at my paintings and gave me money, and at the end of the day I had £150! I went to the restaurant to buy food<\/span><\/p>\n<p><span style=\"font-weight: 400;\">And that night I managed to get on a lorry straight away and get to the UK!! God was looking out for me that day.<\/span><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I arrived in August 2021 and went to the police station in Newport, Wales. I made my body ready for a beating and for torture.  But they just asked me why I was at the station. The lady said, “I have to ask you to wear these handcuffs while I search you.” But they did not beat me; I could not believe it. They were really nice. When I said I thought they would beat me, they said “We do not do that here.” <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I was sent to a hotel in London, Wembley Central where I met a wonderful woman called Charlotte Khan and many other Care4Calais volunteers. And they put me in touch with the access team who got me a solicitor.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I want to do a lot of things now, but most of all I want to pursue my art. If I’m successful I want to buy my mum a house in Khartoum where she will be safe. Right now, though, I am not allowed to work or sell my art. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I do not really have any good memories of Darfur. It is dangerous just to go to the shop there, so I remember being scared! I suppose I miss the beauty of the forests and the mountains<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I wanted to come to the UK from the beginning because I speak English and would not have to start from zero. It is like I thought, most people are very kind – I haven’t met any horrible people yet. But you know, any country where the police do not beat you up for no reason is a good country. I am happy to be here.<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Care4Calais helped me when I got to the UK, and I am so grateful, I can’t say the words to tell you how much. The most important thing they did was find me a solicitor, a very good one.  I am Aziz. I am 27, and from Darfur in Sudan. Sudan is a hard place, even the city, But Darfur is brutal. The war has been going too many years. It is not unusual to walk into the bush and find dead bodies or people who are dying. In the villages you see people shot for no reason every day.  Most people in Darfur are small farmers, they grow peanuts, corn, dura things like that, I did not want to do this. I don’t know why I was different, but I was determined to make a better life. So, when I was 19 I moved to Khartoum to study electrical engineering in the university. It wasn’t an easy time because there is so much racism against Darfurians there, but I finished my studies. It was quite a challenge getting to university. Darfur is very poor, and my family did not have jobs, so they couldn’t help me. But I was focused on my goal – I was smart, and I wanted to do something with my life. My brother helped me a lot, paying fees when I couldn’t.  I worked hard, and I taught myself English along the way.  Then in 2019 the revolution began. The universities closed and we started to demonstrate. The militia started shooting people, putting people in prison and beating people up. They knew me, and I was on their hit list. I am a street artist (I do painting and sculpture too) and I do graffiti on buildings. I had written anti-government slogans and drawn the Sudanese flag, so they were looking for me. I went back to my village in Darfur, but they followed me there, so I returned to the city where it is easier to hide. I went back and forth for some time, but finally the Janjaweed were in my village and they couldn’t  find me, so they set fire to my village and shot my brother. They destroyed the shambas (fields) and killed the livestock, leaving nothing so people could not live there anymore. After that I had to leave Sudan. I went to Chad, and then crossed the deserts in a small car with five others crammed in the back. It took three weeks to cross the Sahara; we saw many cars that did not make it. Finally we arrived in south Libya, a place you cannot really avoid if you want to cross the Mediterranean.  I found a smuggler to get me to Tripoli. Libya is a huge danger, there is no law and order and people do what they want but I had to take the chance; unfortunately he didn’t keep his word and he sold me to a kidnapper. This one moved us to another city and demanded money. I said “I can’t pay, there is no one left in Sudan to pay you.” And so for four days we were left in a room with no water and no food while the guards beat us every day.  After two weeks he asked me my job, and when he found out I was an electrician he told me I could work for him. After some time, he said, he would release me.  He showed me the job, and I said I would need six or seven people to help me complete the job. I asked for all Sudani people and he gave them to me. We worked day and night on the job, but always I was watching the guards, who got used to us. One night they smoked too much hashish and got very high, and they were drinking beer. They were not watching us – one of them was so drunk he could not even stand.  We took our chance and jumped over the wall and ran. One of the guards saw us but he was too drunk to chase us.  I went back to Tripoli and this time found a smuggler to get me to Italy. This time I knew I could pay my way by working as an electrician. It took three months before he agreed to get me on a boat, but at last I got to Lampedusa. I was then moved to Sicily and held in a camp. The camp was like a prison. I was there for 36 days without going out. Finally they released me and I went to Venice and then Milan, Ventimiglia and Nice. Getting into France was hard – I went back and forward a few times trying to evade the police.  The last time I met a French lady who said she would help me When the police came I said we must both go into the toilet and wait for them to knock. She trusted me and she did this thing. When the police knocked on the door she opened it and came out, and I stayed inside and they did not find me and I got into France. She later helped me get a train to Paris too. But in Paris I was very ill, and I had to sleep under a bridge. I couldn’t stay there, so I made my way to Calais.  I went to a “jungle” but it was very unfriendly and no one wanted me there. I went to the beach to sleep instead. In the morning I got up and started making sand sculptures on the beach near the tourist area. So many people came to look at my paintings and gave me money, and at the end of the day I had £150! I went to the restaurant to buy food And that night I managed to get on a lorry straight away and get to the UK!! God was looking out for me [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":34191,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34167"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34167"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34167\/revisions"}],"predecessor-version":[{"id":34169,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34167\/revisions\/34169"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34191"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34167"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34167"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34167"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}