{"id":34162,"date":"2022-01-31T08:00:35","date_gmt":"2022-01-31T08:00:35","guid":{"rendered":"https:\/\/care4calais.org\/?p=34162"},"modified":"2022-01-31T08:05:51","modified_gmt":"2022-01-31T08:05:51","slug":"how-the-government-misleads-the-public-about-refugees","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/how-the-government-misleads-the-public-about-refugees\/","title":{"rendered":"How the Government misleads the public about refugees"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>One of the worst and most dangerous mistruths that this Government peddles is that refugee Channel crossings are “illegal”. As they know very well, the law allows refugees to come to the UK to claim asylum.<\/p>\n<p>A recent court of appeal ruling has shown that refugees coming to the UK on small boats are not arriving “illegally” if they intend to arrive at a port and claim asylum &#8211; which almost all of them do.<\/p>\n<p>In a court case on Thursday, Sir James Eadie QC, representing the home secretary, admitted to court that there had been a “misunderstanding” that “an illegal entry offence was always committed by passengers on small boats at the time.” He said they now recognised the mistake.<\/p>\n<p>This followed the appeal ruling last December, when the judge said that the law had been “misunderstood” by the Home Office and Crown Prosecution Service, and that a legal “heresy” developed making asylum seekers believe they had no defence to the charge of facilitating illegal entry.<\/p>\n<p>“As the law presently stands,” said Lord Justice Edie, “an asylum seeker who merely attempts to arrive at the frontiers of the United Kingdom in order to make a claim is not entering or attempting to enter the country unlawfully”.<\/p>\n<p>The question, as Stuart McDonald the SNP MP asked in parliament two weeks ago, is why do ministers keep using the word “illegal” to describe refugees seeking asylum when it has been made plain that they are within the law?<\/p>\n<p>Describing refugees as “illegal” is incredibly dangerous. It criminalises a group of people who have in fact done nothing wrong, and has many harmful associations; most resonable people would believe that someone who is classed as “illegal” is somehow at fault and therefore not deserving of fair treatment. With respect to refugees, this is wholly wrong.<\/p>\n<p>In the case of Government ministers, the negative effects are multiplied. We assume (or used to) that ministers are telling the truth; in this case their statements may have contributed to a misapplication of the law. For this reason it is even more important that they are held to account.<\/p>\n<p>Read more here: <a href=\"https:\/\/apple.news\/ARPU9mxE5SE2pJzYosmmp7A\">https:\/\/apple.news\/ARPU9mxE5SE2pJzYosmmp7A<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; One of the worst and most dangerous mistruths that this Government peddles is that refugee Channel crossings are “illegal”. As they know very well, the law allows refugees to come to the UK to claim asylum. A recent court of appeal ruling has shown that refugees coming to the UK on small boats are not arriving “illegally” if they intend to arrive at a port and claim asylum &#8211; which almost all of them do. In a court case on Thursday, Sir James Eadie QC, representing the home secretary, admitted to court that there had been a “misunderstanding” that “an illegal entry offence was always committed by passengers on small boats at the time.” He said they now recognised the mistake. This followed the appeal ruling last December, when the judge said that the law had been “misunderstood” by the Home Office and Crown Prosecution Service, and that a legal “heresy” developed making asylum seekers believe they had no defence to the charge of facilitating illegal entry. “As the law presently stands,” said Lord Justice Edie, “an asylum seeker who merely attempts to arrive at the frontiers of the United Kingdom in order to make a claim is not entering or attempting to enter the country unlawfully”. The question, as Stuart McDonald the SNP MP asked in parliament two weeks ago, is why do ministers keep using the word “illegal” to describe refugees seeking asylum when it has been made plain that they are within the law? Describing refugees as “illegal” is incredibly dangerous. It criminalises a group of people who have in fact done nothing wrong, and has many harmful associations; most resonable people would believe that someone who is classed as “illegal” is somehow at fault and therefore not deserving of fair treatment. With respect to refugees, this is wholly wrong. In the case of Government ministers, the negative effects are multiplied. We assume (or used to) that ministers are telling the truth; in this case their statements may have contributed to a misapplication of the law. For this reason it is even more important that they are held to account. Read more here: https:\/\/apple.news\/ARPU9mxE5SE2pJzYosmmp7A &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":34164,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34162"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34162"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34162\/revisions"}],"predecessor-version":[{"id":34163,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34162\/revisions\/34163"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34164"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34162"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34162"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34162"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}