{"id":34171,"date":"2022-01-28T09:52:39","date_gmt":"2022-01-28T09:52:39","guid":{"rendered":"https:\/\/care4calais.org\/?p=34171"},"modified":"2023-02-08T17:00:15","modified_gmt":"2023-02-08T16:00:15","slug":"refugees-face-constant-danger-in-calais","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/refugees-face-constant-danger-in-calais\/","title":{"rendered":"Refugees face constant danger in Calais"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\"><\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">\n<p><span style=\"font-weight: 400;\"> On Tuesday the dead body of a young man we understand to be a refugee was found on a road near the port in Calais. The cause of his death has not been confirmed, but his injuries suggest he fell from, or was struck by, a lorry. It is not known how long his body had been there.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Horrifically this is the third confirmed refugee death in northern France already this year, and it’s likely that there have been at least two more.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">On January 14, Azzeidin, a Sudanese man in his 20s, died at sea when the boat in which he was trying to reach the UK got into trouble off the French coast. There were reports that two or three more men were missing, and none of them have been found.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The following day, January 15, and 18-year-old from Sudan man was crushed by lorry in Calais.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">These heartbreaking statistics do not include the hospitalisations of refugees hit by lorries or injured in evictions &#8211; and there are many of those.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So many deaths and injuries so early in the year brings home the dangers refugees face, and the appalling fact that our government will not take action to stop it. To caring, compassionate people, these tragedies are unbearable; young men who have fled persecution, torture and death dying alone, in agony, so far from their homes and families. The atrocious spectacle could be ended by the introduction of a system allowing refugees in France to claim asylum in the UK and and receive safe passage.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Every day, and with every refugee death in northern France, the UK government’s refusal to adopt a reasonable system seems less comprehensible, and more irresponsible. How many deaths on our border will it take?<\/span><\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp;  On Tuesday the dead body of a young man we understand to be a refugee was found on a road near the port in Calais. The cause of his death has not been confirmed, but his injuries suggest he fell from, or was struck by, a lorry. It is not known how long his body had been there. Horrifically this is the third confirmed refugee death in northern France already this year, and it’s likely that there have been at least two more. On January 14, Azzeidin, a Sudanese man in his 20s, died at sea when the boat in which he was trying to reach the UK got into trouble off the French coast. There were reports that two or three more men were missing, and none of them have been found. The following day, January 15, and 18-year-old from Sudan man was crushed by lorry in Calais. These heartbreaking statistics do not include the hospitalisations of refugees hit by lorries or injured in evictions &#8211; and there are many of those. So many deaths and injuries so early in the year brings home the dangers refugees face, and the appalling fact that our government will not take action to stop it. To caring, compassionate people, these tragedies are unbearable; young men who have fled persecution, torture and death dying alone, in agony, so far from their homes and families. The atrocious spectacle could be ended by the introduction of a system allowing refugees in France to claim asylum in the UK and and receive safe passage. Every day, and with every refugee death in northern France, the UK government’s refusal to adopt a reasonable system seems less comprehensible, and more irresponsible. How many deaths on our border will it take?<\/p>\n","protected":false},"author":21,"featured_media":34172,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34171"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34171"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34171\/revisions"}],"predecessor-version":[{"id":38215,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34171\/revisions\/38215"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34172"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}