{"id":34289,"date":"2022-02-06T11:22:38","date_gmt":"2022-02-06T11:22:38","guid":{"rendered":"https:\/\/care4calais.org\/?p=34289"},"modified":"2023-02-08T16:57:24","modified_gmt":"2023-02-08T15:57:24","slug":"sharing-is-caring","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/sharing-is-caring\/","title":{"rendered":"Sharing is Caring"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\"><\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">\n<p><span style=\"font-weight: 400;\">The other day we found some leftover advent calendars among the food supplies. They were still in their eat-by dates, so we took them out on a food distribution to ask if any of the refugees wanted them.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It turned out they really did! In fact They went crazy for them. OK, you might think, if you’re sleeping rough and finding it hard to find food to eat, of course you’re going to go crazy for a little luxury like chocolate. But that wasn’t the whole story.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“Pick a number, one to 24!” said one guy to me, coming up with a big, door-studded cardboard Santa in his hand.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When I chose 12, he found the number 12 compartment, popped it open and handed me the chocolate from inside. I accepted it, and looking around I saw the same routine being played out between other refugees and volunteers: pick a number, pick a number.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">They weren’t just crazy for the chocolate, they also just wanted the chance to share.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We forget how hard it is to be on the receiving end of charity constantly, having something that you can give to someone else is so important for our self esteem.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Having 24 mini chocolates meant they could offer us some and share with us, and it created a brilliant atmosphere as we all laughed and tucked into the tiny chocolate snowman, robins and stars there on that bleak site in northern France.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It was one of those moments when the work Care4Calais does helps to restore a little bit of human dignity to people, and it made me feel truly proud of the work our organisation does.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To volunteer or donate, go to<\/span><a href=\"http:\/\/care4calais.org\/\"><span style=\"font-weight: 400;\"> care4calais.org<\/span><\/a><\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; The other day we found some leftover advent calendars among the food supplies. They were still in their eat-by dates, so we took them out on a food distribution to ask if any of the refugees wanted them. It turned out they really did! In fact They went crazy for them. OK, you might think, if you’re sleeping rough and finding it hard to find food to eat, of course you’re going to go crazy for a little luxury like chocolate. But that wasn’t the whole story. “Pick a number, one to 24!” said one guy to me, coming up with a big, door-studded cardboard Santa in his hand. When I chose 12, he found the number 12 compartment, popped it open and handed me the chocolate from inside. I accepted it, and looking around I saw the same routine being played out between other refugees and volunteers: pick a number, pick a number. They weren’t just crazy for the chocolate, they also just wanted the chance to share. We forget how hard it is to be on the receiving end of charity constantly, having something that you can give to someone else is so important for our self esteem. Having 24 mini chocolates meant they could offer us some and share with us, and it created a brilliant atmosphere as we all laughed and tucked into the tiny chocolate snowman, robins and stars there on that bleak site in northern France. It was one of those moments when the work Care4Calais does helps to restore a little bit of human dignity to people, and it made me feel truly proud of the work our organisation does. To volunteer or donate, go to care4calais.org<\/p>\n","protected":false},"author":21,"featured_media":34290,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34289"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34289"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34289\/revisions"}],"predecessor-version":[{"id":38208,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34289\/revisions\/38208"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34290"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34289"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34289"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34289"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}