{"id":34334,"date":"2022-02-11T18:17:57","date_gmt":"2022-02-11T18:17:57","guid":{"rendered":"https:\/\/care4calais.org\/?p=34334"},"modified":"2023-02-08T16:57:41","modified_gmt":"2023-02-08T15:57:41","slug":"love-knitting-and-togetherness-in-manchester","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/love-knitting-and-togetherness-in-manchester\/","title":{"rendered":"Love, knitting and togetherness in Manchester"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>It’s amazing how our volunteers find a way to use their skills to make a huge difference to refugees – sometimes it can be a simple thing, and yet it leads to such heartwarming experiences for so many people. Brenda and Liz’s knitting group in Manchester is like that.<\/p>\n<p>Just before Christmas, one of Brenda’s relatives donated a huge amount of knitting needles and wool to the Manchester warehouse. Juliet, who runs the warehouse had the idea of setting up a knitting club at one of the airport hotels where many of the Afghan refugees are staying.<\/p>\n<p>So they put a shout out for a knitter – and Brenda was volunteered! She went to the hotel to meet Liz, another volunteer who had also stepped forward, and they agreed to run a group together.<\/p>\n<p>“The first time,” Brenda says, “we were very busy, and the ladies crowded round us wanting wool and needles. There were lots of young girls wanting to join in too. To be honest it was a bit chaotic, and full of chattering excitement! But it was a new thing and the ladies were very excited after being stuck in the hotel for so long with little to do.<\/p>\n<p>“Anyway, we muddled on through – we had to ban the young boys, as the needles were perfect foils for sword fighting which was just a bit dangerous! Of course if any of them had wanted to learn to knit they could have happily stayed with us, and everyone was ok about this,.<\/p>\n<p>“This wasn’t a teaching session really, more of a social activity, a space to connect and to talk. The young girls seemed to gravitate to me, and so I had a lot of chattering going on. Some girls were practising their English, and the younger ones were just happy with the pretty-coloured wool.<\/p>\n<p>“The atmosphere felt really good, indescribable really, they were so happy just chatting, and it was just wonderful to see everyone just sitting and forgetting where they were for a short time.<\/p>\n<p>“We learned to cast on and off and knit some scarves, but to be honest we didn’t do a lot of knitting. The output wasn’t what was important – it was the camaraderie of the moment.<\/p>\n<p>“The next session was much calmer as we knew what to expect! One of the ladies asked for a crochet hook as she knew how to crochet. We hadn’t got any so I said I’d bring some the next time. So later that week I found myself trawling round all the charity shops in Manchester looking for crochet hooks! I did find a few and took them to the hotel. The ladies can crochet very well and made some lovely little dresses for the younger children. The children had a go too and were so proud of the little chains they made.<\/p>\n<p>“It has been a learning experience for me too – I was aware of the refugee crisis, and I knew Afghan refugees were in Manchester, but I hadn’t met any people who had come. I had not thought about how hard it was to be stuck in the same hotel room with your children for months on end with nothing to do. It’s great to see what Care4Calais, does for them, and the amount of public good will towards them is incredible. The donations have been amazing – so much wool and so many needles!<\/p>\n<p>“I met this one young girl who was an excellent crocheter, and I asked her if she wanted to take her work away with her so she could finish it at night. But she said no, she would prefer to leave it with me for next time as it was something special to look forward to. She said night time was for school work, and that was important to her.<\/p>\n<p>“I’ve been surprised at how much I enjoy doing this group and meeting the ladies. It has certainly given me a much better understanding of the world we live in. It’s an hour when I can switch off the pressures of my life, and realise how lucky I really am – and that small things can really make a difference to others.”<\/p>\n<p>We’re so proud of the difference that volunteers like Liz and Brenda make to the people we help. If you can volunteer or donate, please go to care4calais.org\/donate<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; It’s amazing how our volunteers find a way to use their skills to make a huge difference to refugees – sometimes it can be a simple thing, and yet it leads to such heartwarming experiences for so many people. Brenda and Liz’s knitting group in Manchester is like that. Just before Christmas, one of Brenda’s relatives donated a huge amount of knitting needles and wool to the Manchester warehouse. Juliet, who runs the warehouse had the idea of setting up a knitting club at one of the airport hotels where many of the Afghan refugees are staying. So they put a shout out for a knitter – and Brenda was volunteered! She went to the hotel to meet Liz, another volunteer who had also stepped forward, and they agreed to run a group together. “The first time,” Brenda says, “we were very busy, and the ladies crowded round us wanting wool and needles. There were lots of young girls wanting to join in too. To be honest it was a bit chaotic, and full of chattering excitement! But it was a new thing and the ladies were very excited after being stuck in the hotel for so long with little to do. “Anyway, we muddled on through – we had to ban the young boys, as the needles were perfect foils for sword fighting which was just a bit dangerous! Of course if any of them had wanted to learn to knit they could have happily stayed with us, and everyone was ok about this,. “This wasn’t a teaching session really, more of a social activity, a space to connect and to talk. The young girls seemed to gravitate to me, and so I had a lot of chattering going on. Some girls were practising their English, and the younger ones were just happy with the pretty-coloured wool. “The atmosphere felt really good, indescribable really, they were so happy just chatting, and it was just wonderful to see everyone just sitting and forgetting where they were for a short time. “We learned to cast on and off and knit some scarves, but to be honest we didn’t do a lot of knitting. The output wasn’t what was important – it was the camaraderie of the moment. “The next session was much calmer as we knew what to expect! One of the ladies asked for a crochet hook as she knew how to crochet. We hadn’t got any so I said I’d bring some the next time. So later that week I found myself trawling round all the charity shops in Manchester looking for crochet hooks! I did find a few and took them to the hotel. The ladies can crochet very well and made some lovely little dresses for the younger children. The children had a go too and were so proud of the little chains they made. “It has been a learning experience for me too – I was aware of the refugee crisis, and I knew Afghan refugees were in Manchester, but I hadn’t met any people who had come. I had not thought about how hard it was to be stuck in the same hotel room with your children for months on end with nothing to do. It’s great to see what Care4Calais, does for them, and the amount of public good will towards them is incredible. The donations have been amazing – so much wool and so many needles! “I met this one young girl who was an excellent crocheter, and I asked her if she wanted to take her work away with her so she could finish it at night. But she said no, she would prefer to leave it with me for next time as it was something special to look forward to. She said night time was for school work, and that was important to her. “I’ve been surprised at how much I enjoy doing this group and meeting the ladies. It has certainly given me a much better understanding of the world we live in. It’s an hour when I can switch off the pressures of my life, and realise how lucky I really am – and that small things can really make a difference to others.” We’re so proud of the difference that volunteers like Liz and Brenda make to the people we help. If you can volunteer or donate, please go to care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":34335,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34334"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34334"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34334\/revisions"}],"predecessor-version":[{"id":34336,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34334\/revisions\/34336"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34335"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34334"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34334"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34334"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}