{"id":34357,"date":"2022-02-10T10:35:23","date_gmt":"2022-02-10T10:35:23","guid":{"rendered":"https:\/\/care4calais.org\/?p=34357"},"modified":"2022-02-14T10:38:14","modified_gmt":"2022-02-14T10:38:14","slug":"sampsons-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/sampsons-story\/","title":{"rendered":"Sampson’s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">There has been so much fighting between Eritrea and other countries in the last few years, and now the government uses its young people to guard the borders. They tell you it’s only for a year or two, but some people never get away. And many of us get killed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Like everyone, I had to join the army when i was 18. When I had served a while I realised there was no chance of me ever getting out again. I wanted to escape, but it’s really dangerous getting over the border with Ethiopia or Sudan- you can be shot on sight.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">One day I saw a vegetable truck delivering to the barracks so I snuck into the back of the truck and hid. Somehow no one saw me or missed me, and I stayed hidden for 55 kilometres to the border with Ethiopia. I got out of the truck at a small village, and next I got on a truck to Sudan. I rode with them over the desert to Libya.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The journey over the desert took two weeks, and it was hard. We had hardly any water, and there were 100 people crammed like cattle in the back of the truck with me. Eight of them died on the journey, poisoned because the only water they had was mixed with diesel.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My grandmother, who had escaped to Dubai in 2002, paid some Libyan smugglers to get me onto a boat to Italy. I landed in Sicily in September 2016, and from there Sicily I travelled through Italy and France to Germany. I got a job in Germany as a delivery driver, but it was very hard as I didn’t speak German.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My father said I should go to the UK as I could speak English, and would be able to get a job. So I went to Calais, and at last crossed into the UK on February 10 2020.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But that was only the beginning. I was in housing in Runcorn, but my interview never came, and I was just stuck with no money, and unable to work; I felt like no one on earth wanted me.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">And then one day, 18 months after I arrived. I met a Care4Calais volunteer called Pauline.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">She said she would help me, and she wrote to her MP, Mike Amesbury asking for help in October 2021. He wrote to the Home Office asking for an update on asylum seekers in his constituency. It must have worked because by January 12 2022 I’d got my interview and I was granted asylum!<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Now I have 28 days to find somewhere to live. This is not so easy but I know. it is up to me to make a life and I feel so much happier now I have been accepted. I am married, and my wife is with my little sister in a a camp in Uganda; I had to leave them as they would not have survived the desert crossing. My next challenge for me is getting them over here. They are safe in the camp, but it is a difficult life and I always tried to send them money from my £39 a week.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Runcorn is not a bad place but I’d like to be in a bigger city like Manchester or Liverpool where there are Amazon warehouses as I want to work as a delivery driver for them. There is no Amazon warehouse in Runcorn. But first I have to apply for my driving license and pass the test so I am practising the theory test on line very hard.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Of course at times I miss my home and my family. I lived just outside Asmara, the capital city, which is very beautiful. I loved the Red Sea near Massawa, where we swam on holidays when I was a child. It was so beautiful, clean and warm, but it seems so far away and long ago now but still a clear memory of my home.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But this is my home now and I am grateful to be here. I like the respect everyone shows to other people and it makes me feel very safe. I also like the comedy programmes, Kevin Hart is my favourite, he is so funny. I also like to watch the news, I like the way it tells the true story and things are not hidden. I like the UK very much, and I feel I can make a life here.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Samson<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2Fcare4calais.org%2F&amp;h=AT0cM9LIDN0NWn9ZJhTJxYy-x7Ay9-TWFSt_SZhWYKBMicz7QrPF9_Awdi1u6Cv77S6cU21STtWA8a0w5pTUB2naDpf89u3e5v2-sm-EF5Ldl5GbXMxTh8FLWwSX2X96FDUyCTgGxlDpoXPu14rq&amp;__tn__=-UK-R&amp;c[0]=AT3rX20tVi6wA_HmeB8aAcgNgsusu-gGIiGt8Qk_EN_uQYTicH-Rtht4yu_kM8vv7Fw1Vh8db2RDH3GNVSjCltqeu_fL-kx4hswi4bd_PiPOA8yAYOfybCHkYV0VPvPIAAzmLLX86wcvWNSOWxu9sDlg3ZwXogUr5ekKReKOrSIi0WLOML4548hxcNgvQu2csuPNj9VV\" target=\"_blank\" rel=\"nofollow noopener\">care4calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; There has been so much fighting between Eritrea and other countries in the last few years, and now the government uses its young people to guard the borders. They tell you it’s only for a year or two, but some people never get away. And many of us get killed. Like everyone, I had to join the army when i was 18. When I had served a while I realised there was no chance of me ever getting out again. I wanted to escape, but it’s really dangerous getting over the border with Ethiopia or Sudan- you can be shot on sight. One day I saw a vegetable truck delivering to the barracks so I snuck into the back of the truck and hid. Somehow no one saw me or missed me, and I stayed hidden for 55 kilometres to the border with Ethiopia. I got out of the truck at a small village, and next I got on a truck to Sudan. I rode with them over the desert to Libya. The journey over the desert took two weeks, and it was hard. We had hardly any water, and there were 100 people crammed like cattle in the back of the truck with me. Eight of them died on the journey, poisoned because the only water they had was mixed with diesel. My grandmother, who had escaped to Dubai in 2002, paid some Libyan smugglers to get me onto a boat to Italy. I landed in Sicily in September 2016, and from there Sicily I travelled through Italy and France to Germany. I got a job in Germany as a delivery driver, but it was very hard as I didn’t speak German. My father said I should go to the UK as I could speak English, and would be able to get a job. So I went to Calais, and at last crossed into the UK on February 10 2020. But that was only the beginning. I was in housing in Runcorn, but my interview never came, and I was just stuck with no money, and unable to work; I felt like no one on earth wanted me. And then one day, 18 months after I arrived. I met a Care4Calais volunteer called Pauline. She said she would help me, and she wrote to her MP, Mike Amesbury asking for help in October 2021. He wrote to the Home Office asking for an update on asylum seekers in his constituency. It must have worked because by January 12 2022 I’d got my interview and I was granted asylum! Now I have 28 days to find somewhere to live. This is not so easy but I know. it is up to me to make a life and I feel so much happier now I have been accepted. I am married, and my wife is with my little sister in a a camp in Uganda; I had to leave them as they would not have survived the desert crossing. My next challenge for me is getting them over here. They are safe in the camp, but it is a difficult life and I always tried to send them money from my £39 a week. Runcorn is not a bad place but I’d like to be in a bigger city like Manchester or Liverpool where there are Amazon warehouses as I want to work as a delivery driver for them. There is no Amazon warehouse in Runcorn. But first I have to apply for my driving license and pass the test so I am practising the theory test on line very hard. Of course at times I miss my home and my family. I lived just outside Asmara, the capital city, which is very beautiful. I loved the Red Sea near Massawa, where we swam on holidays when I was a child. It was so beautiful, clean and warm, but it seems so far away and long ago now but still a clear memory of my home. But this is my home now and I am grateful to be here. I like the respect everyone shows to other people and it makes me feel very safe. I also like the comedy programmes, Kevin Hart is my favourite, he is so funny. I also like to watch the news, I like the way it tells the true story and things are not hidden. I like the UK very much, and I feel I can make a life here. Samson To volunteer or donate go to care4calais.org<\/p>\n","protected":false},"author":21,"featured_media":34358,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34357"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34357"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34357\/revisions"}],"predecessor-version":[{"id":34359,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34357\/revisions\/34359"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34358"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34357"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34357"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34357"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}