{"id":34360,"date":"2022-02-08T10:38:25","date_gmt":"2022-02-08T10:38:25","guid":{"rendered":"https:\/\/care4calais.org\/?p=34360"},"modified":"2022-02-14T10:41:28","modified_gmt":"2022-02-14T10:41:28","slug":"elizabeth-and-the-meaning-of-volunteering","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/elizabeth-and-the-meaning-of-volunteering\/","title":{"rendered":"Elizabeth and the meaning of volunteering"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Bishop Desmond Tutu once said, “If you are neutral in situations of injustice, you have chosen the side of the oppressor’. It’s a quote I try to live by. Care4Calais offers me a very proactive way of not standing by and actively taking the side of the oppressed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Care4Calais has given me the opportunity, as a volunteer, to oppose injustice in a very practical way. I love this charity and it’s genuine, deeply committed leadership. I have enjoyed meeting some wonderful people from all parts of the world. I have been impressed with the resilience and fortitude of the asylum seekers I have met. I have expanded my geographic, political and social knowledge and I have gained much more than I have given.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I live in a very beautiful place and I do realise how lucky I am. I am now retired but have had a very varied working life starting as a nurse , then Social Worker, Estate Agent and ending up as a Chartered Surveyor. We moved from the Tyneside conurbation to the wilds of Northumberland on retirement as we felt we needed a fresh challenge, it’s been great fun living in a lovely cottage with fields and sheep for neighbours. Volunteering is a great way to give back, to say thank you for all we have been lucky to have in this life.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">A couple of years ago I became a collection point for donations in Newcastle, where I lived. Soon after that I also began to support asylum seekers in the northeast, and that’s when things began to be really interesting. My husband David, is also a volunteer, and together we did visits, deliveries, and collections, and sourced items that were needed. I was so impressed by the people we met, and will forever remember them; adapting, learning and supporting each other as they integrate into a new society and move on from the traumas that prompted their journey to the U.K.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My name is Elizabeth, and I’ve now taken on the role of lead volunteer for the North East. It’s busy, as numbers of asylum seekers here are growing quickly and we have new referrals almost every day. However, I do have a fantastic team of volunteers to share the load.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The North East team of volunteers are great. They offer so much time and commitment to provide a really good service. They are great people to know, a really diverse bunch of folk; young students, working Mums and Dads and retired people. I have enjoyed getting to know them, I’m impressed with their commitment and energy and talent. We all have something different to offer. I like keeping us connected.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I have also met some wonderful donors, who either give much needed clothing and shoes, and others who have arranged fundraisers that has resulted in a healthy Golden Giving account giving us the recent opportunity to purchase 50 pairs of new trainers. We also made so many Santa sacks for delivery at Christmas last year.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Of course there are challenges, there simply aren’t enough hours in a day to do everything that needs doing. But mostly it’s that we can’t fulfill every need, we don’t have the expertise, experience or resources to do everything we would like to. I regularly recall Clare Moseley saying even if we just help one asylum seeker it makes a difference.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Sometimes it all becomes overwhelming, there doesn’t seem to be any time off. I can’t speak for the other members of the team but sometimes I feel so weary and lacking in energy, I wish I had a back up battery!<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">However, I wouldn’t stop for anything! I am very proud to be part of this organisation and appreciate all efforts made in so many ways by so many people. We help so many people and Care4Calais makes as easy as possible to do so and do so safely.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/donate\" target=\"_blank\" rel=\"nofollow noopener\">care4calais.org\/donate<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Bishop Desmond Tutu once said, “If you are neutral in situations of injustice, you have chosen the side of the oppressor’. It’s a quote I try to live by. Care4Calais offers me a very proactive way of not standing by and actively taking the side of the oppressed. Care4Calais has given me the opportunity, as a volunteer, to oppose injustice in a very practical way. I love this charity and it’s genuine, deeply committed leadership. I have enjoyed meeting some wonderful people from all parts of the world. I have been impressed with the resilience and fortitude of the asylum seekers I have met. I have expanded my geographic, political and social knowledge and I have gained much more than I have given. I live in a very beautiful place and I do realise how lucky I am. I am now retired but have had a very varied working life starting as a nurse , then Social Worker, Estate Agent and ending up as a Chartered Surveyor. We moved from the Tyneside conurbation to the wilds of Northumberland on retirement as we felt we needed a fresh challenge, it’s been great fun living in a lovely cottage with fields and sheep for neighbours. Volunteering is a great way to give back, to say thank you for all we have been lucky to have in this life. A couple of years ago I became a collection point for donations in Newcastle, where I lived. Soon after that I also began to support asylum seekers in the northeast, and that’s when things began to be really interesting. My husband David, is also a volunteer, and together we did visits, deliveries, and collections, and sourced items that were needed. I was so impressed by the people we met, and will forever remember them; adapting, learning and supporting each other as they integrate into a new society and move on from the traumas that prompted their journey to the U.K. My name is Elizabeth, and I’ve now taken on the role of lead volunteer for the North East. It’s busy, as numbers of asylum seekers here are growing quickly and we have new referrals almost every day. However, I do have a fantastic team of volunteers to share the load. The North East team of volunteers are great. They offer so much time and commitment to provide a really good service. They are great people to know, a really diverse bunch of folk; young students, working Mums and Dads and retired people. I have enjoyed getting to know them, I’m impressed with their commitment and energy and talent. We all have something different to offer. I like keeping us connected. I have also met some wonderful donors, who either give much needed clothing and shoes, and others who have arranged fundraisers that has resulted in a healthy Golden Giving account giving us the recent opportunity to purchase 50 pairs of new trainers. We also made so many Santa sacks for delivery at Christmas last year. Of course there are challenges, there simply aren’t enough hours in a day to do everything that needs doing. But mostly it’s that we can’t fulfill every need, we don’t have the expertise, experience or resources to do everything we would like to. I regularly recall Clare Moseley saying even if we just help one asylum seeker it makes a difference. Sometimes it all becomes overwhelming, there doesn’t seem to be any time off. I can’t speak for the other members of the team but sometimes I feel so weary and lacking in energy, I wish I had a back up battery! However, I wouldn’t stop for anything! I am very proud to be part of this organisation and appreciate all efforts made in so many ways by so many people. We help so many people and Care4Calais makes as easy as possible to do so and do so safely. To volunteer or donate go to care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":34361,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34360"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34360"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34360\/revisions"}],"predecessor-version":[{"id":34362,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34360\/revisions\/34362"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34361"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34360"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34360"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34360"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}