{"id":34538,"date":"2021-07-20T16:22:01","date_gmt":"2021-07-20T16:22:01","guid":{"rendered":"https:\/\/care4calais.org\/?p=34538"},"modified":"2022-06-17T08:26:14","modified_gmt":"2022-06-17T08:26:14","slug":"the-nationality-and-borders-bill","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-nationality-and-borders-bill\/","title":{"rendered":"The Nationality and Borders Bill"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">The Nationality and Borders Bill, which was debated in the Commons today, has made me think about how I got involved with refugees six years ago.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I came from a corporate background, and knew nothing of humanitarian work, politics or world affairs. I went to Calais because I had vaguely heard about the problems there, but you don&#8217;t believe it till you see it.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The people I met there changed my understanding of the world.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I didn’t help them because they had fled terrible wars, or suffered awful persecution. No; I got stuck in because there were hungry, cold people in front of me who needed help, and it felt normal and human to reach out to them.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">That normal, human kindness and decency is what’s really missing from the Nationality and Borders Bill.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Now we’ve read it, we know it’s true aim – essentially, the removal of rights of many of the refugees who come to the UK.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">No wonder people are calling it “the anti-refugee bill”.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Don’t forget: this bill, if passed, would make it a criminal offence to enter the UK without an official permit. Judges will be able to sentence refugees who do so for up to four years.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It would allow the government to send asylum seekers to other countries to have their claims processed &#8211; a move that would hugely damage already-traumatised people.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">And it would almost certainly contravene the 1951 Refugee Convention.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It is quite simply denial of common human decency.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Those of us who work with refugees know the vast majority have no choice but to travel illegally.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Dictators don’t issue visas. People lose passports in wars and conflicts. Being forced to travel “without permission” is simply part of being a refugee.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This Government says refugees should use resettlement schemes, which are pretty much the only ‘legal’ route that exists.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But less than one per cent of refugees get chosen for them. What is the other 99 per cent meant to do?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But in any case, the way someone travels is NOT how we decide who is and who isn’t a genuine refugee.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">A refugee is a person who has been forced to leave their country in order to escape war or persecution. Someone who if they go home could very well face death.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Those are the people you need to think of. When this Government talks of illegal ways of travelling it is just trying to distract you. To make you think its ok not to help refugees.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It is a lie.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Let’s not get drawn into a debate about whether or not people in Calais are deserving of help . – whether they are “genuine” refugees or not. Why even raise that question? If a fireman goes to a house to put out a fire, do they stop outside and ask who is in the house or whether they are worth saving?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Of course not.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">So why with refugees must they be deserving of our help?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To think they are not deserving flies in the face of all evidence.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">When you get to know people in Calais, and hear about the horrors they have suffered, you understand why they are willing to take such terrible risks as crossing the Channel in small, flimsy boats.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’m haunted by the stories i’ve heard.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">From the hundreds of people who have been sold as slaves, tortured or raped in Libya.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">From people who, the same country, were electrocuted while their families heard them scream down the phone.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">From the Syrian refugees, lovely people who explain how every single family has been hit by the conflict in the country, and how they had to leave their homes and families ot save their lives.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">From people in Yemen who have watched their families starve to death in front of them.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Can you imagine watching a loved one slowly starve to death?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">These experiences are so harrowing that I spend a lot of time in my day to day life finding mental health support not only for the victims, but also for our volunteers. Having spoken to refugees, many of them are traumatised themselves.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">There was a particularly unpleasant episode last year, when this government was trying to deport as many asylum seekers as possible. They knew that Brexit was coming, and it would make deporting people harder.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">At that time, I visited hotels full of asylum seekers who knew that these deportations were taking place.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I cannot describe the atmosphere of pervasive fear I found. Vans were coming to these hotels and taking groups of people in the night. Everyone was terrified that they would be next.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I talked to the people in the hotels and I talked to them when they were locked in detention centres. Those conversations are what I imagine it to be like to talk to someone on death row.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">By law, they probably should not even have been deported. And yet we were putting some of the most vulnerable people on earth – people we should have been protecting – through yet another hell.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Why? Simply because of politics.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The anti-refugee bill will bring all that back &#8211; but it will be worse, and more commonplace. People who ask only for our help will be cruelly punished and traumatised again.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I do not mention all this to shock you. I just want to explain why it is absolutely clear to me that the people I’m working with every day are, beyond doubt, “genuine refugees”.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">And why the Nationality and Borders Bill is fundamentally, morally wrong.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It is based on untruths about refugees, and seeks to exploit them for political ends.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It’s time to decide who we are as a country. As caring people, do we look out for the most vulnerable, and treat them with fairness, dignity and respect?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Or do we create misleading new laws that criminalise people turning to us for help?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This horrific, anti-refugee bill assumes that we want to deny that help. I know in my heart that’s wrong.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">So let’s fight it.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Sign every petition you see.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Write to your MP.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Share everything on social media.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Because we simply cannot – must not – let it happen.<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; The Nationality and Borders Bill, which was debated in the Commons today, has made me think about how I got involved with refugees six years ago. I came from a corporate background, and knew nothing of humanitarian work, politics or world affairs. I went to Calais because I had vaguely heard about the problems there, but you don&#8217;t believe it till you see it. The people I met there changed my understanding of the world. I didn’t help them because they had fled terrible wars, or suffered awful persecution. No; I got stuck in because there were hungry, cold people in front of me who needed help, and it felt normal and human to reach out to them. That normal, human kindness and decency is what’s really missing from the Nationality and Borders Bill. Now we’ve read it, we know it’s true aim – essentially, the removal of rights of many of the refugees who come to the UK. No wonder people are calling it “the anti-refugee bill”. Don’t forget: this bill, if passed, would make it a criminal offence to enter the UK without an official permit. Judges will be able to sentence refugees who do so for up to four years. It would allow the government to send asylum seekers to other countries to have their claims processed &#8211; a move that would hugely damage already-traumatised people. And it would almost certainly contravene the 1951 Refugee Convention. It is quite simply denial of common human decency. Those of us who work with refugees know the vast majority have no choice but to travel illegally. Dictators don’t issue visas. People lose passports in wars and conflicts. Being forced to travel “without permission” is simply part of being a refugee. This Government says refugees should use resettlement schemes, which are pretty much the only ‘legal’ route that exists. But less than one per cent of refugees get chosen for them. What is the other 99 per cent meant to do? But in any case, the way someone travels is NOT how we decide who is and who isn’t a genuine refugee. A refugee is a person who has been forced to leave their country in order to escape war or persecution. Someone who if they go home could very well face death. Those are the people you need to think of. When this Government talks of illegal ways of travelling it is just trying to distract you. To make you think its ok not to help refugees. It is a lie. Let’s not get drawn into a debate about whether or not people in Calais are deserving of help . – whether they are “genuine” refugees or not. Why even raise that question? If a fireman goes to a house to put out a fire, do they stop outside and ask who is in the house or whether they are worth saving? Of course not. So why with refugees must they be deserving of our help? To think they are not deserving flies in the face of all evidence. When you get to know people in Calais, and hear about the horrors they have suffered, you understand why they are willing to take such terrible risks as crossing the Channel in small, flimsy boats. I’m haunted by the stories i’ve heard. From the hundreds of people who have been sold as slaves, tortured or raped in Libya. From people who, the same country, were electrocuted while their families heard them scream down the phone. From the Syrian refugees, lovely people who explain how every single family has been hit by the conflict in the country, and how they had to leave their homes and families ot save their lives. From people in Yemen who have watched their families starve to death in front of them. Can you imagine watching a loved one slowly starve to death? These experiences are so harrowing that I spend a lot of time in my day to day life finding mental health support not only for the victims, but also for our volunteers. Having spoken to refugees, many of them are traumatised themselves. There was a particularly unpleasant episode last year, when this government was trying to deport as many asylum seekers as possible. They knew that Brexit was coming, and it would make deporting people harder. At that time, I visited hotels full of asylum seekers who knew that these deportations were taking place. I cannot describe the atmosphere of pervasive fear I found. Vans were coming to these hotels and taking groups of people in the night. Everyone was terrified that they would be next. I talked to the people in the hotels and I talked to them when they were locked in detention centres. Those conversations are what I imagine it to be like to talk to someone on death row. By law, they probably should not even have been deported. And yet we were putting some of the most vulnerable people on earth – people we should have been protecting – through yet another hell. Why? Simply because of politics. The anti-refugee bill will bring all that back &#8211; but it will be worse, and more commonplace. People who ask only for our help will be cruelly punished and traumatised again. I do not mention all this to shock you. I just want to explain why it is absolutely clear to me that the people I’m working with every day are, beyond doubt, “genuine refugees”. And why the Nationality and Borders Bill is fundamentally, morally wrong. It is based on untruths about refugees, and seeks to exploit them for political ends. It’s time to decide who we are as a country. As caring people, do we look out for the most vulnerable, and treat them with fairness, dignity and respect? Or do we create misleading new laws that criminalise people turning to us for help? This horrific, anti-refugee bill assumes that we want to deny that help. I know [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":34539,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34538"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34538"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34538\/revisions"}],"predecessor-version":[{"id":34540,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34538\/revisions\/34540"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34539"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34538"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34538"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34538"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}