{"id":34553,"date":"2021-08-02T16:53:09","date_gmt":"2021-08-02T16:53:09","guid":{"rendered":"https:\/\/care4calais.org\/?p=34553"},"modified":"2022-05-10T18:37:49","modified_gmt":"2022-05-10T18:37:49","slug":"gamars-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/gamars-story\/","title":{"rendered":"Gamar’s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">“In the death boats the troughs and crests of the waves we faced in the Mediterranean mirrored the highs and lows of my journey to the UK. Every time you overcame one challenge, another one, higher and faster, came at you, and you just had to hunch down and face it.”<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Gamar’s journey from Darfur in Sudan to Birmingham in the UK has been arduous and horrific.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Once a teacher in Sudan, he first made his escape across the Sahara, where he saw grotesque sights including dead bodies scattered and decomposing in the sun.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Then he crossed Libya, where he was assaulted, tortured and held for ransom. He made it to Italy and France before finally being forced to make a nightmare crossing to the UK in a refrigerated truck.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Such experiences are beyond what most of us can imagine, but he has described them brilliantly and movingly in a book “A Tale of a Refugee”, published by UK Book Publishing and now available on Amazon.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“I needed to get it out of my head and onto paper,” he says, “I wrote it so that people will know that journeys like mine are not easy.”<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Most of the books that I buy are on Africa and the refugee crisis, but this one is really special. I knew Gamar back in 2016, when I was volunteering with Care4Calais in the Calais Jungle. Gamar made it to the UK just as the Jungle was razed to the ground.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I remembered that like many, he had nothing when he got here except a big personality and a willingness to help others.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">After reading his moving book, I picked up my phone and gave him a call to ask where the last six years had gone, and how he was doing.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“When I got to the UK I knew I was safe, but after a while you begin to think about what you have been through.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“You miss home and your family. I began to feel really down and sad. I was lonely, it was a hard time, but I knew others had had it much harder than me. I decided everyone needed to know why people become refugees and what the journey is like, not only physically but emotionally.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“As a refugee, your emotions are like another rollercoaster that churns your stomach. You wonder what’s happening back home: will your people miss you? Have you made a mistake? Who will take care of them?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“But you know that if you’d stayed, you’d be dead. It all goes round in your head all the time.”<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Having been granted asylum, Gamar now has his own house, and has been reunited with his wife and children, one of whom was a small baby when he left Sudan.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Looking at him now, you would never know there was such a story behind this kind, smiling man. He’s been busy in other ways too.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“I joined the Birmingham Opera –that is such fun, and I really came to like the music! It is just so different from Sudanese music. Lizzie from Care4Calais, a brilliant opera singer, introduced me to it.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“I’ve also finished my Masters degree from Aston University and did quite a bit of interpreting to help other refugees.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“Having been a teacher back in Sudan, I knew that’s what I want to do here – although I really, really wanted to be a diplomat.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“Of course I miss Sudan, it was my home. I miss the sun and spending lazy days by the White Nile swimming, eating Sudanese food and just socializing. We’d sing and dance together – those are happy memories, and recalling them makes me feel very melancholy.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“But I am here now and safe. You know that’s really all people want – security and peace. When you read my book you’ll see how important that is.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“You wouldn’t undertake my journey if life in Darfur was safe.”<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">If you would like to understand more of the journey a refugee must take to get to the UK, “A Tale of a Refugee” by Gamar Abdulrahman is on sale now at Amazon priced £7.99.<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; “In the death boats the troughs and crests of the waves we faced in the Mediterranean mirrored the highs and lows of my journey to the UK. Every time you overcame one challenge, another one, higher and faster, came at you, and you just had to hunch down and face it.” Gamar’s journey from Darfur in Sudan to Birmingham in the UK has been arduous and horrific. Once a teacher in Sudan, he first made his escape across the Sahara, where he saw grotesque sights including dead bodies scattered and decomposing in the sun. Then he crossed Libya, where he was assaulted, tortured and held for ransom. He made it to Italy and France before finally being forced to make a nightmare crossing to the UK in a refrigerated truck. Such experiences are beyond what most of us can imagine, but he has described them brilliantly and movingly in a book “A Tale of a Refugee”, published by UK Book Publishing and now available on Amazon. “I needed to get it out of my head and onto paper,” he says, “I wrote it so that people will know that journeys like mine are not easy.” Most of the books that I buy are on Africa and the refugee crisis, but this one is really special. I knew Gamar back in 2016, when I was volunteering with Care4Calais in the Calais Jungle. Gamar made it to the UK just as the Jungle was razed to the ground. I remembered that like many, he had nothing when he got here except a big personality and a willingness to help others. After reading his moving book, I picked up my phone and gave him a call to ask where the last six years had gone, and how he was doing. “When I got to the UK I knew I was safe, but after a while you begin to think about what you have been through. “You miss home and your family. I began to feel really down and sad. I was lonely, it was a hard time, but I knew others had had it much harder than me. I decided everyone needed to know why people become refugees and what the journey is like, not only physically but emotionally. “As a refugee, your emotions are like another rollercoaster that churns your stomach. You wonder what’s happening back home: will your people miss you? Have you made a mistake? Who will take care of them? “But you know that if you’d stayed, you’d be dead. It all goes round in your head all the time.” Having been granted asylum, Gamar now has his own house, and has been reunited with his wife and children, one of whom was a small baby when he left Sudan. Looking at him now, you would never know there was such a story behind this kind, smiling man. He’s been busy in other ways too. “I joined the Birmingham Opera –that is such fun, and I really came to like the music! It is just so different from Sudanese music. Lizzie from Care4Calais, a brilliant opera singer, introduced me to it. “I’ve also finished my Masters degree from Aston University and did quite a bit of interpreting to help other refugees. “Having been a teacher back in Sudan, I knew that’s what I want to do here – although I really, really wanted to be a diplomat. “Of course I miss Sudan, it was my home. I miss the sun and spending lazy days by the White Nile swimming, eating Sudanese food and just socializing. We’d sing and dance together – those are happy memories, and recalling them makes me feel very melancholy. “But I am here now and safe. You know that’s really all people want – security and peace. When you read my book you’ll see how important that is. “You wouldn’t undertake my journey if life in Darfur was safe.” If you would like to understand more of the journey a refugee must take to get to the UK, “A Tale of a Refugee” by Gamar Abdulrahman is on sale now at Amazon priced £7.99.<\/p>\n","protected":false},"author":21,"featured_media":34554,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34553"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34553"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34553\/revisions"}],"predecessor-version":[{"id":34555,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34553\/revisions\/34555"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34554"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34553"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34553"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34553"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}