{"id":34559,"date":"2021-08-07T17:01:15","date_gmt":"2021-08-07T17:01:15","guid":{"rendered":"https:\/\/care4calais.org\/?p=34559"},"modified":"2024-02-26T12:45:15","modified_gmt":"2024-02-26T11:45:15","slug":"meet-zeynab-the-mother-of-distribution","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/meet-zeynab-the-mother-of-distribution\/","title":{"rendered":"Volunteer stories: Zeynab"},"content":{"rendered":"<p>The house they gave them was infested with cockroaches, it was leaking and damp all the way through. Plaster was falling off the wall and it looked like no-one had lived there for years and years. It was just in an appalling condition and this family, new to the UK was supposed to sign a 12 months lease. The family had a small baby and a two year old son. Mum was very strong, surprisingly so, given what they had been through and they refused to sign the tenancy. But to their horror they were not offered another hotel or house but were thrown out onto the street- they were literally walking the street for hours after midnight.<\/p>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Luckily Care4Calais came to the rescue and put the family in a travel lodge for two nights while the Home Officer were contacted, and alternative accommodation demanded.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This was my first family, I was contacted as I was the closest volunteer, so I went to visit them in their new house with some essential supplies such as food, nappies and baby clothes. We have remained in contact ever since. As soon as they got on their feet they invited me to share their cuisine, they wanted to give back for the help they got. I’ve found refugees to be the most positive and resilient people.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I started volunteering as my sister had been out to Calais and had told me all about the conditions there, but I really didn’t have the time to go to Calais. then she told me Care4Calais had groups across the UK. So I applied to annie@care4calais.org, did my DBS and some training and got started.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Early on me and my brother were dropping some stuff off to a hotel when I saw a bunch of young men milling about outside. It was winter but they had no coats and were wearing flips flops. i wondered if they were refugees and if they needed anything. I was so nervous, but i plucked up my courage and went over to them. It was so easy after that, they were all so nice to me and asked me for a few things, so i made a list and said we’d be back.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We started collecting stuff and it’s amazing the number of things we were given, my mum gets upset with all the bags and boxes in her house, so at least that makes us give most stuff out quickly. We’ve been able to give out 50 date boxes for Ramadan, help at the hotels and in dispersal accommodation.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I love to see the progress people make, from when they first arrive to when they feel safe and understand how to get around and access services in the UK. This is why Care4Calais is so important, it is the only charity that meets the refugees face to face regularly for social events, sports, chats, games and a cup of tea. This is so important for mental health. Some of the young men are stuck in a hostel for over a year not being able to do anything. Care4Calais changes that and gives them something to look forward to.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The other great thing about Care4Calais and why it is so loved by the refugees is that it is a massive network throughout the UK. No matter where I get a request from or a place a refugee is sent to, I can find a group or person in the area to help them and to get them what they need. The network is like a spider’s web reaching every corner of the UK, it is a brilliant living thing, it’s geographical mobility! This got me a nickname the other day when I got something for a refugee many miles from me, I got a text back saying, “Thank You Mother of Distribution”. I think it was a google translate error, but it made me smile.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">At first it was emotionally very hard, so many people wanted things that I didn’t have and i would try to get them straight away which was just impossible. But now i have set myself boundaries and I am very clear with the refugees about what I can and cannot do. There is a group of us, and we can support each other and ask for help when we need it.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Today I am going my group at a new hotel where 130 people have been sent. We are doing a bit of an emergency distribution. I know we will be very short on decent shoes. Sourcing shoes that are not worn out is the biggest difficulty clothes wise.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I have now got my cousins involved and my brother will soon be joining the group.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’m about to start my Master’s degree and working with refugees has given me food for thought. My degree is Urban Landscapes and Town Planning and I have come to realise how important free outside gyms and outside spaces are for all people, not just refugees. I also would like to implement easy, free transport systems. It’s just about inclusivity and making life fair for all.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">&#8211; Zeynab, volunteer<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>The house they gave them was infested with cockroaches, it was leaking and damp all the way through. Plaster was falling off the wall and it looked like no-one had lived there for years and years. It was just in an appalling condition and this family, new to the UK was supposed to sign a 12 months lease. The family had a small baby and a two year old son. Mum was very strong, surprisingly so, given what they had been through and they refused to sign the tenancy. But to their horror they were not offered another hotel or house but were thrown out onto the street- they were literally walking the street for hours after midnight. Luckily Care4Calais came to the rescue and put the family in a travel lodge for two nights while the Home Officer were contacted, and alternative accommodation demanded. This was my first family, I was contacted as I was the closest volunteer, so I went to visit them in their new house with some essential supplies such as food, nappies and baby clothes. We have remained in contact ever since. As soon as they got on their feet they invited me to share their cuisine, they wanted to give back for the help they got. I’ve found refugees to be the most positive and resilient people. I started volunteering as my sister had been out to Calais and had told me all about the conditions there, but I really didn’t have the time to go to Calais. then she told me Care4Calais had groups across the UK. So I applied to annie@care4calais.org, did my DBS and some training and got started. Early on me and my brother were dropping some stuff off to a hotel when I saw a bunch of young men milling about outside. It was winter but they had no coats and were wearing flips flops. i wondered if they were refugees and if they needed anything. I was so nervous, but i plucked up my courage and went over to them. It was so easy after that, they were all so nice to me and asked me for a few things, so i made a list and said we’d be back. We started collecting stuff and it’s amazing the number of things we were given, my mum gets upset with all the bags and boxes in her house, so at least that makes us give most stuff out quickly. We’ve been able to give out 50 date boxes for Ramadan, help at the hotels and in dispersal accommodation. I love to see the progress people make, from when they first arrive to when they feel safe and understand how to get around and access services in the UK. This is why Care4Calais is so important, it is the only charity that meets the refugees face to face regularly for social events, sports, chats, games and a cup of tea. This is so important for mental health. Some of the young men are stuck in a hostel for over a year not being able to do anything. Care4Calais changes that and gives them something to look forward to. The other great thing about Care4Calais and why it is so loved by the refugees is that it is a massive network throughout the UK. No matter where I get a request from or a place a refugee is sent to, I can find a group or person in the area to help them and to get them what they need. The network is like a spider’s web reaching every corner of the UK, it is a brilliant living thing, it’s geographical mobility! This got me a nickname the other day when I got something for a refugee many miles from me, I got a text back saying, “Thank You Mother of Distribution”. I think it was a google translate error, but it made me smile. At first it was emotionally very hard, so many people wanted things that I didn’t have and i would try to get them straight away which was just impossible. But now i have set myself boundaries and I am very clear with the refugees about what I can and cannot do. There is a group of us, and we can support each other and ask for help when we need it. Today I am going my group at a new hotel where 130 people have been sent. We are doing a bit of an emergency distribution. I know we will be very short on decent shoes. Sourcing shoes that are not worn out is the biggest difficulty clothes wise. I have now got my cousins involved and my brother will soon be joining the group. I’m about to start my Master’s degree and working with refugees has given me food for thought. My degree is Urban Landscapes and Town Planning and I have come to realise how important free outside gyms and outside spaces are for all people, not just refugees. I also would like to implement easy, free transport systems. It’s just about inclusivity and making life fair for all. &#8211; Zeynab, volunteer To volunteer or donate go to Care4Calais.org<\/p>\n","protected":false},"author":21,"featured_media":34560,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34559"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34559"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34559\/revisions"}],"predecessor-version":[{"id":43004,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34559\/revisions\/43004"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34560"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34559"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34559"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34559"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}