{"id":34571,"date":"2021-08-13T17:12:01","date_gmt":"2021-08-13T17:12:01","guid":{"rendered":"https:\/\/care4calais.org\/?p=34571"},"modified":"2022-06-17T08:37:53","modified_gmt":"2022-06-17T08:37:53","slug":"attack-causes-not-symptoms","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/attack-causes-not-symptoms\/","title":{"rendered":"Attack causes, not symptoms!"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">We now know what made the young Eritrean man who died in the sea off Calais yesterday so desperate to leave France.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The 27-year-old had been staying in camp near Calais. In recent days the police were aggressive and violent, taking tents and belongings and harassing people so they could no longer stay even in this rough camp.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In the police’s wake came the smugglers, offering the only way out – a dangerous trip in a small, overloaded boat across the world’s busiest shipping channel.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It takes a lot of luck to make that journey.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The Eritrean couple’s luck ran out.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">There were 37 in their boat, a hopeless overloading. Just off the coast, in choppy conditions, it began to take on water.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Five men jumped overboard and tried to swim back to the shore. The man who died was among them; in the attempt he suffered a heart attack and was airlifted from the water only to die in hospital later.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The French prosecutor has said it may press manslaughter charges against the smugglers concerned. Justified? Probably. The solution? No.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The awful truth is that in this situation, prosecuting one smuggler is – tragically – almost meaningless. It is attacking the symptom, while entirely ignoring the cause.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">What killed this young man – this boyfriend, this son, this mate – was not just a people smuggler.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It was the conditions in the camp that drove him to leave.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It was the current unspeakably horrific situation in Eritrea that made him flee his home before that.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">And it was the ignorance, unkindness and callousness he will have encountered at every stage of his journey.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">If we want these deaths and this suffering to stop, we need to face up to that, and stop looking for convenient scapegoats when something goes wrong.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The real solution isn’t even all that difficult. It has been pointed out over and over again that a modern system that would allow people to claim asylum in the UK without risking their lives is long overdue, and perfectly feasible.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">That system, together with a modicum of compassion and understanding, would remove the opportunity for people smugglers in the first place. If the French and British governments really cared, that is what they’d be discussing right now.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We know they won’t be. We know they, and many other people, will soon forget this tragedy.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But we’ll keep on campaigning until this awful, disgraceful situation is sorted out.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Please support us.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\"><a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/donate\" target=\"_blank\" rel=\"nofollow noopener\">care4calais.org\/donate<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We now know what made the young Eritrean man who died in the sea off Calais yesterday so desperate to leave France. The 27-year-old had been staying in camp near Calais. In recent days the police were aggressive and violent, taking tents and belongings and harassing people so they could no longer stay even in this rough camp. In the police’s wake came the smugglers, offering the only way out – a dangerous trip in a small, overloaded boat across the world’s busiest shipping channel. It takes a lot of luck to make that journey. The Eritrean couple’s luck ran out. There were 37 in their boat, a hopeless overloading. Just off the coast, in choppy conditions, it began to take on water. Five men jumped overboard and tried to swim back to the shore. The man who died was among them; in the attempt he suffered a heart attack and was airlifted from the water only to die in hospital later. The French prosecutor has said it may press manslaughter charges against the smugglers concerned. Justified? Probably. The solution? No. The awful truth is that in this situation, prosecuting one smuggler is – tragically – almost meaningless. It is attacking the symptom, while entirely ignoring the cause. What killed this young man – this boyfriend, this son, this mate – was not just a people smuggler. It was the conditions in the camp that drove him to leave. It was the current unspeakably horrific situation in Eritrea that made him flee his home before that. And it was the ignorance, unkindness and callousness he will have encountered at every stage of his journey. If we want these deaths and this suffering to stop, we need to face up to that, and stop looking for convenient scapegoats when something goes wrong. The real solution isn’t even all that difficult. It has been pointed out over and over again that a modern system that would allow people to claim asylum in the UK without risking their lives is long overdue, and perfectly feasible. That system, together with a modicum of compassion and understanding, would remove the opportunity for people smugglers in the first place. If the French and British governments really cared, that is what they’d be discussing right now. We know they won’t be. We know they, and many other people, will soon forget this tragedy. But we’ll keep on campaigning until this awful, disgraceful situation is sorted out. Please support us. care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":34572,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34571"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34571"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34571\/revisions"}],"predecessor-version":[{"id":36530,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34571\/revisions\/36530"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34572"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34571"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34571"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34571"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}