{"id":34589,"date":"2021-08-26T17:25:14","date_gmt":"2021-08-26T17:25:14","guid":{"rendered":"https:\/\/care4calais.org\/?p=34589"},"modified":"2022-05-09T09:02:40","modified_gmt":"2022-05-09T09:02:40","slug":"meet-miriam-part-syrian-part-palestinian-volunteer","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/meet-miriam-part-syrian-part-palestinian-volunteer\/","title":{"rendered":"Meet Miriam, part-Syrian, part-Palestinian volunteer"},"content":{"rendered":"<p>My dad is Syrian and my mom is Palestinian, but I was born in America. Coming from countries with two of the world’s biggest refugee populations, I think I’ve always been aware of how life can turn upside down and anyone can suddenly become a refugee.<\/p>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It’s a lesson that has surely been brought home to all of us by recent events in Afghanistan. For my part, I could be living in Palestine or Syria right now; it’s just by winning the geographic lottery that I’m not. But coming to Calais and seeing the situation first-hand has only made this feeling more potent.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’ve been studying in France for a while now, and have volunteered in Ventimiglia a few times. But this summer, after hearing about Calais, I decided to join Care4Calais in northern France. I learned Arabic as I was growing up, so that’s helped me talk to the refugees here and get to know them better.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Today there were six beautiful Syrian children at the site we visited. I played with them for hours, and I swear I’ll never forget their strength. Despite their circumstances, they were radiating joy. The four year-old girl had hands-down the most luminous smile I’ve seen in my life; her six-year-old brother was determined to play every game we had; the oldest sister, twelve years old, was a brave and troublemaking force of nature, unlike anyone I’ve ever met. Any one of those children could have been me or my siblings.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I also met a Palestinian guy who escaped from Gaza, which, thanks to the Israeli blockade, effectively functions as an open-air prison that nobody can leave. He had travelled from Turkey to Greece to Italy to Spain to Sweden to Belgium and finally to France — yet due to the siege on Gaza, he’d never been able to see Jerusalem or his original 1948 home in Yaffa, mere miles away.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">He told me about how the blockade of Gaza made a phone cost $300 when it would normally cost $100, how he left his family behind because he couldn’t take it anymore, and how he used to have them on FaceTime 24\/7 in order to make sure they were still alive. I can’t imagine what it’s been like for him to go from never encountering anyone besides other Gazans to making his way all over Europe to reach safety.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">At one point the kids came back while I was talking to him and we all ended up playing catch together. It was easy to forget where I was, because it just felt so natural to play with them. But then it hit me – I was throwing a ball with both versions of what I could have been, had I not been fortunate enough to be born in America. With both sides of my identity. I don’t even know how to articulate how surreal that felt. In an alternate universe, we might still have been playing together, but I wouldn’t have been wearing a volunteer vest.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The only thing separating us was a passport.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The only thing entitling me to my privilege is a paper proving where I was born.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The people here are so resilient—constantly joking around, having fun, and beaming—that sometimes I almost forget the horrors they go through on a daily basis.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It’s infuriating that the CRS cruelly take their tents and belongings every few days, hoping the refugees will leave Calais. But they don’t have another option, so of course they never leave—they just get pushed further into the margins of society.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I remember once meeting a small girl who had a scabby knee and asking how it had happened, expecting her to say she got hurt while playing. But she said that the police had let their dog chase her, and in her fear, she had fallen as she ran. These people are already fleeing danger, but instead of welcoming them with open arms, our governments are forcing them to keep running.<\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Care4Calais helps fill in the gap that our government’s neglect. I love working here. The charity is so well organized, and I get to spend a lot of time with the refugees, who teach me so much every day. Being in Calais has made me reconsider what I’ll do in the future; I’ve always known it would be in development or international relations, but now I’m sure I want to be doing something giving direct aid to people like this, who, like those now trying to escape Afghanistan, deserve secure lives for themselves and their families. Nationality should not dictate your right to safety.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">&#8211; Miriam, volunteer<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>My dad is Syrian and my mom is Palestinian, but I was born in America. Coming from countries with two of the world’s biggest refugee populations, I think I’ve always been aware of how life can turn upside down and anyone can suddenly become a refugee. It’s a lesson that has surely been brought home to all of us by recent events in Afghanistan. For my part, I could be living in Palestine or Syria right now; it’s just by winning the geographic lottery that I’m not. But coming to Calais and seeing the situation first-hand has only made this feeling more potent. I’ve been studying in France for a while now, and have volunteered in Ventimiglia a few times. But this summer, after hearing about Calais, I decided to join Care4Calais in northern France. I learned Arabic as I was growing up, so that’s helped me talk to the refugees here and get to know them better. Today there were six beautiful Syrian children at the site we visited. I played with them for hours, and I swear I’ll never forget their strength. Despite their circumstances, they were radiating joy. The four year-old girl had hands-down the most luminous smile I’ve seen in my life; her six-year-old brother was determined to play every game we had; the oldest sister, twelve years old, was a brave and troublemaking force of nature, unlike anyone I’ve ever met. Any one of those children could have been me or my siblings. I also met a Palestinian guy who escaped from Gaza, which, thanks to the Israeli blockade, effectively functions as an open-air prison that nobody can leave. He had travelled from Turkey to Greece to Italy to Spain to Sweden to Belgium and finally to France — yet due to the siege on Gaza, he’d never been able to see Jerusalem or his original 1948 home in Yaffa, mere miles away. He told me about how the blockade of Gaza made a phone cost $300 when it would normally cost $100, how he left his family behind because he couldn’t take it anymore, and how he used to have them on FaceTime 24\/7 in order to make sure they were still alive. I can’t imagine what it’s been like for him to go from never encountering anyone besides other Gazans to making his way all over Europe to reach safety. At one point the kids came back while I was talking to him and we all ended up playing catch together. It was easy to forget where I was, because it just felt so natural to play with them. But then it hit me – I was throwing a ball with both versions of what I could have been, had I not been fortunate enough to be born in America. With both sides of my identity. I don’t even know how to articulate how surreal that felt. In an alternate universe, we might still have been playing together, but I wouldn’t have been wearing a volunteer vest. The only thing separating us was a passport. The only thing entitling me to my privilege is a paper proving where I was born. The people here are so resilient—constantly joking around, having fun, and beaming—that sometimes I almost forget the horrors they go through on a daily basis. It’s infuriating that the CRS cruelly take their tents and belongings every few days, hoping the refugees will leave Calais. But they don’t have another option, so of course they never leave—they just get pushed further into the margins of society. I remember once meeting a small girl who had a scabby knee and asking how it had happened, expecting her to say she got hurt while playing. But she said that the police had let their dog chase her, and in her fear, she had fallen as she ran. These people are already fleeing danger, but instead of welcoming them with open arms, our governments are forcing them to keep running. Care4Calais helps fill in the gap that our government’s neglect. I love working here. The charity is so well organized, and I get to spend a lot of time with the refugees, who teach me so much every day. Being in Calais has made me reconsider what I’ll do in the future; I’ve always known it would be in development or international relations, but now I’m sure I want to be doing something giving direct aid to people like this, who, like those now trying to escape Afghanistan, deserve secure lives for themselves and their families. Nationality should not dictate your right to safety. &#8211; Miriam, volunteer<\/p>\n","protected":false},"author":21,"featured_media":34590,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34589"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34589"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34589\/revisions"}],"predecessor-version":[{"id":35673,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34589\/revisions\/35673"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34590"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34589"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34589"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34589"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}