{"id":34580,"date":"2021-08-19T17:19:06","date_gmt":"2021-08-19T17:19:06","guid":{"rendered":"https:\/\/care4calais.org\/?p=34580"},"modified":"2023-02-08T17:10:07","modified_gmt":"2023-02-08T16:10:07","slug":"scenes-from-hell","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/scenes-from-hell\/","title":{"rendered":"Scenes from Hell"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">We are now watching scenes beamed not from another country, but from Hell.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Babies thrown over razor wire in a desperate attempt to get them to safety.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Bodies tumbling from planes in the sky.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">And thousands upon thousands of people gripped with primal, panicking fear as they frantically run from one place to another seeking escape.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I would say that it’s like watching people about to be murdered, but that’s wrong. The awful, unacceptable fact is that we literally are watching people about to be murdered.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Without our help, many of those people – mums and dads, sisters and brothers, friends and relations – are about to be killed. I know that’s upsetting, but it’s true. And if ever there was a time for truth, then that time has surely come.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Confronted with these hellish images, any human being worthy of the name can only feel an overwhelming compassion – a compassion that turns to a racking agony when we realise how little we can do.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Of course, it seems that not everyone does deserve the description “human”.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Certainly not those politicians who see not human suffering, but an inconvenience to be kicked down the road. With astonishing callousness, our government says it will let 20,000 people come here over five years. Five years?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Five years?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In five years, many of the people who need our need help will be dead. The rest will have lives not worth living.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">They need help NOW.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Being a refugee is all about “now”. You lose so much of your past because you have to run immediately, possessions and papers left behind.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">All there is an insecure present of at best uncertainty, and worst terror. You’re escaping. There’s no time to stop for paperwork or a visa; and you proably won’t get one anyway.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">What will come, however, is that face at the window, and that knock at the door.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">So when our politicians tell those frightened people in Afghanistan to just hang on a minute, and we’ll see what we can do, that’s what they’re offering; it’s worse than nothing.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Such cold indifference in the face of horror would quite seriously have been too much to bear, had it not been for the reaction of other, ordinary people.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Utterly shaming the polticians and leaders with spontaneous help and kindness, hundreds of men, woman and children are right now giving clothes, food, money, friendship and accommodation to the Afghan people now beginning to arrive.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This help speaks loud and clear; it says, let those who need us come now. Get people out. Help them survive. And sort out the bloody paperwork later.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The shocking spectacle in Afghanistan right now shows the reality of what it means to be a refugee. The fear. The need to leave your home immediately. The need to flee without necessarily knowing where to go. We just don’t usually get to see it live and close-up like this.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But make no mistake, in the midst of this darkness and horror, something else is revealing itself – the humanity and compassion that human beings have for one another. Sometimes it’s tempting to think that such kindness is in short supply.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The pile of clothing currently growing at an alarming rate on our premises in Manchester says otherwise.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">That kindness doesn’t make things all right. To help traumatised Afghan people remake their lives will be a long job, and this is just the beginning.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But we will do everything we can; and we know you will too.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Let us help each other to help the Afghan people in this, their darkest hour.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\"><a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"https:\/\/bit.ly\/afghanwelcome\" target=\"_blank\" rel=\"nofollow noopener\">bit.ly\/afghanwelcome<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We are now watching scenes beamed not from another country, but from Hell. Babies thrown over razor wire in a desperate attempt to get them to safety. Bodies tumbling from planes in the sky. And thousands upon thousands of people gripped with primal, panicking fear as they frantically run from one place to another seeking escape. I would say that it’s like watching people about to be murdered, but that’s wrong. The awful, unacceptable fact is that we literally are watching people about to be murdered. Without our help, many of those people – mums and dads, sisters and brothers, friends and relations – are about to be killed. I know that’s upsetting, but it’s true. And if ever there was a time for truth, then that time has surely come. Confronted with these hellish images, any human being worthy of the name can only feel an overwhelming compassion – a compassion that turns to a racking agony when we realise how little we can do. Of course, it seems that not everyone does deserve the description “human”. Certainly not those politicians who see not human suffering, but an inconvenience to be kicked down the road. With astonishing callousness, our government says it will let 20,000 people come here over five years. Five years? Five years? In five years, many of the people who need our need help will be dead. The rest will have lives not worth living. They need help NOW. Being a refugee is all about “now”. You lose so much of your past because you have to run immediately, possessions and papers left behind. All there is an insecure present of at best uncertainty, and worst terror. You’re escaping. There’s no time to stop for paperwork or a visa; and you proably won’t get one anyway. What will come, however, is that face at the window, and that knock at the door. So when our politicians tell those frightened people in Afghanistan to just hang on a minute, and we’ll see what we can do, that’s what they’re offering; it’s worse than nothing. Such cold indifference in the face of horror would quite seriously have been too much to bear, had it not been for the reaction of other, ordinary people. Utterly shaming the polticians and leaders with spontaneous help and kindness, hundreds of men, woman and children are right now giving clothes, food, money, friendship and accommodation to the Afghan people now beginning to arrive. This help speaks loud and clear; it says, let those who need us come now. Get people out. Help them survive. And sort out the bloody paperwork later. The shocking spectacle in Afghanistan right now shows the reality of what it means to be a refugee. The fear. The need to leave your home immediately. The need to flee without necessarily knowing where to go. We just don’t usually get to see it live and close-up like this. But make no mistake, in the midst of this darkness and horror, something else is revealing itself – the humanity and compassion that human beings have for one another. Sometimes it’s tempting to think that such kindness is in short supply. The pile of clothing currently growing at an alarming rate on our premises in Manchester says otherwise. That kindness doesn’t make things all right. To help traumatised Afghan people remake their lives will be a long job, and this is just the beginning. But we will do everything we can; and we know you will too. Let us help each other to help the Afghan people in this, their darkest hour. bit.ly\/afghanwelcome<\/p>\n","protected":false},"author":21,"featured_media":34581,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34580"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34580"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34580\/revisions"}],"predecessor-version":[{"id":36532,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34580\/revisions\/36532"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34581"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34580"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34580"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34580"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}