{"id":34598,"date":"2021-08-30T17:30:53","date_gmt":"2021-08-30T17:30:53","guid":{"rendered":"https:\/\/care4calais.org\/?p=34598"},"modified":"2023-02-08T17:09:47","modified_gmt":"2023-02-08T16:09:47","slug":"a-tale-of-heartbeak-from-kabul","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/a-tale-of-heartbeak-from-kabul\/","title":{"rendered":"A tale of heartbeak from Kabul"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">When the British soldiers came to Afghanistan it was such a time of hope for us. We thought we would be free of the Taliban and that our country would have freedom once again. They needed people who spoke English so I signed up as an interpreter for the army and also the special forces. It was a good job, I could look after my family on this. Before, if you did not join the Taliban you could not work. I worked as an interpreter for four years and I made some really good friends with the British soldiers, I worked with them, side by side, facing the same dangers, sharing the same jokes and learning about each other. I helped them understand the culture of Afghanistan and why we did the things the way we did.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I thought it was a job forever, but four years ago I had to run. I left my wife and small daughter and ran to escape Afghanistan. My daughter, Fatema, was only a year old. I didn’t have a choice, if I wanted to live I had to leave, the militia had got to know who I was and that I was working for the British. Death threats started to be hurled at me and my family was threatened. In Afghanistan you must take these threats seriously as life is so cheap and there is no law to protect you.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It was a long journey to freedom and it’s still not over. No one tells you the hardest part is crossing the English Channel, just a small stretch of water but sometimes it seems like it’s impossible.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Crossing into Turkey from Greece was actually quite difficult. I tried over ten times to get across the border. It took me over 18 months. I spent my time between attempts volunteering with the health clinics in some of the camps. Moving up through Europe I got to Croatia but the police there are brutal and they beat refugees for no reason, some of this violence is quite extreme. They hit me, kicked my legs and beat me until I could barely walk. It took me three days to be able to walk again. While I was down they took all my things, including my phone which was the only way I could keep in touch with my family.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I finally got to Calais last month, four years after I left my home. This journey takes its toll on all of us, it’s not easy and we would not make it if it wasn’t the only hope of a fair and safe future for our families.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But this week I got to talk to my daughter again! She is five now and is talking, when I left Kabul she really could not say anything. She was chatting away to me and told me she could hear gun shots outside the house. A five year old should not be able to recognise a gun shot, never mind hear one so close to her. She said he was very scared the Taliban would come for her and her mummy.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My wife tells me they do not go outside now, they stay at home in the flat in Kabul. The neighbours know I worked for the British forces so my wife is scared to leave and go outside. This is what the Taliban do, they divide communities, they make people tell tales on their neighbours in the hope that they will be left alone.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I am really scared they will come for my family, I just want to get to the UK and bring them to me so we can start a new life. But so far I cannot get through on any phone number and no one answers my emails. The embassy doesn’t answer the phone and no one from the army can help me. So I am stuck in France, in this small camp &#8211; but I won’t give up.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’m heartbroken for my country and for the loss of freedom. I feel powerless to help my family escape and can only watch in horror what is going on in Kabul.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\"><a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/#afghan\" target=\"_blank\" rel=\"nofollow noopener\">care4calais.org\/#afghan<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; When the British soldiers came to Afghanistan it was such a time of hope for us. We thought we would be free of the Taliban and that our country would have freedom once again. They needed people who spoke English so I signed up as an interpreter for the army and also the special forces. It was a good job, I could look after my family on this. Before, if you did not join the Taliban you could not work. I worked as an interpreter for four years and I made some really good friends with the British soldiers, I worked with them, side by side, facing the same dangers, sharing the same jokes and learning about each other. I helped them understand the culture of Afghanistan and why we did the things the way we did. I thought it was a job forever, but four years ago I had to run. I left my wife and small daughter and ran to escape Afghanistan. My daughter, Fatema, was only a year old. I didn’t have a choice, if I wanted to live I had to leave, the militia had got to know who I was and that I was working for the British. Death threats started to be hurled at me and my family was threatened. In Afghanistan you must take these threats seriously as life is so cheap and there is no law to protect you. It was a long journey to freedom and it’s still not over. No one tells you the hardest part is crossing the English Channel, just a small stretch of water but sometimes it seems like it’s impossible. Crossing into Turkey from Greece was actually quite difficult. I tried over ten times to get across the border. It took me over 18 months. I spent my time between attempts volunteering with the health clinics in some of the camps. Moving up through Europe I got to Croatia but the police there are brutal and they beat refugees for no reason, some of this violence is quite extreme. They hit me, kicked my legs and beat me until I could barely walk. It took me three days to be able to walk again. While I was down they took all my things, including my phone which was the only way I could keep in touch with my family. I finally got to Calais last month, four years after I left my home. This journey takes its toll on all of us, it’s not easy and we would not make it if it wasn’t the only hope of a fair and safe future for our families. But this week I got to talk to my daughter again! She is five now and is talking, when I left Kabul she really could not say anything. She was chatting away to me and told me she could hear gun shots outside the house. A five year old should not be able to recognise a gun shot, never mind hear one so close to her. She said he was very scared the Taliban would come for her and her mummy. My wife tells me they do not go outside now, they stay at home in the flat in Kabul. The neighbours know I worked for the British forces so my wife is scared to leave and go outside. This is what the Taliban do, they divide communities, they make people tell tales on their neighbours in the hope that they will be left alone. I am really scared they will come for my family, I just want to get to the UK and bring them to me so we can start a new life. But so far I cannot get through on any phone number and no one answers my emails. The embassy doesn’t answer the phone and no one from the army can help me. So I am stuck in France, in this small camp &#8211; but I won’t give up. I’m heartbroken for my country and for the loss of freedom. I feel powerless to help my family escape and can only watch in horror what is going on in Kabul. care4calais.org\/#afghan<\/p>\n","protected":false},"author":21,"featured_media":34599,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[154],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34598"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34598"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34598\/revisions"}],"predecessor-version":[{"id":34643,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34598\/revisions\/34643"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34599"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34598"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34598"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34598"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}