{"id":34622,"date":"2021-09-15T10:42:14","date_gmt":"2021-09-15T10:42:14","guid":{"rendered":"https:\/\/care4calais.org\/?p=34622"},"modified":"2022-06-17T08:36:39","modified_gmt":"2022-06-17T08:36:39","slug":"meet-mara-manchester-volunteer","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/meet-mara-manchester-volunteer\/","title":{"rendered":"Meet Mara, Manchester volunteer"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I’m Mara, and I’m part of the core team at Care4Calais Manchester.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This week for the first time I went on one of the distributions to a hotel where refugees from Afghanistan are staying. When we arrived we met loads of families with lots of children. The kids were running around, but had nothing really to do. Luckily we’d also brought boxes of toys with us.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We gave out loads of toys, kids pens, paper and crayons, and clothes. The kids were so delighted with the toys.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">They came running round the corner when they heard about it from their parents and friends, and there were huge smiles and grins on their faces.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Anwar, who works for an Afghani youth project in Manchester, came with us. He could talk to the children and made sure every kid that wanted a cuddly toy got one, and he was really helpful in making sure all the families got something they needed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We ended up doing two trips because so many people were telling us they needed clothes. Most of them had only what they stood up in. Manchester has been so generous that we could fill all these orders easily, and it was a joy to do so.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Families also wanted jumpers as they felt cold – to us it was still a warm summer’s day, but it was nothing compared to the summer heat in Afghanistan, and children were shivering.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">SIM cards were also in high demand so everyone could contact people at home. It’s been a very worrying time for them. Imagine seeing what’s going in Afghanistan in the news, but not knowing if your friends and family are safe back home.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We left the hotel promising to be back soon – and we will be. For everyone in the Manchester team it’s a honour to help the refugees here, and we’re so proud of the incredible way the people of this city have rallied to support them.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To get involved go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"nofollow noopener\">care4calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; I’m Mara, and I’m part of the core team at Care4Calais Manchester. This week for the first time I went on one of the distributions to a hotel where refugees from Afghanistan are staying. When we arrived we met loads of families with lots of children. The kids were running around, but had nothing really to do. Luckily we’d also brought boxes of toys with us. We gave out loads of toys, kids pens, paper and crayons, and clothes. The kids were so delighted with the toys. They came running round the corner when they heard about it from their parents and friends, and there were huge smiles and grins on their faces. Anwar, who works for an Afghani youth project in Manchester, came with us. He could talk to the children and made sure every kid that wanted a cuddly toy got one, and he was really helpful in making sure all the families got something they needed. We ended up doing two trips because so many people were telling us they needed clothes. Most of them had only what they stood up in. Manchester has been so generous that we could fill all these orders easily, and it was a joy to do so. Families also wanted jumpers as they felt cold – to us it was still a warm summer’s day, but it was nothing compared to the summer heat in Afghanistan, and children were shivering. SIM cards were also in high demand so everyone could contact people at home. It’s been a very worrying time for them. Imagine seeing what’s going in Afghanistan in the news, but not knowing if your friends and family are safe back home. We left the hotel promising to be back soon – and we will be. For everyone in the Manchester team it’s a honour to help the refugees here, and we’re so proud of the incredible way the people of this city have rallied to support them. To get involved go to care4calais.org<\/p>\n","protected":false},"author":21,"featured_media":34623,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34622"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34622"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34622\/revisions"}],"predecessor-version":[{"id":36529,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34622\/revisions\/36529"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34623"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34622"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34622"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34622"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}