{"id":34739,"date":"2021-10-12T13:42:12","date_gmt":"2021-10-12T13:42:12","guid":{"rendered":"https:\/\/care4calais.org\/?p=34739"},"modified":"2022-03-16T11:36:17","modified_gmt":"2022-03-16T11:36:17","slug":"more-refugees-missing-in-english-channel","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/more-refugees-missing-in-english-channel\/","title":{"rendered":"More Refugees Missing in English Channel"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">ANOTHER three refugees are missing in the English Channel.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">According to reports, the three men set off to try to cross the Channel in a kayak on Thursday. You have to be pretty desperate to try that. A kayak. They were with two other men, in separate kayaks, who were rescued by the French police when they got into difficulties. The two rescued men reported the other three missing.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The French coastguard used boats and a helicopter to search for the missing men, but the search was halted at nightfall, before being resumed on Friday morning.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This means at least five refugees have gone missing, and two have died, in the channel since the start of October. In addition, two have died in lorry accidents, and at least one other was killed by a train. Ten human beings.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Tragically not a single body of anyone missing has been recovered.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">At the same time, Human Rights Watch has issued a shocking report the French authorities intimidation and persecution of refugees in the area. The fear and intimidation drove a priest and two activists to go hunger strike in protest.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In all the years of turmoil here, these are the most severe levels of injury, intimidation and death we have ever known.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But it hasn&#8217;t happened by accident.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">For most of this year, police and politicians have carried out a systematic assault on refugees on both sides of the channel.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Refugees&#8217; right to seek asylum in the UK have been denied by the UK Government in its anti-refugee bill.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">They have been accused of being frauds.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In France, they have been beaten, harassed and roughly evicted from their sites.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This assault has dehumanised refugees in the minds of the authorities, police and some parts of the media. And history shows us that once a group of people is dehumanised, they can be mistreated and left to suffer, and be denied.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Let&#8217;s not forget that most of the five deaths on the France-UK border were reported in one or two paragraphs, if at all.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The suffering and deaths on the border happen because political leaders effectively choose to ignore them. If they paid attention, they would seek to stop them, and it’s clear now the only way to stop them is with a modern, sensible system that allows refugees seeking asylum in the UK safe passage.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It&#8217;s not a coincidence that the dire situation in Calais has arisen after months of vicious anti-refugee rhetoric and legal debate.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The lies and slander and abuse made the suffering, injury and death possible, because they created a climate in which those who could prevent them are not held to account. It is a disgrace.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">As compassionate people, we cannot stand by as this happens. We will defend refugees humanity and dignity, and resist the carnage in Calais, and we believe that caring people will join with us. Please volunteer, donate or join our movement at <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"nofollow noopener\">care4calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; ANOTHER three refugees are missing in the English Channel. According to reports, the three men set off to try to cross the Channel in a kayak on Thursday. You have to be pretty desperate to try that. A kayak. They were with two other men, in separate kayaks, who were rescued by the French police when they got into difficulties. The two rescued men reported the other three missing. The French coastguard used boats and a helicopter to search for the missing men, but the search was halted at nightfall, before being resumed on Friday morning. This means at least five refugees have gone missing, and two have died, in the channel since the start of October. In addition, two have died in lorry accidents, and at least one other was killed by a train. Ten human beings. Tragically not a single body of anyone missing has been recovered. At the same time, Human Rights Watch has issued a shocking report the French authorities intimidation and persecution of refugees in the area. The fear and intimidation drove a priest and two activists to go hunger strike in protest. In all the years of turmoil here, these are the most severe levels of injury, intimidation and death we have ever known. But it hasn&#8217;t happened by accident. For most of this year, police and politicians have carried out a systematic assault on refugees on both sides of the channel. Refugees&#8217; right to seek asylum in the UK have been denied by the UK Government in its anti-refugee bill. They have been accused of being frauds. In France, they have been beaten, harassed and roughly evicted from their sites. This assault has dehumanised refugees in the minds of the authorities, police and some parts of the media. And history shows us that once a group of people is dehumanised, they can be mistreated and left to suffer, and be denied. Let&#8217;s not forget that most of the five deaths on the France-UK border were reported in one or two paragraphs, if at all. The suffering and deaths on the border happen because political leaders effectively choose to ignore them. If they paid attention, they would seek to stop them, and it’s clear now the only way to stop them is with a modern, sensible system that allows refugees seeking asylum in the UK safe passage. It&#8217;s not a coincidence that the dire situation in Calais has arisen after months of vicious anti-refugee rhetoric and legal debate. The lies and slander and abuse made the suffering, injury and death possible, because they created a climate in which those who could prevent them are not held to account. It is a disgrace. As compassionate people, we cannot stand by as this happens. We will defend refugees humanity and dignity, and resist the carnage in Calais, and we believe that caring people will join with us. Please volunteer, donate or join our movement at care4calais.org<\/p>\n","protected":false},"author":21,"featured_media":34740,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[156,163,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34739"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34739"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34739\/revisions"}],"predecessor-version":[{"id":35104,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34739\/revisions\/35104"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34740"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34739"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34739"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34739"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}