{"id":34733,"date":"2021-10-19T13:27:06","date_gmt":"2021-10-19T13:27:06","guid":{"rendered":"https:\/\/care4calais.org\/?p=34733"},"modified":"2022-03-16T11:37:24","modified_gmt":"2022-03-16T11:37:24","slug":"omars-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/omars-story\/","title":{"rendered":"Omar&#8217;s Story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">Omar left his home, friends and family, and fled from the Gambia a few months ago. He is 17 years old but when he arrived in the U.K the Home Office decided he looked older so they put him in accommodation with adults.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">He doesn’t speak much English, he was alone and scared of what might happen to him.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Omar did know someone in the UK &#8211; a family friend in Liverpool. After a few weeks he made his way there to visit his friend for a few days.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But when he came back to London, he found someone else living in his room. The person told Omar that the Home Office had given the room to them now. Apparently, Omar wasn’t allowed to leave the accommodation for more than five days.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">No one had explained this to him. He was now homeless and had no idea what to do.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Luckily someone gave him the phone number for our access team. We could help him prove his age but, more urgently, we needed to find a safe place for him to spend the night.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Laura, one of our volunteers, immediately called Migrant Help, who deal with accommodation applications. However, since it was late on a Friday and the ‘emergency accommodation’ team at MH don’t work on weekends, Omar was left facing the possibility of living on the streets for two days before being able to re-apply for accommodation.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Of course, anything could happen in that time, especially to a young man struggling with the English language.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Laura immediately went to her manager to see what we could do to help. We booked him a hotel so that he had somewhere safe to stay for the weekend. Apart from the nights, however, Omar spent most of his time sitting in the local police station; even though they couldn’t help him, he said he felt safer there.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">On Monday, things became even more complicated. Migrant Help wouldn’t accept his application for accommodation without confirmation of his age. When we contacted the local social services who are responsible for helping minors in their area, they said they couldn’t help without an age assessment confirming he was a minor. But he didn’t have that.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">This limbo, where no party appears to accept responsibility, is a common one for misaged minors. Without legal help, they are stuck. Without our access team, the government would literally have abandoned him to sleep on the street.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">On Tuesday, having booked another night at the hotel, we contacted lawyers who we work with on a regular basis and who deal with similar cases.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Thankfully, the lawyers acted quickly in sending all the forms and papers as well as writing to the local authority asking for their client to be taken into care pending an age assessment – something the authority is legally bound to do. Within a matter of hours, Omar was back in accommodation.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Like all our volunteers, Laura helped to find legal assistance, but also acted as a frontline responder letting Omar know that they were not alone, and someone cared.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“The people who contact us often simply feel forgotten and depressed in their living conditions, while living in a state of flux. Often misaged minors feel threatened or scared to even leave their rooms. The fact we, as a team, can respond and flag any issues, not only provides them with a safety net, but also gives reassurance that someone out there is looking out for them.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“Omar’s story is like so many others, and I’m proud to have been able to play a part to keep him safe and off the streets.”<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Like most refugees, Omar just wants a chance to have a normal life in a safe country. Our access team helps them to do that.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">If you have got what it takes to be an Access Team volunteer &#8211; if you are dedictated, organised and can commit 15 to 20 hours a week &#8211; please email access@care4calais.org<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Omar left his home, friends and family, and fled from the Gambia a few months ago. He is 17 years old but when he arrived in the U.K the Home Office decided he looked older so they put him in accommodation with adults. He doesn’t speak much English, he was alone and scared of what might happen to him. Omar did know someone in the UK &#8211; a family friend in Liverpool. After a few weeks he made his way there to visit his friend for a few days. But when he came back to London, he found someone else living in his room. The person told Omar that the Home Office had given the room to them now. Apparently, Omar wasn’t allowed to leave the accommodation for more than five days. No one had explained this to him. He was now homeless and had no idea what to do. Luckily someone gave him the phone number for our access team. We could help him prove his age but, more urgently, we needed to find a safe place for him to spend the night. Laura, one of our volunteers, immediately called Migrant Help, who deal with accommodation applications. However, since it was late on a Friday and the ‘emergency accommodation’ team at MH don’t work on weekends, Omar was left facing the possibility of living on the streets for two days before being able to re-apply for accommodation. Of course, anything could happen in that time, especially to a young man struggling with the English language. Laura immediately went to her manager to see what we could do to help. We booked him a hotel so that he had somewhere safe to stay for the weekend. Apart from the nights, however, Omar spent most of his time sitting in the local police station; even though they couldn’t help him, he said he felt safer there. On Monday, things became even more complicated. Migrant Help wouldn’t accept his application for accommodation without confirmation of his age. When we contacted the local social services who are responsible for helping minors in their area, they said they couldn’t help without an age assessment confirming he was a minor. But he didn’t have that. This limbo, where no party appears to accept responsibility, is a common one for misaged minors. Without legal help, they are stuck. Without our access team, the government would literally have abandoned him to sleep on the street. On Tuesday, having booked another night at the hotel, we contacted lawyers who we work with on a regular basis and who deal with similar cases. Thankfully, the lawyers acted quickly in sending all the forms and papers as well as writing to the local authority asking for their client to be taken into care pending an age assessment – something the authority is legally bound to do. Within a matter of hours, Omar was back in accommodation. Like all our volunteers, Laura helped to find legal assistance, but also acted as a frontline responder letting Omar know that they were not alone, and someone cared. “The people who contact us often simply feel forgotten and depressed in their living conditions, while living in a state of flux. Often misaged minors feel threatened or scared to even leave their rooms. The fact we, as a team, can respond and flag any issues, not only provides them with a safety net, but also gives reassurance that someone out there is looking out for them. “Omar’s story is like so many others, and I’m proud to have been able to play a part to keep him safe and off the streets.” Like most refugees, Omar just wants a chance to have a normal life in a safe country. Our access team helps them to do that. If you have got what it takes to be an Access Team volunteer &#8211; if you are dedictated, organised and can commit 15 to 20 hours a week &#8211; please email access@care4calais.org<\/p>\n","protected":false},"author":21,"featured_media":34734,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34733"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34733"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34733\/revisions"}],"predecessor-version":[{"id":35105,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34733\/revisions\/35105"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34734"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34733"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34733"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34733"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}