{"id":34742,"date":"2021-10-13T13:44:37","date_gmt":"2021-10-13T13:44:37","guid":{"rendered":"https:\/\/care4calais.org\/?p=34742"},"modified":"2022-03-16T11:32:42","modified_gmt":"2022-03-16T11:32:42","slug":"from-kabul-with-love-maxs-incredible-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/from-kabul-with-love-maxs-incredible-story\/","title":{"rendered":"From Kabul with Love: Max&#8217;s Incredible Story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I will never forget the moment I looked over at the sea of humanity trying to escape Afghanistan. I was one of the many Royal Air Force personnel who airlifted refugees from Kabul last summer, and the images of scared, exhausted and desperate families bring up emotions in me that will be with me for the rest of my life.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The whole experience is full of powerful moments that resonated through every single member of our crew. Our loadmaster “Hops” counted everyone on board, and informed us that we had a three-day-old baby on the plane. At that stage, it was taking people three days to get into the airport, so the mother must have given birth in the queue.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The idea of a mother going through that whilst fearing for her life really brought home to us all that for these people, nothing else mattered but to escape the horrors that awaited them if they remained. As a parent I found it impossible to imagine how that could have been for the mum, and how brave she must have been. I also found myself thinking how that baby would now grow up in the UK not remembering all of this and will be like any other British kid.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Somehow it was very moving to think of that, and I felt proud of all of us that we were helping to move them to a new safe life.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My journey to Kabul really started in Devon, where I was on holiday with my friends and family that August. We watched the television as things deteriorated. I had worked in Afghanistan many times before, and knew that there are good people there, so watching the desperate situation unfolding live made my heart bleed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I was called back to Brize Norton and my crew, and I flew a 99 Squadron, Boeing C17 (an enormous cargo plane) to a staging post, and then into Kabul.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We didn’t know quite what to expect, and we didn’t even really know if we’d be able to land in Kabul airport. It wasn’t being controlled by anyone anymore. As we got closer, we could see buildings on fire, shells of cars and houses where bombs had gone off, and the crowds of people trying to get into the airport. There were cars on the runway, the Taliban and refugees were breaking through fences, and the only air traffic control was being done by a single man sitting in a tent with a portable radio set. He was just checking the runway and telling you whether it was safe to land or not.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It is a testament to every RAF crew and support personnel that we made it into and back out of the airport safely. During our first time we sat with our engines running waiting for something to happen, and my eyes drifted across the airport to see that crowd of people – men and women, old and young, babes in arms. Uncountable. Fear in their eyes, desperate, exhausted. In need of help.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It became obvious that special measures were going to be needed to get these people out. We took all the seats out of the hold so that we could fit more people onboard, and we filled the aircraft with as many as we could. Normally we would transport 50 at a time; now we carried 350.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">One of the crew counted 190 children on board, some accompanied, some alone. The children were anxious and pretty traumatised. Most of them hadn’t been near a plane before, and no one had told them or their parents where we were taking them – they just knew we were getting them out. They were taken to our staging airfield before flying them back to England.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I talked about “moments” earlier and I’d like to share a couple more. The first was when a young father came to ask me if I had a bag I could let him have. I assumed he meant a sick bag and, as we had plenty of those, I passed him a few.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">No, he said, not that kind of bag.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">He needed a bigger one, for his clothes. To show me what he meant, he began to pull clothes out from his pockets. That was all the clothes they had had time to bring, he said, his wife and children had just brought what they could carry. And that’s how they would arrive; with what they had on their backs and in their pockets.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The second man was a dentist in his thirties. He said he just wanted to thank us for what we had done, and then told me about his studies, and being a dentist, and asked if I thought he’d be able to find work in the UK. I said I couldn’t see why not.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The thing I really remember was, he asked me where I thought would be a nice place for him to live in the UK? Where should he go?<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">For want of a better idea I suggested somewhere near the sea, but that moment made me realise he wasn’t just leaving something. Like everyone on board, he was also heading into a future he knew nothing about.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">And all of this was not because they had done anything wrong; they were only here because of the people they had worked with. Imagine being in that position because of a job you’d once taken. When you see what they went through, and the situation they’re in, it’s horrific really.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">All this is why, when we finally got home, it felt right to get together and do something for the Afghan people here. With the help of my colleagues here at RAF Brize Norton and friends in schools and colleges we’ve been collecting clothes, especially winter coats. The Care4Calais team in Reading and the Thames Valley have been working with us to get them to the people who need them (and by the way, having been in Afghanistan, I can assure you they do need them &#8211; it seems cold here once you come back!).<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I couldn’t do much, butI knew the community in and around RAF Brize Norton are generous and kind and they would support this appeal in every way. It really is a case of every little helps, and of standing up for something you believe in.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To get involved go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2FCare4Calais.org%2Fcoats4calais%2F&amp;h=AT2swc_uggco5ubrx982iuTqHkKqWBH3NFUFtMknfs4A2RnY_GoyNPhIY-mfrRceuJ-kgcIe_btlBMSSLaO7VE47CGaQHE1DpUaZoBu-eBozqD_t15LmldYQ24JgekctzDXVPwwZ7L1jmXHjpMiB&amp;__tn__=-UK-R&amp;c[0]=AT09C-jdxtEGGzVMolV-sdjUVchjxuRSdbQCk4HSjprbvgJGKIGfWpX_0vMgT40JA0mI66I_AdElrcXE1AaPZiTjbjEox_DWodEdV4AVuizYZphkv4xKrh6nWuHptQOx0n1GjsI5SfCiKWcBvMVksZILjVICuFhcftOwyPkIpIMTqEQv0IHQFHrMOl6AsYqmF6lIfaY8\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org\/coats4calais\/<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; I will never forget the moment I looked over at the sea of humanity trying to escape Afghanistan. I was one of the many Royal Air Force personnel who airlifted refugees from Kabul last summer, and the images of scared, exhausted and desperate families bring up emotions in me that will be with me for the rest of my life. The whole experience is full of powerful moments that resonated through every single member of our crew. Our loadmaster “Hops” counted everyone on board, and informed us that we had a three-day-old baby on the plane. At that stage, it was taking people three days to get into the airport, so the mother must have given birth in the queue. The idea of a mother going through that whilst fearing for her life really brought home to us all that for these people, nothing else mattered but to escape the horrors that awaited them if they remained. As a parent I found it impossible to imagine how that could have been for the mum, and how brave she must have been. I also found myself thinking how that baby would now grow up in the UK not remembering all of this and will be like any other British kid. Somehow it was very moving to think of that, and I felt proud of all of us that we were helping to move them to a new safe life. My journey to Kabul really started in Devon, where I was on holiday with my friends and family that August. We watched the television as things deteriorated. I had worked in Afghanistan many times before, and knew that there are good people there, so watching the desperate situation unfolding live made my heart bleed. I was called back to Brize Norton and my crew, and I flew a 99 Squadron, Boeing C17 (an enormous cargo plane) to a staging post, and then into Kabul. We didn’t know quite what to expect, and we didn’t even really know if we’d be able to land in Kabul airport. It wasn’t being controlled by anyone anymore. As we got closer, we could see buildings on fire, shells of cars and houses where bombs had gone off, and the crowds of people trying to get into the airport. There were cars on the runway, the Taliban and refugees were breaking through fences, and the only air traffic control was being done by a single man sitting in a tent with a portable radio set. He was just checking the runway and telling you whether it was safe to land or not. It is a testament to every RAF crew and support personnel that we made it into and back out of the airport safely. During our first time we sat with our engines running waiting for something to happen, and my eyes drifted across the airport to see that crowd of people – men and women, old and young, babes in arms. Uncountable. Fear in their eyes, desperate, exhausted. In need of help. It became obvious that special measures were going to be needed to get these people out. We took all the seats out of the hold so that we could fit more people onboard, and we filled the aircraft with as many as we could. Normally we would transport 50 at a time; now we carried 350. One of the crew counted 190 children on board, some accompanied, some alone. The children were anxious and pretty traumatised. Most of them hadn’t been near a plane before, and no one had told them or their parents where we were taking them – they just knew we were getting them out. They were taken to our staging airfield before flying them back to England. I talked about “moments” earlier and I’d like to share a couple more. The first was when a young father came to ask me if I had a bag I could let him have. I assumed he meant a sick bag and, as we had plenty of those, I passed him a few. No, he said, not that kind of bag. He needed a bigger one, for his clothes. To show me what he meant, he began to pull clothes out from his pockets. That was all the clothes they had had time to bring, he said, his wife and children had just brought what they could carry. And that’s how they would arrive; with what they had on their backs and in their pockets. The second man was a dentist in his thirties. He said he just wanted to thank us for what we had done, and then told me about his studies, and being a dentist, and asked if I thought he’d be able to find work in the UK. I said I couldn’t see why not. The thing I really remember was, he asked me where I thought would be a nice place for him to live in the UK? Where should he go? For want of a better idea I suggested somewhere near the sea, but that moment made me realise he wasn’t just leaving something. Like everyone on board, he was also heading into a future he knew nothing about. And all of this was not because they had done anything wrong; they were only here because of the people they had worked with. Imagine being in that position because of a job you’d once taken. When you see what they went through, and the situation they’re in, it’s horrific really. All this is why, when we finally got home, it felt right to get together and do something for the Afghan people here. With the help of my colleagues here at RAF Brize Norton and friends in schools and colleges we’ve been collecting clothes, especially winter coats. The Care4Calais team in Reading and the Thames Valley have been working with us to get them to the people who need them (and by the way, [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":34743,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34742"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34742"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34742\/revisions"}],"predecessor-version":[{"id":35103,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34742\/revisions\/35103"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34743"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34742"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34742"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34742"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}