{"id":34799,"date":"2022-03-01T14:03:32","date_gmt":"2022-03-01T14:03:32","guid":{"rendered":"https:\/\/care4calais.org\/?p=34799"},"modified":"2022-10-18T11:38:35","modified_gmt":"2022-10-18T10:38:35","slug":"the-house-of-lords-has-rejected-clause-11-of-the-anti-refugee-bill","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-house-of-lords-has-rejected-clause-11-of-the-anti-refugee-bill\/","title":{"rendered":"The House of Lords has rejected Clause 11 of the anti-refugee bill"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\"><\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">\n<p><span style=\"font-weight: 400;\">Last night the House of Lords voted against one of the most unfair and cruel parts of the government’s anti-refugee bill.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">They voted by 204-126 to remove Clause 11, which would allow the government to pick and choose to which refugees it gives protection.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At the moment, we judge all asylum seekers in the same way, based how badly they need our help.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">But Clause 11 would change that. It would mean that instead of respecting the principle that all people deserve fairness, our government could subjectively decide which people it wants to help.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Of course the government doesn’t put it like that; they say they will protect only those travelling by legal routes. But as the government creates the legal routes, it amounts to the same thing.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In the last few days the war in the Ukraine has reminded us how important universal principles are. We are seeing markedly different reactions to politically-acceptable Ukranian refugees than we have previously seen to dark-skinned refugees escaping from similar conflicts.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is critical that we know that life and death decisions, like who gets asylum, are being correctly made, for the right reasons, every time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Clause 11 is the cruel heart of the bill, and goes against the spirit of all refugee law. To reject Clause 11 is to reject a fundamental intention of the bill, so this is a significant victory. It sends out a message that the worst parts of the anti-refugee bill can still be defeated if only our MPs will listen.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There is hope.<\/span><\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Last night the House of Lords voted against one of the most unfair and cruel parts of the government’s anti-refugee bill. They voted by 204-126 to remove Clause 11, which would allow the government to pick and choose to which refugees it gives protection. At the moment, we judge all asylum seekers in the same way, based how badly they need our help. But Clause 11 would change that. It would mean that instead of respecting the principle that all people deserve fairness, our government could subjectively decide which people it wants to help. Of course the government doesn’t put it like that; they say they will protect only those travelling by legal routes. But as the government creates the legal routes, it amounts to the same thing. In the last few days the war in the Ukraine has reminded us how important universal principles are. We are seeing markedly different reactions to politically-acceptable Ukranian refugees than we have previously seen to dark-skinned refugees escaping from similar conflicts. It is critical that we know that life and death decisions, like who gets asylum, are being correctly made, for the right reasons, every time. Clause 11 is the cruel heart of the bill, and goes against the spirit of all refugee law. To reject Clause 11 is to reject a fundamental intention of the bill, so this is a significant victory. It sends out a message that the worst parts of the anti-refugee bill can still be defeated if only our MPs will listen. There is hope.<\/p>\n","protected":false},"author":21,"featured_media":34800,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,172],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34799"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34799"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34799\/revisions"}],"predecessor-version":[{"id":38174,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34799\/revisions\/38174"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34800"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34799"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34799"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34799"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}