{"id":34796,"date":"2022-02-28T14:01:34","date_gmt":"2022-02-28T14:01:34","guid":{"rendered":"https:\/\/care4calais.org\/?p=34796"},"modified":"2022-03-08T16:23:33","modified_gmt":"2022-03-08T16:23:33","slug":"mojeebs-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/mojeebs-story\/","title":{"rendered":"Mojeeb&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">My neighbours were so kind when we arrived, and they are my friends now. Everyone helped us and made us welcome in Middlesbrough. My neighbour Jenny brought me Christmas presents and fruits, and she even made us a special Christmas cake without the alcohol in it!<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Back in Afghanistan, I graduated from university in Kabul with a degree in computer science, and worked for USAid in Kabul as a security driver, then in IT for a Scottish international company. It was a good job but the Taliban did not like me working for an international company, and wanted me to spy for them.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I had to leave the company and set up my own business. That’s when I met my wife – it was a love marriage which is very unusual in Afghanistan where 98 per cent of marriages are arranged. I didn’t want an arranged marriage. My wife had never been to school and was so different from me, but I knew she was a good woman and I was her first boyfriend. Eventually after asking three times she agreed to marry me.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Meanwhile, the Taliban still they weren’t happy. They made things very difficult and I couldn’t make enough money to survive. I had other problems with the Taliban too that I cannot talk about yet, as I am still in danger.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The Taliban have long memories and even longer arms.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I left Afghanistan in May 2018. First, in 2017, we just moved to Herat, a place in Afghanistan with not so many Taliban as we didn’t want to leave altogether. But in 2018 we had to leave Herat and managed to get to Iran.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But we couldn’t get residence documents, and without them the police soon deport you back to Afghanistan. We needed to get to Turkey where you can get a permit for a short time.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Smugglers took us up into the mountains to cross into Turkey – at first we travelled in a small van with 35 people crammed into a small space, and then we had to leave the van and walk into the mountains. We walked in the mountains for three days; it was so cold we were not dressed for the weather at all. We had very little food and water, just half a boiled egg each. My daughter was three months old. My wife’s milk had dried up by now with stress, and my daughter was crying and crying. I put some of the snow in a bottle and put it under my armpit to try to warm it up, and put in some milk powder so she could eat.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We finally crossed into Turkey at the highest point, some 2000 metres up.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">So we were in Turkey, but all our money was gone. The smugglers took us to the coach station and put us on the coach to Ankara. A lawyer there took my case and I tried to find work, but I couldn’t speak the language and things were not good.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My father said go to Istanbul and I will send money. In Istanbul I managed to find a job selling accessories in a shop.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But then early one day I noticed many, many cars were passing my house which was strange. This was March 31 2020, a day I will never forget. I got up and found messages on my Facebook page saying “I will kill you”.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I left the house for work, and just outside a man stabbed me right in front of my daughter. The knife missed my heart by 3mm. The blood was pouring out, I couldn’t stop it, everything turned to black and white and I fell to the floor. My neighbour called the ambulance, but it took 40 minutes to get to hospital. Nearly all my blood had gone.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The first hospital refused to help me as I had no insurance. So we went to a specialist hospital, which had the only surgeon in Istanbul who could do this surgery. I went into theatre at 11am and I came out at 10pm. If I had died my family would be homeless and left to beg. All the time I was praying to God to give me a chance to save my family. And my prayers were answered.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I had to stay in hospital for 10 days, but my brother said I must leave Istanbul or they would find me again and next time I would not be so lucky. But where to go? I could not go back to Afghanistan.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My family talked to smugglers. They said not Greece, as Greece is no good for refugees, but they agreed to a price and said OK, I will take you to the safest place but I will not tell you where, to keep you safe.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We agreed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Two weeks later I got a call that the game was on. They said to bring only clothes, some food and water. That was the beginning of a 10-hour journey by truck, then a fishing boat. Luckily it was a big boat, and we got across easily.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We spent a month in Italy hidden in a tiny basement and given food only twice a day. Next was a 17-hour trip in a van with no stops, not even for the toilet. When we stopped we had to get out of the van and wait. A small car came and took five of us away at a time to a beach place. I didn’t know where we were at this point.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“Be quiet” they ordered, we waited from 8pm til midnight. Then they said we were about to move, and we were going to the UK.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Then I saw the boat. I was really scared. I said, “You didn’t say anything about a small boat! We do not want to play with our lives, I will not go by boat.” That’s when he pulled the knife.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I said I would speak with my wife, but he said no, this is a one-way street. I argued and said he could keep the money but he said “No, the French police will find you and you will tell them about us. You’re going on the boat or you will die in the waves. You choose.”<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My daughter was blue with cold by the time we got to international waters. She had stopped crying and was not moving. We had nothing dry to warm her with.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Finally someone called 999 and within one hour we were rescued by the British. They gave us blankets and hot coffee and shiny metal blankets. Slowly my wife came back to life and looked after our daughter. When my daughter started to cry I was so happy, it meant she was alive! They are my princesses.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We were in a hotel in London for seven months, then we were sent to a one-bedroomed basement in Huddersfield. I called Migrant Help and explained we could not live there, as we had another baby by now. That’s when everything started to go right and we moved to Midlesbrough. I love my house and my neighbours! It’s fantastic accommodation. I have a bike to get around as the bus is too expensive.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’m still waiting for refugee status but my lawyer is very positive it will happen – we just have to wait. So now I want to improve my English and then start my own business. I want to open a shop to sell ladies party clothes. I want to work hard and pay my tax. The UK is incredible, and I want to be a part of it all and give back as much as I can. Then I will feel truly relaxed and feel I am home.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/donate\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org\/donate<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; My neighbours were so kind when we arrived, and they are my friends now. Everyone helped us and made us welcome in Middlesbrough. My neighbour Jenny brought me Christmas presents and fruits, and she even made us a special Christmas cake without the alcohol in it! Back in Afghanistan, I graduated from university in Kabul with a degree in computer science, and worked for USAid in Kabul as a security driver, then in IT for a Scottish international company. It was a good job but the Taliban did not like me working for an international company, and wanted me to spy for them. I had to leave the company and set up my own business. That’s when I met my wife – it was a love marriage which is very unusual in Afghanistan where 98 per cent of marriages are arranged. I didn’t want an arranged marriage. My wife had never been to school and was so different from me, but I knew she was a good woman and I was her first boyfriend. Eventually after asking three times she agreed to marry me. Meanwhile, the Taliban still they weren’t happy. They made things very difficult and I couldn’t make enough money to survive. I had other problems with the Taliban too that I cannot talk about yet, as I am still in danger. The Taliban have long memories and even longer arms. I left Afghanistan in May 2018. First, in 2017, we just moved to Herat, a place in Afghanistan with not so many Taliban as we didn’t want to leave altogether. But in 2018 we had to leave Herat and managed to get to Iran. But we couldn’t get residence documents, and without them the police soon deport you back to Afghanistan. We needed to get to Turkey where you can get a permit for a short time. Smugglers took us up into the mountains to cross into Turkey – at first we travelled in a small van with 35 people crammed into a small space, and then we had to leave the van and walk into the mountains. We walked in the mountains for three days; it was so cold we were not dressed for the weather at all. We had very little food and water, just half a boiled egg each. My daughter was three months old. My wife’s milk had dried up by now with stress, and my daughter was crying and crying. I put some of the snow in a bottle and put it under my armpit to try to warm it up, and put in some milk powder so she could eat. We finally crossed into Turkey at the highest point, some 2000 metres up. So we were in Turkey, but all our money was gone. The smugglers took us to the coach station and put us on the coach to Ankara. A lawyer there took my case and I tried to find work, but I couldn’t speak the language and things were not good. My father said go to Istanbul and I will send money. In Istanbul I managed to find a job selling accessories in a shop. But then early one day I noticed many, many cars were passing my house which was strange. This was March 31 2020, a day I will never forget. I got up and found messages on my Facebook page saying “I will kill you”. I left the house for work, and just outside a man stabbed me right in front of my daughter. The knife missed my heart by 3mm. The blood was pouring out, I couldn’t stop it, everything turned to black and white and I fell to the floor. My neighbour called the ambulance, but it took 40 minutes to get to hospital. Nearly all my blood had gone. The first hospital refused to help me as I had no insurance. So we went to a specialist hospital, which had the only surgeon in Istanbul who could do this surgery. I went into theatre at 11am and I came out at 10pm. If I had died my family would be homeless and left to beg. All the time I was praying to God to give me a chance to save my family. And my prayers were answered. I had to stay in hospital for 10 days, but my brother said I must leave Istanbul or they would find me again and next time I would not be so lucky. But where to go? I could not go back to Afghanistan. My family talked to smugglers. They said not Greece, as Greece is no good for refugees, but they agreed to a price and said OK, I will take you to the safest place but I will not tell you where, to keep you safe. We agreed. Two weeks later I got a call that the game was on. They said to bring only clothes, some food and water. That was the beginning of a 10-hour journey by truck, then a fishing boat. Luckily it was a big boat, and we got across easily. We spent a month in Italy hidden in a tiny basement and given food only twice a day. Next was a 17-hour trip in a van with no stops, not even for the toilet. When we stopped we had to get out of the van and wait. A small car came and took five of us away at a time to a beach place. I didn’t know where we were at this point. “Be quiet” they ordered, we waited from 8pm til midnight. Then they said we were about to move, and we were going to the UK. Then I saw the boat. I was really scared. I said, “You didn’t say anything about a small boat! We do not want to play with our lives, I will not go by boat.” That’s when he pulled the knife. I said I would speak with my wife, but he [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":34912,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34796"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=34796"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34796\/revisions"}],"predecessor-version":[{"id":34898,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/34796\/revisions\/34898"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/34912"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=34796"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=34796"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=34796"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}