{"id":35067,"date":"2022-03-11T11:04:52","date_gmt":"2022-03-11T11:04:52","guid":{"rendered":"https:\/\/care4calais.org\/?p=35067"},"modified":"2022-03-16T11:28:54","modified_gmt":"2022-03-16T11:28:54","slug":"meet-emma-who-knows-the-bonding-power-of-haircare","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/meet-emma-who-knows-the-bonding-power-of-haircare\/","title":{"rendered":"Meet Emma, who knows the bonding power of haircare"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I’d definitely miscalculated how many asylum-seeking ladies I could squeeze into my little hatchback. The four ladies eyed the backseat of my car with some scepticism as I explained it would be fine as long as they didn’t mind a bit of a squish. There was another gentle sigh of resistance when I insisted everyone had to wear a seatbelt.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My task was to ferry these ladies from their hotel to a free hair salon that Care4Calais had organised at a nearby church hall. One of the women – a trained hairdresser herself – was coming to help out, while the others were in search of a little pampering. The outward journey was quiet – everyone was from a different country, and being forced to sit thigh-to-thigh in the backseat was a bit uncomfortable, but the ladies were polite, if a bit reserved.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Soon, however, our pop-up salon worked its magic. A decent haircut and nice blow-dry can do wonders to restore the mood and put smiles back on everyone’s faces. One of my passengers, an older lady from Sudan, was delighted. ‘My happiest evening,’ she told me, her face wreathed in smiles as she patted her smooth hair. She even video-called her husband back home to show off her new hair-do. I was pulled into the camera frame to say hello and take some of the credit, though I’d done little more than make tea and hand out pizza.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I’m always struck by how warm and friendly asylum seekers are, in spite of the horrors they’ve endured. I think there’s something about their culture and kinship that we’ve lost sight of during our busy, urban lives. They call us volunteers “sister” or “angel” and are eager to share what little they have to show their gratitude &#8211; be it a homemade Iranian delicacy, a bar of chocolate or a banana.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">On the return journey to the hotel, my little car was rocking with chatter and laughter. These ladies, strangers only a few hours ago, had become friends, bonded over hair straighteners and pizza. Now they were swapping numbers and hatching plans to do Zumba in each other’s rooms.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Watching them though my rear-view mirror, I felt my own bubble of happiness. This, I realised, is why we help. To share a smile, to become part of their wider family &#8211; and to show that we care.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Emma volunteer from Reading<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; I’d definitely miscalculated how many asylum-seeking ladies I could squeeze into my little hatchback. The four ladies eyed the backseat of my car with some scepticism as I explained it would be fine as long as they didn’t mind a bit of a squish. There was another gentle sigh of resistance when I insisted everyone had to wear a seatbelt. My task was to ferry these ladies from their hotel to a free hair salon that Care4Calais had organised at a nearby church hall. One of the women – a trained hairdresser herself – was coming to help out, while the others were in search of a little pampering. The outward journey was quiet – everyone was from a different country, and being forced to sit thigh-to-thigh in the backseat was a bit uncomfortable, but the ladies were polite, if a bit reserved. Soon, however, our pop-up salon worked its magic. A decent haircut and nice blow-dry can do wonders to restore the mood and put smiles back on everyone’s faces. One of my passengers, an older lady from Sudan, was delighted. ‘My happiest evening,’ she told me, her face wreathed in smiles as she patted her smooth hair. She even video-called her husband back home to show off her new hair-do. I was pulled into the camera frame to say hello and take some of the credit, though I’d done little more than make tea and hand out pizza. I’m always struck by how warm and friendly asylum seekers are, in spite of the horrors they’ve endured. I think there’s something about their culture and kinship that we’ve lost sight of during our busy, urban lives. They call us volunteers “sister” or “angel” and are eager to share what little they have to show their gratitude &#8211; be it a homemade Iranian delicacy, a bar of chocolate or a banana. On the return journey to the hotel, my little car was rocking with chatter and laughter. These ladies, strangers only a few hours ago, had become friends, bonded over hair straighteners and pizza. Now they were swapping numbers and hatching plans to do Zumba in each other’s rooms. Watching them though my rear-view mirror, I felt my own bubble of happiness. This, I realised, is why we help. To share a smile, to become part of their wider family &#8211; and to show that we care. Emma volunteer from Reading To volunteer or donate go to Care4Calais.org<\/p>\n","protected":false},"author":21,"featured_media":35068,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35067"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35067"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35067\/revisions"}],"predecessor-version":[{"id":35101,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35067\/revisions\/35101"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35068"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35067"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35067"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35067"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}