{"id":35082,"date":"2022-03-14T11:13:48","date_gmt":"2022-03-14T11:13:48","guid":{"rendered":"https:\/\/care4calais.org\/?p=35082"},"modified":"2022-03-16T11:06:04","modified_gmt":"2022-03-16T11:06:04","slug":"shalaws-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/shalaws-story\/","title":{"rendered":"Shalaw&#8217;s Story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">When I was a child in Iraq I had a speech impediment, and was constantly bullied and made fun of. My family thought I’d grow out of it, but I didn’t, and as I got older it got harder to learn and make friends. People would shout names at me on the street, and punch and kick me just because I was different. No one tried to stop it.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I couldn’t help the problem as I was born with it. It came with a learning difficulty that affects my memory. I forget so many things.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The bullying was hard for me to take and my mental health suffered. By the time I was in my twenties my father had become afraid someone would kill me, and he told me to hide in the house, and never go out. I did what he said.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My name is Shalaw, and I am Kurdish. Living in Iraq was hard for me, and staying inside was not a life, so at 23 my father and I decided I must leave the country.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My father found a smuggler who got me onto a plane to Istanbul where they put me in another smuggler’s house. It was terrible. They took my passport and would not let me out. They said I had to stay hidden.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Finally one day they put me in a lorry, which didn’t stop until I reached Calais where I had to get out. From Calais it was up to me to get across the English Channel.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It took many tries but finally I made it.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The authorities sent me to Crewe to the house where I’m living now. I got a lawyer and found some good people who really help me. Volunteers from Care4Calais have helped me a lot. When the card I use to get my £39 a week government allowance stopped working for a while, a Care4Calais volunteer called Pauline bought me food. The card is working now.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I like it here because no one makes fun of me. For the first time ever in my life, people treat me with respect. It is not like Iraq, there are no equality laws or harassment laws.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My lawyer has been good to me, but so far the Home Office will not believe how much I struggle with my speech and my memory, or how much torment I suffered in Iraq. They don’t listen when you talk about bullying. They say my story has changed, but that’s the whole problem, I am here because my memory makes things difficult for me.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I told them how hard my life was in Iraq but my first asylum claim was denied. I felt very sad and didn’t know what to do, but I have been allowed to appeal to a tribunal, and today I sent in my papers for that. My housemate Shaun, Pauline, and another Care4Calais volunteer called Shelagh have helped me a lot with everything, and I hope the Home Office will listen and let me make a future here.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">For now, though, I must wait and hope.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; When I was a child in Iraq I had a speech impediment, and was constantly bullied and made fun of. My family thought I’d grow out of it, but I didn’t, and as I got older it got harder to learn and make friends. People would shout names at me on the street, and punch and kick me just because I was different. No one tried to stop it. I couldn’t help the problem as I was born with it. It came with a learning difficulty that affects my memory. I forget so many things. The bullying was hard for me to take and my mental health suffered. By the time I was in my twenties my father had become afraid someone would kill me, and he told me to hide in the house, and never go out. I did what he said. My name is Shalaw, and I am Kurdish. Living in Iraq was hard for me, and staying inside was not a life, so at 23 my father and I decided I must leave the country. My father found a smuggler who got me onto a plane to Istanbul where they put me in another smuggler’s house. It was terrible. They took my passport and would not let me out. They said I had to stay hidden. Finally one day they put me in a lorry, which didn’t stop until I reached Calais where I had to get out. From Calais it was up to me to get across the English Channel. It took many tries but finally I made it. The authorities sent me to Crewe to the house where I’m living now. I got a lawyer and found some good people who really help me. Volunteers from Care4Calais have helped me a lot. When the card I use to get my £39 a week government allowance stopped working for a while, a Care4Calais volunteer called Pauline bought me food. The card is working now. I like it here because no one makes fun of me. For the first time ever in my life, people treat me with respect. It is not like Iraq, there are no equality laws or harassment laws. My lawyer has been good to me, but so far the Home Office will not believe how much I struggle with my speech and my memory, or how much torment I suffered in Iraq. They don’t listen when you talk about bullying. They say my story has changed, but that’s the whole problem, I am here because my memory makes things difficult for me. I told them how hard my life was in Iraq but my first asylum claim was denied. I felt very sad and didn’t know what to do, but I have been allowed to appeal to a tribunal, and today I sent in my papers for that. My housemate Shaun, Pauline, and another Care4Calais volunteer called Shelagh have helped me a lot with everything, and I hope the Home Office will listen and let me make a future here. For now, though, I must wait and hope. To volunteer or donate go to Care4Calais.org<\/p>\n","protected":false},"author":21,"featured_media":35083,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[169,104],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35082"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35082"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35082\/revisions"}],"predecessor-version":[{"id":35095,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35082\/revisions\/35095"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35083"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35082"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35082"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35082"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}