{"id":35140,"date":"2022-03-19T14:57:43","date_gmt":"2022-03-19T14:57:43","guid":{"rendered":"https:\/\/care4calais.org\/?p=35140"},"modified":"2024-02-21T23:53:48","modified_gmt":"2024-02-21T22:53:48","slug":"sad-news-from-northern-france","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/sad-news-from-northern-france\/","title":{"rendered":"Sudanese man killed by car in Calais"},"content":{"rendered":"<p>Tragically, another refugee has been killed in Calais<\/p>\n<p>The man, Sudanese and his his twenties, was hit by a vehicle while walking on the road near the village of Nouvelle-Eglise at 6am on Thursday morning. Emergency services rushed to the scene, but the man was dead when they arrived.<\/p>\n<p>The man had only been in Calais for a few days, according to the La Voix Du Nord news organisation, so he was probably less aware of the dangers faced refugees here.<\/p>\n<p>He is the fifth refugee to be killed in Calais just this year. This shocking number brings home how dangerous and precarious refugees lives are in northern France. It is tragic for people who have suffered so much in their home countries and then on their journeys to die so needlessly.<\/p>\n<p>This death shows yet again the desperate need for a modern, sensible system of processing asylum claims that would allow refugees safe passage to the UK. This would at one stroke reduce the terrible risks and dangers people have to face to try to reach safety. Instead, the UK Government still insists on pushing through its anti-refugee bill, which will only make things worse.<\/p>\n<p>We now know it is possible to have a visa system to bring people to the UK safely, so why on earth are some still dying as they try to cross the channel?<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tragically, another refugee has been killed in Calais The man, Sudanese and his his twenties, was hit by a vehicle while walking on the road near the village of Nouvelle-Eglise at 6am on Thursday morning. Emergency services rushed to the scene, but the man was dead when they arrived. The man had only been in Calais for a few days, according to the La Voix Du Nord news organisation, so he was probably less aware of the dangers faced refugees here. He is the fifth refugee to be killed in Calais just this year. This shocking number brings home how dangerous and precarious refugees lives are in northern France. It is tragic for people who have suffered so much in their home countries and then on their journeys to die so needlessly. This death shows yet again the desperate need for a modern, sensible system of processing asylum claims that would allow refugees safe passage to the UK. This would at one stroke reduce the terrible risks and dangers people have to face to try to reach safety. Instead, the UK Government still insists on pushing through its anti-refugee bill, which will only make things worse. We now know it is possible to have a visa system to bring people to the UK safely, so why on earth are some still dying as they try to cross the channel? &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":35141,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,17],"tags":[22,74,291,104,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35140"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35140"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35140\/revisions"}],"predecessor-version":[{"id":42998,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35140\/revisions\/42998"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35141"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35140"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35140"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35140"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}