{"id":35274,"date":"2022-03-23T17:56:13","date_gmt":"2022-03-23T17:56:13","guid":{"rendered":"https:\/\/care4calais.org\/?p=35274"},"modified":"2022-03-23T17:56:13","modified_gmt":"2022-03-23T17:56:13","slug":"susans-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/susans-story\/","title":{"rendered":"Susan’s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p dir=\"ltr\">\n<p dir=\"ltr\">Last November, I received an ecstatic message from Susan, a Kenyan asylum seeker who I’d been supporting. She’d finally been granted asylum after waiting months for a decision. I remember thinking this was our “happy ending” at last.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">What I came to learn is that life rarely resembles a fairy-tale.<\/p>\n<p dir=\"ltr\">\n<p dir=\"ltr\">I first met Susan at a weekly C4C drop-in session during lockdown in early 2021. She had asked for a blanket and some clothes.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">She was polite but distant, not ready to trust us quite yet. There was also a fragility about her, and I kept gently checking in to see if she was OK.<\/p>\n<p dir=\"ltr\">\n<p dir=\"ltr\">She came a couple more times to drop-in, and we helped her prepare for her main interview with the Home Office.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">But once I delivered a second-hand laptop to her room and found her in floods of tears. It was one of those days when she was struggling to cope. I wanted to hug her, but wasn’t sure she would welcome the contact. Instead, I patted her arm and tried to comfort her by listening, and suggesting what she could do to seek further support.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">The interminable waiting for an asylum decision from the Home Office was taking its toll.<\/p>\n<p dir=\"ltr\">\n<p dir=\"ltr\">After that she told me more about her troubled childhood in Kenya. Here was a warm, sophisticated woman who had overcome so much heartache in her life. I persuaded her to volunteer for us, helping at clothes distributions and a beauty session that we ran in one of our hotels. Susan was kind and sensitive towards other asylum seekers, often helping them to pick out appropriate clothing from our piles of donations.<\/p>\n<p dir=\"ltr\">\n<p dir=\"ltr\">Then came the good news about her winning asylum.On hearing it, she burst into tears, happy tears this time.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">However, such positive outcomes arrive with a sting in the tail.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">Susan was now expected to move out of her Home Office accommodation, set up a bank account, find somewhere else to live and secure a job – all in just 28 days. Over the following weeks, her stress rocketed as landlords told her they couldn’t take her on as she had no income. Meanwhile, her new bank card kept going missing in the post.<\/p>\n<p dir=\"ltr\">\n<p dir=\"ltr\">Susan had been homeless before, so was frightened of ending on the streets. We tried hard to reassure her, but as the deadline approached, she really suffered. It is testimony to her strength of character that she pulled through and eventually found herself temporary accommodation.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">A small team of C4C volunteers helped to move her belongings into a B&amp;B just before Christmas. A few weeks later, we moved her again into a new flat, rented under a council scheme.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">“Thank you for going out of your way to assist me,” she told us in a message soon after she moved. “The love and support from all at Care4Calais is beyond what the human mind can comprehend.”<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">Despite her struggles, Susan kept on trying to make a future for herself, and found work in the care sector, travelling long distances and working overnight shifts. She’d talked to me before about wanting to work in mental health or become a nurse; now she is on that path and will soon take up a more permanent job closer to home.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">I know Susan will continue to give back, and to support others with warmth and compassion. I feel so proud of the progress she has made despite the enormous obstacles in her way. And  I have no doubt she’ll become an asset to her local community and her newly-adopted country.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Last November, I received an ecstatic message from Susan, a Kenyan asylum seeker who I’d been supporting. She’d finally been granted asylum after waiting months for a decision. I remember thinking this was our “happy ending” at last. &nbsp; What I came to learn is that life rarely resembles a fairy-tale. I first met Susan at a weekly C4C drop-in session during lockdown in early 2021. She had asked for a blanket and some clothes. &nbsp; She was polite but distant, not ready to trust us quite yet. There was also a fragility about her, and I kept gently checking in to see if she was OK. She came a couple more times to drop-in, and we helped her prepare for her main interview with the Home Office. &nbsp; But once I delivered a second-hand laptop to her room and found her in floods of tears. It was one of those days when she was struggling to cope. I wanted to hug her, but wasn’t sure she would welcome the contact. Instead, I patted her arm and tried to comfort her by listening, and suggesting what she could do to seek further support. &nbsp; The interminable waiting for an asylum decision from the Home Office was taking its toll. After that she told me more about her troubled childhood in Kenya. Here was a warm, sophisticated woman who had overcome so much heartache in her life. I persuaded her to volunteer for us, helping at clothes distributions and a beauty session that we ran in one of our hotels. Susan was kind and sensitive towards other asylum seekers, often helping them to pick out appropriate clothing from our piles of donations. Then came the good news about her winning asylum.On hearing it, she burst into tears, happy tears this time. &nbsp; However, such positive outcomes arrive with a sting in the tail. &nbsp; Susan was now expected to move out of her Home Office accommodation, set up a bank account, find somewhere else to live and secure a job – all in just 28 days. Over the following weeks, her stress rocketed as landlords told her they couldn’t take her on as she had no income. Meanwhile, her new bank card kept going missing in the post. Susan had been homeless before, so was frightened of ending on the streets. We tried hard to reassure her, but as the deadline approached, she really suffered. It is testimony to her strength of character that she pulled through and eventually found herself temporary accommodation. &nbsp; A small team of C4C volunteers helped to move her belongings into a B&amp;B just before Christmas. A few weeks later, we moved her again into a new flat, rented under a council scheme. &nbsp; “Thank you for going out of your way to assist me,” she told us in a message soon after she moved. “The love and support from all at Care4Calais is beyond what the human mind can comprehend.” &nbsp; Despite her struggles, Susan kept on trying to make a future for herself, and found work in the care sector, travelling long distances and working overnight shifts. She’d talked to me before about wanting to work in mental health or become a nurse; now she is on that path and will soon take up a more permanent job closer to home. &nbsp; I know Susan will continue to give back, and to support others with warmth and compassion. I feel so proud of the progress she has made despite the enormous obstacles in her way. And  I have no doubt she’ll become an asset to her local community and her newly-adopted country. &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":35275,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35274"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35274"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35274\/revisions"}],"predecessor-version":[{"id":35276,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35274\/revisions\/35276"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35275"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35274"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35274"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35274"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}