{"id":35306,"date":"2022-03-27T09:12:50","date_gmt":"2022-03-27T09:12:50","guid":{"rendered":"https:\/\/care4calais.org\/?p=35306"},"modified":"2022-10-18T11:34:35","modified_gmt":"2022-10-18T10:34:35","slug":"welcoming-refugees-in-kent","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/welcoming-refugees-in-kent\/","title":{"rendered":"Welcoming Refugees in Kent"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>On Thursday about 60 people arrived together on two dinghies on the shore at Dungeness. Most were from Syria, Kuwait and Iran. There was a woman with a young child aged between one and two years old among them, and everyone looked so cold and exhausted by the journey it was painful to see.<\/p>\n<p>Most of their shoes and socks were ruined, all wet and sandy, so I gave out sliders. The Dungeness beach is rocky, and painful on feet, so they make a big difference. I couldn’t believe how polite and kind they were even in this situation. As they were about to be taken off for processing I asked if they wanted to keep their shoes, or if i should throw them away; they all rushed back and looked for their shoes to thrown them in my bin bag themselves!<\/p>\n<p>I also gave 100 bottles of water to the RNLI to give to refugees, as they had run out.<\/p>\n<p>Usually when I arrive to greet new arrivals, the police and Border Force are there already. Once I had a few hard right activists come as well – I can’t imagine how cruel you have to be to abuse someone who has just spent hours risking their lives in a little boat on the sea and is in such a weak state.<\/p>\n<p>When I started, I did wonder how the police and Border Force officials would be with me, but I have to say they’re always pleasant, and they seem happy to have someone helping. It makes their job easier if the refugees feel safe and are looked after.<\/p>\n<p>I wanted to help like this because it breaks my heart to see refugees arriving only to be greeted by hostility from far right groups harassing and filming them. I want to make sure they get a warm welcome and the support they need.<\/p>\n<p>When I see newly-arrived refugees, I feel so pleased and happy to see that they’ve got here safely. Refugees are amazing people. And I happy and proud to be able to welcome them to our country.<\/p>\n<p>&#8211; Katie Sweetingham, volunteer<\/p>\n<p>To volunteer with Care4Calais on the south coast email <a href=\"mailto:annie@care4calais.org\">annie@care4calais.org<\/a><\/p>\n<p>To donate money to welcome refugees arriving on the south coast go to<a href=\"http:\/\/goldengiving.com\/fundraising\/C4C-Emergency-Response-Team-Dover\"> goldengiving.com\/fundraising\/C4C-Emergency-Response-Team-Dover<\/a><\/p>\n<p>#AllRefugeeWelcome<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; On Thursday about 60 people arrived together on two dinghies on the shore at Dungeness. Most were from Syria, Kuwait and Iran. There was a woman with a young child aged between one and two years old among them, and everyone looked so cold and exhausted by the journey it was painful to see. Most of their shoes and socks were ruined, all wet and sandy, so I gave out sliders. The Dungeness beach is rocky, and painful on feet, so they make a big difference. I couldn’t believe how polite and kind they were even in this situation. As they were about to be taken off for processing I asked if they wanted to keep their shoes, or if i should throw them away; they all rushed back and looked for their shoes to thrown them in my bin bag themselves! I also gave 100 bottles of water to the RNLI to give to refugees, as they had run out. Usually when I arrive to greet new arrivals, the police and Border Force are there already. Once I had a few hard right activists come as well – I can’t imagine how cruel you have to be to abuse someone who has just spent hours risking their lives in a little boat on the sea and is in such a weak state. When I started, I did wonder how the police and Border Force officials would be with me, but I have to say they’re always pleasant, and they seem happy to have someone helping. It makes their job easier if the refugees feel safe and are looked after. I wanted to help like this because it breaks my heart to see refugees arriving only to be greeted by hostility from far right groups harassing and filming them. I want to make sure they get a warm welcome and the support they need. When I see newly-arrived refugees, I feel so pleased and happy to see that they’ve got here safely. Refugees are amazing people. And I happy and proud to be able to welcome them to our country. &#8211; Katie Sweetingham, volunteer To volunteer with Care4Calais on the south coast email annie@care4calais.org To donate money to welcome refugees arriving on the south coast go to goldengiving.com\/fundraising\/C4C-Emergency-Response-Team-Dover #AllRefugeeWelcome<\/p>\n","protected":false},"author":21,"featured_media":35307,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35306"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35306"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35306\/revisions"}],"predecessor-version":[{"id":38166,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35306\/revisions\/38166"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35307"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35306"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35306"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35306"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}