{"id":35314,"date":"2022-03-28T17:24:16","date_gmt":"2022-03-28T17:24:16","guid":{"rendered":"https:\/\/care4calais.org\/?p=35314"},"modified":"2023-02-08T16:53:52","modified_gmt":"2023-02-08T15:53:52","slug":"why-phones-are-so-important-to-refugees","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/why-phones-are-so-important-to-refugees\/","title":{"rendered":"This is Why Phones Are So Important to Refugees"},"content":{"rendered":"<p>“There are two ways to get to the UK, by lorry or boat. Both ways, you could be killed. I don’t want to take either, because I am so afraid of losing my life. But my family spent all their money to get me to safety.<\/p>\n<p>So what I can do? I must go on.”<\/p>\n<p>This is how Osama from Sudan described his life in Calais to me. I was sitting at Osama’s campfire after distribution one evening with some of his friends. They’d built the fire where they were living, in some scrub land in the hope the police wouldn’t come and destroy their tents.<\/p>\n<p>He told me was the eldest of seven children. With the conflict in Sudan meaning they had no hope of escaping danger and poverty, the family had given him all the money they had to help him get to northern France. Even so, he had arrived here with only the clothes on his back, and is now getting by on the help that organisations like Care4Calais provide.<\/p>\n<p>“You know, phone charging is the most important thing you do for us,” he said. Phones are vital to refugees. They’re the only way to stay in contact with home, and to check the weather, which is really important if they’re crossing by boat. They also need the GPS to make sure they’re going in the right direction, and then they may need to call the coast guard to be rescued.<\/p>\n<p>Sometimes they have to walk a few hours to go to a phone charging point and then wait for their turn to charge the phone. At distributions, Care4Calais provides charging points – rows of sockets fixed to a board which is then plugged into a generator. Although the boards can charge dozens of phones at a time, there are always more people than sockets, and the generators only operate for a few hours a day.<\/p>\n<p>Sometimes it can take a whole day just to get a phone charged. People often have to choose between a shower, a hot meal or charging. It also means they feel they lose a day as they can’t try to cross if they haven’t charged their phone. They wait so patiently and although they are disappointed when we leave there is never any trouble and the people collect their phones and wander off back to their bit of scrubland in the hope their tent is still there.<\/p>\n<p>Many refugees lose their phones in evictions, and replacements are expensive to buy, but we try to provide as many as we can. We mainly rely on people in the UK donating their old phones to us, so if you have one please send it to us – we’ll make sure it finds a good home, and you’ll make a refugee very happy.<\/p>\n<p>I hoped Osama’s phone got him to the UK all right. “I cannot be silly with this life,” he said as we ended our conversation. “I know either way to the UK is very dangerous, but what can I do? My family is praying for me.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“There are two ways to get to the UK, by lorry or boat. Both ways, you could be killed. I don’t want to take either, because I am so afraid of losing my life. But my family spent all their money to get me to safety. So what I can do? I must go on.” This is how Osama from Sudan described his life in Calais to me. I was sitting at Osama’s campfire after distribution one evening with some of his friends. They’d built the fire where they were living, in some scrub land in the hope the police wouldn’t come and destroy their tents. He told me was the eldest of seven children. With the conflict in Sudan meaning they had no hope of escaping danger and poverty, the family had given him all the money they had to help him get to northern France. Even so, he had arrived here with only the clothes on his back, and is now getting by on the help that organisations like Care4Calais provide. “You know, phone charging is the most important thing you do for us,” he said. Phones are vital to refugees. They’re the only way to stay in contact with home, and to check the weather, which is really important if they’re crossing by boat. They also need the GPS to make sure they’re going in the right direction, and then they may need to call the coast guard to be rescued. Sometimes they have to walk a few hours to go to a phone charging point and then wait for their turn to charge the phone. At distributions, Care4Calais provides charging points – rows of sockets fixed to a board which is then plugged into a generator. Although the boards can charge dozens of phones at a time, there are always more people than sockets, and the generators only operate for a few hours a day. Sometimes it can take a whole day just to get a phone charged. People often have to choose between a shower, a hot meal or charging. It also means they feel they lose a day as they can’t try to cross if they haven’t charged their phone. They wait so patiently and although they are disappointed when we leave there is never any trouble and the people collect their phones and wander off back to their bit of scrubland in the hope their tent is still there. Many refugees lose their phones in evictions, and replacements are expensive to buy, but we try to provide as many as we can. We mainly rely on people in the UK donating their old phones to us, so if you have one please send it to us – we’ll make sure it finds a good home, and you’ll make a refugee very happy. I hoped Osama’s phone got him to the UK all right. “I cannot be silly with this life,” he said as we ended our conversation. “I know either way to the UK is very dangerous, but what can I do? My family is praying for me.”<\/p>\n","protected":false},"author":21,"featured_media":35315,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[156,176,177,171,175,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35314"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35314"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35314\/revisions"}],"predecessor-version":[{"id":36883,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35314\/revisions\/36883"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35315"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35314"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35314"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35314"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}