{"id":35323,"date":"2022-03-29T17:18:50","date_gmt":"2022-03-29T17:18:50","guid":{"rendered":"https:\/\/care4calais.org\/?p=35323"},"modified":"2022-04-06T11:25:24","modified_gmt":"2022-04-06T11:25:24","slug":"zorans-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/zorans-story\/","title":{"rendered":"Zoran’s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>When Zoran was a young boy growing up in Iran, his mum and dad were murdered by the government for their political views. His grandfather raised him in a small, remote village where Zoran got no schooling. Bring Kurdish, Zoran was part of a persecuted minority with little chance of a job.<\/p>\n<p>His parents’ deaths marked the start of years of unhappiness and depression for Zoran, and being isolated and persecuted in the village only made things worse. He knew he had to escape.<\/p>\n<p>Aged just 16 he left home to search for a safe future with the chance of employment, and walked to Turkey with a friend. They smuggled themselves into a fruit lorry, and after three days’ travel they emerged in a town in southern England.<\/p>\n<p>Zoran claimed asylum on the grounds of his Kurdish ethnicity, his political view, and his parents having been murdered for their politics. He also applied on health grounds, citing PTSD and depression caused by his parents’ deaths and his journey to the UK.<br \/>\nHe was put into the care of a local authority and given a social worker, but his asylum claim was refused.<\/p>\n<p>Fortunately he was given discretionary leave to remain in the UK as he was under 18; good news, but just imagine the fear and uncertainty this brought to someone who was still only a child.<\/p>\n<p>Having nothing to go back to in Iran, Zoran tried hard to stay in the UK, where he had found safety. For several years he endured a series of claims, appeals and rejections. In 2017 his lawyer told him nothing else could be done.<\/p>\n<p>But then he met Aiden, a Care4Calais volunteer with our Access Team. And Aiden refused to give up.<\/p>\n<p>At first Aiden helped Zoran to lodge further claims, but these were rejected, and things took a downward turn. Zoran’s support funding was withdrawn, and he ended up sleeping in a disused shop, and scouring for food. He was desperate for money and support, and this took him down a path that included associations with local petty delinquents.<\/p>\n<p>In 2018 he was given a small package to “look after.” When police raided a gathering of people Zoran was among, everybody in the gathering was taken into custody and Zoran’s package turned out to contain a very small amount of an illegal substance. Zoran was charged with possession of drugs.<br \/>\nZoran called Aiden to collect him from the police station at 5am that morning. Aiden found him a criminal defence lawyer willing to work on legal aid, and when Zoran’s case went to Court, he was placed on probation.<\/p>\n<p>The impact of the drugs conviction on the asylum claim now became a huge worry.<br \/>\nZoran, still homeless, developed several serious mental health issues, and Mind and the local authority mental health team sorted out emergency housing and support for him.<br \/>\nTo many people it might have been a lost cause, but not to Aiden.<\/p>\n<p>Somehow, working with incredible dedication, he found another law firm willing to look at Zoran’s case. And the new firm saw a ray of hope.<\/p>\n<p>Zoran’s case had been turned down partly because the Home Office argued that Zoran’s political views and any activity in Iran would be unknown to the Iranian authorities. However, the new firm spotted that Zoran had been involved in political activity in the UK since he arrived here.<\/p>\n<p>Pictures of Zoran protesting outside the Iranian embassy were found on a friend’s social media, and the law firm argued that these pictures were in the public domain, so could easily be seen by the Iranian authorities. A judicial review was lodged, and fingers crossed.<\/p>\n<p>After a few weeks, the Home Office said that if the application for a judicial review was withdrawn, they would reconsider Zoran&#8217;s application. Zoran and his lawyer accepted, and a few months later, he was granted leave to remain for five years.<\/p>\n<p>It was nine years since he left his village. The relief was incredible. This man had grown from a boy into man while he struggled to make a future for himself. Now someone had at last listened to him, he could begin the rest of his life.<\/p>\n<p>Around the same time his probation came to an end, and he became eligible for Housing Benefit and Universal Credit. Eventually, Zoran was assessed as eligible for UC and allocated housing paid for by Housing Benefit.<\/p>\n<p>Towards the end of that year, a British friend of Zoran took him to the Kurdistan Region of Iraq. He has become engaged to a woman there, and is now planning to apply for permission to bring his soon-to-be wife to the UK.<\/p>\n<p>You can only shudder to think what would have become of Zoran without Care4Calais. He would most likely have been left on the streets to become one of the statistics in Britain’s prison system, or he would have been removed from the UK. It took two years of fighting, and endless hours of hard work by Aiden to find lawyers who could take legal aid – and huge amounts of advice and knowledge from others in the Care4Calais team as Aiden liaised with Zoran’s probation officer, social worker and GP, the council, the DWP and the Red Cross.<\/p>\n<p>We were so pleased that Zoran was finally listened to, and that the Home Office realised he did deserve our help. Aiden says it feels amazing to have helped.<\/p>\n<p>“It’s one of the most satisfying things I’ve done with Care4Calais. Zoran is now starting his new life and we have remained friends. In fact he now interprets for Care4Calais volunteers helping recently arrived asylum seekers.<\/p>\n<p>“He’s about the same age as my youngest daughter, and he often tells people I’m his dad. He’s been through an ordeal he did not deserve and to watch him come out the other side and grow is amazing. I can say, ‘we did that’; we helped with that, and it made a difference.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; When Zoran was a young boy growing up in Iran, his mum and dad were murdered by the government for their political views. His grandfather raised him in a small, remote village where Zoran got no schooling. Bring Kurdish, Zoran was part of a persecuted minority with little chance of a job. His parents’ deaths marked the start of years of unhappiness and depression for Zoran, and being isolated and persecuted in the village only made things worse. He knew he had to escape. Aged just 16 he left home to search for a safe future with the chance of employment, and walked to Turkey with a friend. They smuggled themselves into a fruit lorry, and after three days’ travel they emerged in a town in southern England. Zoran claimed asylum on the grounds of his Kurdish ethnicity, his political view, and his parents having been murdered for their politics. He also applied on health grounds, citing PTSD and depression caused by his parents’ deaths and his journey to the UK. He was put into the care of a local authority and given a social worker, but his asylum claim was refused. Fortunately he was given discretionary leave to remain in the UK as he was under 18; good news, but just imagine the fear and uncertainty this brought to someone who was still only a child. Having nothing to go back to in Iran, Zoran tried hard to stay in the UK, where he had found safety. For several years he endured a series of claims, appeals and rejections. In 2017 his lawyer told him nothing else could be done. But then he met Aiden, a Care4Calais volunteer with our Access Team. And Aiden refused to give up. At first Aiden helped Zoran to lodge further claims, but these were rejected, and things took a downward turn. Zoran’s support funding was withdrawn, and he ended up sleeping in a disused shop, and scouring for food. He was desperate for money and support, and this took him down a path that included associations with local petty delinquents. In 2018 he was given a small package to “look after.” When police raided a gathering of people Zoran was among, everybody in the gathering was taken into custody and Zoran’s package turned out to contain a very small amount of an illegal substance. Zoran was charged with possession of drugs. Zoran called Aiden to collect him from the police station at 5am that morning. Aiden found him a criminal defence lawyer willing to work on legal aid, and when Zoran’s case went to Court, he was placed on probation. The impact of the drugs conviction on the asylum claim now became a huge worry. Zoran, still homeless, developed several serious mental health issues, and Mind and the local authority mental health team sorted out emergency housing and support for him. To many people it might have been a lost cause, but not to Aiden. Somehow, working with incredible dedication, he found another law firm willing to look at Zoran’s case. And the new firm saw a ray of hope. Zoran’s case had been turned down partly because the Home Office argued that Zoran’s political views and any activity in Iran would be unknown to the Iranian authorities. However, the new firm spotted that Zoran had been involved in political activity in the UK since he arrived here. Pictures of Zoran protesting outside the Iranian embassy were found on a friend’s social media, and the law firm argued that these pictures were in the public domain, so could easily be seen by the Iranian authorities. A judicial review was lodged, and fingers crossed. After a few weeks, the Home Office said that if the application for a judicial review was withdrawn, they would reconsider Zoran&#8217;s application. Zoran and his lawyer accepted, and a few months later, he was granted leave to remain for five years. It was nine years since he left his village. The relief was incredible. This man had grown from a boy into man while he struggled to make a future for himself. Now someone had at last listened to him, he could begin the rest of his life. Around the same time his probation came to an end, and he became eligible for Housing Benefit and Universal Credit. Eventually, Zoran was assessed as eligible for UC and allocated housing paid for by Housing Benefit. Towards the end of that year, a British friend of Zoran took him to the Kurdistan Region of Iraq. He has become engaged to a woman there, and is now planning to apply for permission to bring his soon-to-be wife to the UK. You can only shudder to think what would have become of Zoran without Care4Calais. He would most likely have been left on the streets to become one of the statistics in Britain’s prison system, or he would have been removed from the UK. It took two years of fighting, and endless hours of hard work by Aiden to find lawyers who could take legal aid – and huge amounts of advice and knowledge from others in the Care4Calais team as Aiden liaised with Zoran’s probation officer, social worker and GP, the council, the DWP and the Red Cross. We were so pleased that Zoran was finally listened to, and that the Home Office realised he did deserve our help. Aiden says it feels amazing to have helped. “It’s one of the most satisfying things I’ve done with Care4Calais. Zoran is now starting his new life and we have remained friends. In fact he now interprets for Care4Calais volunteers helping recently arrived asylum seekers. “He’s about the same age as my youngest daughter, and he often tells people I’m his dad. He’s been through an ordeal he did not deserve and to watch him come out the other side and grow is amazing. I can say, ‘we did that’; we helped with that, and it made a difference.”<\/p>\n","protected":false},"author":21,"featured_media":35324,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[130,173,174,172,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35323"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35323"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35323\/revisions"}],"predecessor-version":[{"id":35325,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35323\/revisions\/35325"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35324"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35323"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35323"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35323"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}