{"id":35393,"date":"2022-04-02T10:18:36","date_gmt":"2022-04-02T10:18:36","guid":{"rendered":"https:\/\/care4calais.org\/?p=35393"},"modified":"2023-02-08T16:50:44","modified_gmt":"2023-02-08T15:50:44","slug":"our-volunteers-helping-amid-terrible-conditions","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/our-volunteers-helping-amid-terrible-conditions\/","title":{"rendered":"Our volunteers helping amid terrible conditions"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\"><\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">\n<p><span style=\"font-weight: 400;\">In the last 24 hours our volunteers in Calais have made us so proud with their incredible hard work to help refugees in a desperate situation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It has been literally freezing in Calais and Dunkirk, with snow on the ground and a wind chill lowering temperatures to minus five. Human beings should not be outside at all in such conditions, let alone sleeping rough and living in tents, as refugees are. A large gym in Dunkirk has been opened to provide shelter for about 200 refugees, but that is not nearly enough.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">And as if this were not bad enough, yesterday there was a big evacuation of the camp in Dunkirk, meaning that people lost tents, sleeping bags and the few other possessions they had. It was inhuman, and left people cold, wet and traumatised.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This was an emergency, and our volunteers responded immediately. We sent out a team to Dunkirk to give out tents, sleeping bags, food packs and 200 snug packs &#8211; each containing a hat, scarf , gloves and a pair of socks.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We also sent a team to Calais to give out sleeping bags, tents, blankets and jackets. And a team in the warehouse worked late to sort donations so that if the bad weather continues, or there are other emergencies, we’ll be ready to help. It’s cold and snowy in our warehouse yard, so working there isn’t easy.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Our volunteers are of all ages and come from many different walks of life, but their shared compassion and dedication to helping refugees means they work together so brilliantly. In situations like this, they really do the most incredible job &#8211;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">and make a huge difference to people who would otherwise be left without help in the most horrific circumstances.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can buy a food parcel to feed a family of four people for just £10. Go to<\/span><a href=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2Fcare4calais.org%2Fdonate&amp;h=AT1SwivCt57_-JFJg-UmoU_kxRZeF-5t9Fihtt-E_BMLA8qC-mIEdFCSssJCpT52UjFtuzBm7qJqbBtFXuSS-LrOz-0PB9gSBPQpy-vEvNFLWrtk5_7Vd1_7GFFFKfz55Ed3hZIFmW3EUGUX4TSa&amp;__tn__=-UK-R&amp;c[0]=AT1ztuI-X78IuBgnR1U5PEGt2bP0ofSN9FcGjCnQr_HzDBUkjGzt5wnzBZ7AnwaLSm59S9KoVHe2IYDRFJd9tN9rld-59DbsCCaMSIs_Y_59Y0q8-UIcEktkZOfg6gCmtKShVHjTFF1F7JZnDiS3dVUHxCjKAkFevFsip5EWAn1bQ_v3SZwf5P8Sic5Bkzmw9k4Q84Fx\"><span style=\"font-weight: 400;\"> care4calais.org\/donate<\/span><\/a><\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; In the last 24 hours our volunteers in Calais have made us so proud with their incredible hard work to help refugees in a desperate situation. It has been literally freezing in Calais and Dunkirk, with snow on the ground and a wind chill lowering temperatures to minus five. Human beings should not be outside at all in such conditions, let alone sleeping rough and living in tents, as refugees are. A large gym in Dunkirk has been opened to provide shelter for about 200 refugees, but that is not nearly enough. And as if this were not bad enough, yesterday there was a big evacuation of the camp in Dunkirk, meaning that people lost tents, sleeping bags and the few other possessions they had. It was inhuman, and left people cold, wet and traumatised. This was an emergency, and our volunteers responded immediately. We sent out a team to Dunkirk to give out tents, sleeping bags, food packs and 200 snug packs &#8211; each containing a hat, scarf , gloves and a pair of socks. We also sent a team to Calais to give out sleeping bags, tents, blankets and jackets. And a team in the warehouse worked late to sort donations so that if the bad weather continues, or there are other emergencies, we’ll be ready to help. It’s cold and snowy in our warehouse yard, so working there isn’t easy. Our volunteers are of all ages and come from many different walks of life, but their shared compassion and dedication to helping refugees means they work together so brilliantly. In situations like this, they really do the most incredible job &#8211; and make a huge difference to people who would otherwise be left without help in the most horrific circumstances. You can buy a food parcel to feed a family of four people for just £10. Go to care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":35394,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35393"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35393"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35393\/revisions"}],"predecessor-version":[{"id":39703,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35393\/revisions\/39703"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35394"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35393"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35393"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35393"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}