{"id":35433,"date":"2022-04-10T10:07:13","date_gmt":"2022-04-10T10:07:13","guid":{"rendered":"https:\/\/care4calais.org\/?p=35433"},"modified":"2022-04-11T10:09:04","modified_gmt":"2022-04-11T10:09:04","slug":"samis-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/samis-story\/","title":{"rendered":"Sami&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">I came from Afghanistan to the UK, and it took me two years. It began on a normal day in my village. I was at school studying. My parents and small brother had gone to a wedding in the city, Jalalabad. The city was a few hours away and they had to get back before dark.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Life in Afghanistan was so dangerous for normal people. No one went out at night. There was no law or order, people did what they wanted. That included shooting at cars for target practice. Any car. They didn’t care.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">That day, someone shot my family’s car. They had done nothing wrong, but my mum, my dad and small brother were all killed. I don’t remember much about what happened, I just remember finding them in the car.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I was only 16 and I had no one else to look after me. My uncle helped me arrange the funeral for my family, and then I was alone. He said I should leave Afghanistan as the same could happen to me. So after a month I left.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My uncle found a man who would help me across the border to Pakistan. I had no passport so I had to get across illegally, then stayed in Pakistan two days before setting off for Iran.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To get into Iran you have to cross a mountain called Mushkil. It means “hard”. It is high and barren, no green at all, like a desert of stones. I was told to bring water and some food, and I joined others for the crossing.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It was really hard going for me, but others found it much harder. At one place we stopped to pray at some graves of people who had died on the mountain. It took 18 hours to cross the mountain, we didn’t stop and some people could not keep up. We had to leave them.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Finally we reached Iran and had to start walking on the road until a taxi came for us. It was the smugglers’ car.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It took me a month to cross Iran, I think I was in 14 different cars. The cars were always packed with other people like me, and because I was small they put me in the boot. One time there were four people in the boot, I could not breathe in the darkness.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">After some time we reached the Turkish border. The weather was not good though and the smugglers said we could not cross we had to wait. We had to wait ten days, hiding in a small house. We were not allowed to go outside. Then the day came and we were going.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We walked to the mountains between Iran and Turkey. I made a friend because we were both on our own. I bought him food and water. It is not good to be alone on journeys like this. When we got there, I saw the mountain we had to cross was very high, higher than Mushkil. You had to put your head back to see the top, which was covered in snow. I had lost my coat way back, as Iran was so hot and I could not carry everything. I had only a traditional shawl for warmth.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">There were maybe 100 of us at the bottom of the mountain. The snow was deep and the smugglers told us to make a long line, like a snake one behind the other as it would make a path through the snow for the ones at the back.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The snow got deeper and deeper, and it was so cold. I wrapped my shawl round me and just moved. That night a storm blew up, and after three or four hours I could hear people crying for help. They were screaming for someone to find them. I think they had lost the path, but I didn’t know where they were, because I couldn’t see in the snow. No one helped them because we couldn’t help ourselves. We just moved on with our heads down.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I can hear them screaming now.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Finally we made it to the other side of the mountain, cold, wet and exhausted. We had to run across the road before it got light to avoid the police who patrolled the area. At last we were in Turkey. We hid in a farm for two days until we could move again, and although we had crossed the mountain, we were in serious danger because if we were caught they would deport us back to Iran or Pakistan.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Two days later we set off for Talvan. We had to cross Lake Van on a ship – I only had one jumper still and it was so cold and dangerous. At Talvan I had to sleep in a park, but the local people were kind, they did not have much but they gave us bread and were not cruel.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">From here we had to get a bus to Istanbul. My smuggler had left me now, that part of my journey was finished, my money was gone and I was on my own.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I wasn’t really aiming at the UK, just somewhere that would accept me and let me study and play cricket. But I set off in that direction, and went to Istanbul, where I got a job and stayed for eight months. I saved money to pay for the next part of my journey, to Greece and then across the Balkans. That was terrible; I was caught and beaten so many times. Maybe I can tell you about that another time, people need to know these things.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In France and the UK, Care4Calais helped me. I am in the UK now, and waiting to get a lawyer to progress my asylum claim. I am studying English and Maths at Croydon College. In the future I want to be a home designer. Why? Because when I moved through Italy and France I saw so many beautiful homes so different from Afghanistan. I think people in Europe really care about beautiful things and I want to make beautiful houses.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I am happy to be here, don’t get me wrong and I know I am safe but something in side me has changed. Maybe I am broken, I don’t know. I used to make so many friends but now I don’t want to go outside or meet friends. I haven’t even been to London bridge, I don’t want to any more. Sab from Care4Calais bought me a diary – she said I should write in to and it might help me. I don’t know but I hope you read my story.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Daisy said I could make it into a book like Gulwali Passerlay in time, to process what I have been through.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I was a child when I left and I feel like an old man now. I hope in time I will get better. For now I will look forward to playing cricket because I remember being happy when I played in Afghanistan, a lifetime ago.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">&#8211; Sami<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To volunteer or donate go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2FCare4Calais.org%2F&amp;h=AT3pv480pG71xhoid09XRsEZidm3lSWAOuqbTGJ9XtKBCOJvWOnf5PFZIZqgtr050JwjpgkW14iXiorUIwVg19xSu2Q2iPMzlv6alROIQyqaMhyrj3tRbNT3SGhd4Etv1NibbZQdvuHmZJvGotGr&amp;__tn__=-UK-R&amp;c[0]=AT0Hxe0j2VpALvyg_rB_wC2qQNwdZNWc-fic8fk2sHySVR7Amr6rC8VzGMlkLejhHjUmQ2fSoV5SjpibSUbwbMOTiQxyCl9KcNldO5Yu1yUFg7-C3BOEFN9rRQjXKSLLe7z--uvhrDDHUqT14xQhqN9kwg_F87GJlcFpngF10_hRihEVQMPq16xQE8mPBA91gNC1boVY\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; I came from Afghanistan to the UK, and it took me two years. It began on a normal day in my village. I was at school studying. My parents and small brother had gone to a wedding in the city, Jalalabad. The city was a few hours away and they had to get back before dark. Life in Afghanistan was so dangerous for normal people. No one went out at night. There was no law or order, people did what they wanted. That included shooting at cars for target practice. Any car. They didn’t care. That day, someone shot my family’s car. They had done nothing wrong, but my mum, my dad and small brother were all killed. I don’t remember much about what happened, I just remember finding them in the car. I was only 16 and I had no one else to look after me. My uncle helped me arrange the funeral for my family, and then I was alone. He said I should leave Afghanistan as the same could happen to me. So after a month I left. My uncle found a man who would help me across the border to Pakistan. I had no passport so I had to get across illegally, then stayed in Pakistan two days before setting off for Iran. To get into Iran you have to cross a mountain called Mushkil. It means “hard”. It is high and barren, no green at all, like a desert of stones. I was told to bring water and some food, and I joined others for the crossing. It was really hard going for me, but others found it much harder. At one place we stopped to pray at some graves of people who had died on the mountain. It took 18 hours to cross the mountain, we didn’t stop and some people could not keep up. We had to leave them. Finally we reached Iran and had to start walking on the road until a taxi came for us. It was the smugglers’ car. It took me a month to cross Iran, I think I was in 14 different cars. The cars were always packed with other people like me, and because I was small they put me in the boot. One time there were four people in the boot, I could not breathe in the darkness. After some time we reached the Turkish border. The weather was not good though and the smugglers said we could not cross we had to wait. We had to wait ten days, hiding in a small house. We were not allowed to go outside. Then the day came and we were going. We walked to the mountains between Iran and Turkey. I made a friend because we were both on our own. I bought him food and water. It is not good to be alone on journeys like this. When we got there, I saw the mountain we had to cross was very high, higher than Mushkil. You had to put your head back to see the top, which was covered in snow. I had lost my coat way back, as Iran was so hot and I could not carry everything. I had only a traditional shawl for warmth. There were maybe 100 of us at the bottom of the mountain. The snow was deep and the smugglers told us to make a long line, like a snake one behind the other as it would make a path through the snow for the ones at the back. The snow got deeper and deeper, and it was so cold. I wrapped my shawl round me and just moved. That night a storm blew up, and after three or four hours I could hear people crying for help. They were screaming for someone to find them. I think they had lost the path, but I didn’t know where they were, because I couldn’t see in the snow. No one helped them because we couldn’t help ourselves. We just moved on with our heads down. I can hear them screaming now. Finally we made it to the other side of the mountain, cold, wet and exhausted. We had to run across the road before it got light to avoid the police who patrolled the area. At last we were in Turkey. We hid in a farm for two days until we could move again, and although we had crossed the mountain, we were in serious danger because if we were caught they would deport us back to Iran or Pakistan. Two days later we set off for Talvan. We had to cross Lake Van on a ship – I only had one jumper still and it was so cold and dangerous. At Talvan I had to sleep in a park, but the local people were kind, they did not have much but they gave us bread and were not cruel. From here we had to get a bus to Istanbul. My smuggler had left me now, that part of my journey was finished, my money was gone and I was on my own. I wasn’t really aiming at the UK, just somewhere that would accept me and let me study and play cricket. But I set off in that direction, and went to Istanbul, where I got a job and stayed for eight months. I saved money to pay for the next part of my journey, to Greece and then across the Balkans. That was terrible; I was caught and beaten so many times. Maybe I can tell you about that another time, people need to know these things. In France and the UK, Care4Calais helped me. I am in the UK now, and waiting to get a lawyer to progress my asylum claim. I am studying English and Maths at Croydon College. In the future I want to be a home designer. Why? Because when I moved through Italy and France I saw so many beautiful homes so [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":35434,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35433"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35433"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35433\/revisions"}],"predecessor-version":[{"id":35435,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35433\/revisions\/35435"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35434"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35433"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35433"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35433"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}