{"id":35496,"date":"2022-04-14T16:55:33","date_gmt":"2022-04-14T16:55:33","guid":{"rendered":"https:\/\/care4calais.org\/?p=35496"},"modified":"2022-10-18T11:31:11","modified_gmt":"2022-10-18T10:31:11","slug":"the-journey-is-hard-but-were-there-for-them","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-journey-is-hard-but-were-there-for-them\/","title":{"rendered":"The journey is hard, but we&#8217;re there for them"},"content":{"rendered":"<p>Yesterday 116 refugees in three three boats came ashore at Dungeness. We understand that that everyone on the first two boats was from Syria, and the people in the the third were from Kurdistan and Afghanistan. There were a lot of women and children on the first two boats, including some children who were unaccompanied. Many people looked cold and exhausted, and some were upset and confused &#8211; some much that it tore at your heart to see them.<\/p>\n<p>There was one family with a small boy and a lady who was just crying uncontrollably. She was obviously in shock, and kept saying how awful the crossing had been. I think she had a vitamin deficiency, and her little boy looked like he was in shock as well. I gave her a complete change of clothing, and by the time she had to leave, she said she was a lot better.<\/p>\n<p>Working alongside our friends at Channel Rescue, we handed out packs with hats, gloves, sliders, socks and scarves. And oat bars – I deliberately got wrapped oat bars because it’s Ramadan and someone won’t necessarily want to eat straight away. Then we distributed water and blankets. The little kids loved the Easter eggs we gave them.<\/p>\n<p>There was one lady who was diabetic. She was very unwell, and the others asked me if I had any chocolate, so I ran to a shop and got some Easter eggs! I gave her those, and then she was taken off the boat separately.<\/p>\n<p>Watching the refugees when they got off the boat, you think about the journey they’ve been on – these guys today were on the boat for eight hours because they’d gone really far out. We try and make their arrival a little bit more pleasant considering what they’ve gone through, which is going to be hiding out for hours, hiding from police, in the freezing cold.<\/p>\n<p>It’s difficult, because nobody explains what’s going to happen to them. So we explain the process. I tell them that they’re going to be searched, and have their things taken off them, and then they’ll have to get on the coach and go to the Kent intake unit.<\/p>\n<p>The government is deliberately hostile to them, and they make their lives even harder. You’ve got amazing people that often have incredible skills that would be an absolute asset to the UK, who are treated appallingly.<\/p>\n<p>After today’s horrible announcement about offshore processing, it felt extra-important to welcome these people to the UK. Anything that we can do to make the lives of people more bearable when they have already been through a really, really difficult time, is valuable – and now more than ever.<\/p>\n<p>To make a donation to our welcoming work visit: <a href=\"http:\/\/www.peoplesfundraising.com\/fundraising\/c4c-emergency-response-team-dover&amp;tag=\">www.peoplesfundraising.com\/fundraising\/c4c-emergency-response-team-dover&amp;tag=<\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday 116 refugees in three three boats came ashore at Dungeness. We understand that that everyone on the first two boats was from Syria, and the people in the the third were from Kurdistan and Afghanistan. There were a lot of women and children on the first two boats, including some children who were unaccompanied. Many people looked cold and exhausted, and some were upset and confused &#8211; some much that it tore at your heart to see them. There was one family with a small boy and a lady who was just crying uncontrollably. She was obviously in shock, and kept saying how awful the crossing had been. I think she had a vitamin deficiency, and her little boy looked like he was in shock as well. I gave her a complete change of clothing, and by the time she had to leave, she said she was a lot better. Working alongside our friends at Channel Rescue, we handed out packs with hats, gloves, sliders, socks and scarves. And oat bars – I deliberately got wrapped oat bars because it’s Ramadan and someone won’t necessarily want to eat straight away. Then we distributed water and blankets. The little kids loved the Easter eggs we gave them. There was one lady who was diabetic. She was very unwell, and the others asked me if I had any chocolate, so I ran to a shop and got some Easter eggs! I gave her those, and then she was taken off the boat separately. Watching the refugees when they got off the boat, you think about the journey they’ve been on – these guys today were on the boat for eight hours because they’d gone really far out. We try and make their arrival a little bit more pleasant considering what they’ve gone through, which is going to be hiding out for hours, hiding from police, in the freezing cold. It’s difficult, because nobody explains what’s going to happen to them. So we explain the process. I tell them that they’re going to be searched, and have their things taken off them, and then they’ll have to get on the coach and go to the Kent intake unit. The government is deliberately hostile to them, and they make their lives even harder. You’ve got amazing people that often have incredible skills that would be an absolute asset to the UK, who are treated appallingly. After today’s horrible announcement about offshore processing, it felt extra-important to welcome these people to the UK. Anything that we can do to make the lives of people more bearable when they have already been through a really, really difficult time, is valuable – and now more than ever. To make a donation to our welcoming work visit: www.peoplesfundraising.com\/fundraising\/c4c-emergency-response-team-dover&amp;tag= &nbsp; &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":35497,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[156,178,70,179,180],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35496"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35496"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35496\/revisions"}],"predecessor-version":[{"id":38160,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35496\/revisions\/38160"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35497"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35496"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35496"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35496"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}