{"id":35559,"date":"2022-04-25T10:55:42","date_gmt":"2022-04-25T10:55:42","guid":{"rendered":"https:\/\/care4calais.org\/?p=35559"},"modified":"2022-10-18T11:30:40","modified_gmt":"2022-10-18T10:30:40","slug":"government-backs-down-on-pushbacks","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/government-backs-down-on-pushbacks\/","title":{"rendered":"Government backs down on pushbacks"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>We are proud and delighted that the Home Secretary has abandoned the controversial Pushbacks policy just over a week before our case was due to be heard in the High Court.<\/p>\n<p>Care4Calais joined forces with the Public and Commercial Services Union, Channel Rescue and Freedom from Torture to challenge the proposed Home Office policy to forcibly push back small refugee boats in the English Channel. The hearing was set for May 3rd.<\/p>\n<p>On Sunday night the Home Office wrote to confirm the policy has been withdrawn.<\/p>\n<p>Before today, Priti Patel had repeatedly insisted that the pushback policy would be used, but the climbdown shows that the policy was never really viable. There is simply no safe way to carry out pushbacks at sea, which means the Home Office attempt to defend them was almost certain to fail. It is a shame that it took a legal challenge from us and others to bring it to an end.<\/p>\n<p>It is now clear that the pushbacks policy was only ever another example of this government trying to score political points by bullying vulnerable people who simply need our help.<\/p>\n<p>It is great that no more time and money will be wasted on this, but now we must look to a new danger created by another impractical, toxic, publicity-seeking seek threat from this government. We’re preparing to challenge the plan to send innocent people to Rwanda &#8211; another staggeringly expensive exercise with cruelty to innocent people at its heart.<\/p>\n<p>As compassionate, caring people who are prepared to act, we should take heart from this climbdown. We must keep fighting this government’s seemingly endless stream of despicable schemes, and that means fighting the Rwanda plan.<\/p>\n<p>We would like to thank all our amazing supporters who enabled us to challenge the pushbacks policy. We want you to know that your support has saved lives. We also want to thank our brilliant lawyers Duncan Lewis.<\/p>\n<p>For the sake of those who need our help so badly, we will never, ever give up. Please donate now to support our work<br \/>\n<a href=\"http:\/\/care4calais.org\/donate\">care4calais.org\/donate<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; &nbsp; We are proud and delighted that the Home Secretary has abandoned the controversial Pushbacks policy just over a week before our case was due to be heard in the High Court. Care4Calais joined forces with the Public and Commercial Services Union, Channel Rescue and Freedom from Torture to challenge the proposed Home Office policy to forcibly push back small refugee boats in the English Channel. The hearing was set for May 3rd. On Sunday night the Home Office wrote to confirm the policy has been withdrawn. Before today, Priti Patel had repeatedly insisted that the pushback policy would be used, but the climbdown shows that the policy was never really viable. There is simply no safe way to carry out pushbacks at sea, which means the Home Office attempt to defend them was almost certain to fail. It is a shame that it took a legal challenge from us and others to bring it to an end. It is now clear that the pushbacks policy was only ever another example of this government trying to score political points by bullying vulnerable people who simply need our help. It is great that no more time and money will be wasted on this, but now we must look to a new danger created by another impractical, toxic, publicity-seeking seek threat from this government. We’re preparing to challenge the plan to send innocent people to Rwanda &#8211; another staggeringly expensive exercise with cruelty to innocent people at its heart. As compassionate, caring people who are prepared to act, we should take heart from this climbdown. We must keep fighting this government’s seemingly endless stream of despicable schemes, and that means fighting the Rwanda plan. We would like to thank all our amazing supporters who enabled us to challenge the pushbacks policy. We want you to know that your support has saved lives. We also want to thank our brilliant lawyers Duncan Lewis. For the sake of those who need our help so badly, we will never, ever give up. Please donate now to support our work care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":35560,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35559"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35559"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35559\/revisions"}],"predecessor-version":[{"id":38159,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35559\/revisions\/38159"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35560"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35559"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35559"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35559"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}