{"id":35611,"date":"2022-05-02T18:09:39","date_gmt":"2022-05-02T18:09:39","guid":{"rendered":"https:\/\/care4calais.org\/?p=35611"},"modified":"2023-02-08T16:48:00","modified_gmt":"2023-02-08T15:48:00","slug":"an-eid-story-of-kindness-and-love","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/an-eid-story-of-kindness-and-love\/","title":{"rendered":"An Eid Story of Kindness and Love"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Today and tomorrow\/yesterday and today Muslims are celebrating Eid, and in for Muslim refugees in northern France this can be a bittersweet time as they remember their homes and families, and the visits and gift-giving that are part of the festivities. To help make the days feel special, we have given out special gift bags that our volunteers have carefully prepared over the last month.<\/p>\n<p>Each bag contains a bar of chocolate, a can of Coke, two different SIM cards, a<br \/>\nGoogle Power Bank and cable, socks, hand sanitizer, tissues and a gift-wrapped hand- or head-torch donated by supporters in Germany. It’s a way of showing these brave, resilient people far from home that they are loved and cared about, and refugees tell us that it means a lot to them.<\/p>\n<p>For me, this time of year always reminds me of a moment that showed me the kindness and honesty of people here. Back in 2015 I was volunteering in the original Dunkirk camp, “Basroch”, and this particular trip I had my mum with me (no matter how old we are we always like having our mums near by ; ))<\/p>\n<p>We had been distributing food and clothes [?] that Care4Calais supporters had donated when a young Iraqi lad aged around 17 approached my mum and me.<\/p>\n<p>He was very slight in build, and wearing a pink jumper that was too short in the sleeves for him. At first I assumed he would be in need of warmer clothing that fitted him better, but no &#8211; he just thanked us for the clothing we had had given to he and his family the previous day. It turned out he was responsible for his four younger siblings.<\/p>\n<p>What he wanted, he told us, was to buy a chicken so that he could feed his family. His problem was that he didn’t have any Euros, and he asked if we could help.<\/p>\n<p>As is always the way, I didn’t have any money on me, so I turned to my mum – and fortunately, as is always the way with my mum, she had some money as back up on her!<\/p>\n<p>I borrowed a five Euro note and handed it over, but the lad didn’t take the money. Instead he took an Iraqi note from his pocket, and held it out. He didn’t want charity; he just wanted to swap his note for mine. In Iraq, he said, his note would pay for a chicken, and the only way he would accept my note was if I took his in exchange. He wouldn’t have it any other way.<\/p>\n<p>And so in the end we swapped notes, and he went off to buy the chicken for his family. When I looked for him again a few days later I couldn’t find him or his siblings, and shortly afterwards I heard that he’d made it to the UK. I never saw him again, but I’ve kept the bank note he gave me in my purse at all times ever since.<\/p>\n<p>I’ve been volunteering for a few years now, and I’ve met many amazing people from many countries, and had many different experiences, some heart warming and some heart breaking. But that young man will stay in my heart and mind and forever; and whenever my purse is empty (which happens quite frequently) I look at that note, and I’m reminded that in many other ways I’m very wealthy.<\/p>\n<p>Eid Mubarak!<\/p>\n<p>Sarah, Calais<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-35615\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/2E18DB70-734A-48C9-BE3B-2B98EAF27CE7-300x225.jpeg\" alt=\"\" width=\"300\" height=\"225\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/2E18DB70-734A-48C9-BE3B-2B98EAF27CE7-300x225.jpeg 300w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/2E18DB70-734A-48C9-BE3B-2B98EAF27CE7-1024x769.jpeg 1024w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/2E18DB70-734A-48C9-BE3B-2B98EAF27CE7-768x577.jpeg 768w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/2E18DB70-734A-48C9-BE3B-2B98EAF27CE7.jpeg 1201w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><br \/>\n<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-35616\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/E24F632C-98A8-4A6B-B2F0-62DDD6B8AFCF-300x225.jpeg\" alt=\"\" width=\"300\" height=\"225\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/E24F632C-98A8-4A6B-B2F0-62DDD6B8AFCF-300x225.jpeg 300w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/E24F632C-98A8-4A6B-B2F0-62DDD6B8AFCF-1024x768.jpeg 1024w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/E24F632C-98A8-4A6B-B2F0-62DDD6B8AFCF-768x576.jpeg 768w, https:\/\/care4calais.org\/wp-content\/uploads\/2022\/05\/E24F632C-98A8-4A6B-B2F0-62DDD6B8AFCF.jpeg 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Today and tomorrow\/yesterday and today Muslims are celebrating Eid, and in for Muslim refugees in northern France this can be a bittersweet time as they remember their homes and families, and the visits and gift-giving that are part of the festivities. To help make the days feel special, we have given out special gift bags that our volunteers have carefully prepared over the last month. Each bag contains a bar of chocolate, a can of Coke, two different SIM cards, a Google Power Bank and cable, socks, hand sanitizer, tissues and a gift-wrapped hand- or head-torch donated by supporters in Germany. It’s a way of showing these brave, resilient people far from home that they are loved and cared about, and refugees tell us that it means a lot to them. For me, this time of year always reminds me of a moment that showed me the kindness and honesty of people here. Back in 2015 I was volunteering in the original Dunkirk camp, “Basroch”, and this particular trip I had my mum with me (no matter how old we are we always like having our mums near by ; )) We had been distributing food and clothes [?] that Care4Calais supporters had donated when a young Iraqi lad aged around 17 approached my mum and me. He was very slight in build, and wearing a pink jumper that was too short in the sleeves for him. At first I assumed he would be in need of warmer clothing that fitted him better, but no &#8211; he just thanked us for the clothing we had had given to he and his family the previous day. It turned out he was responsible for his four younger siblings. What he wanted, he told us, was to buy a chicken so that he could feed his family. His problem was that he didn’t have any Euros, and he asked if we could help. As is always the way, I didn’t have any money on me, so I turned to my mum – and fortunately, as is always the way with my mum, she had some money as back up on her! I borrowed a five Euro note and handed it over, but the lad didn’t take the money. Instead he took an Iraqi note from his pocket, and held it out. He didn’t want charity; he just wanted to swap his note for mine. In Iraq, he said, his note would pay for a chicken, and the only way he would accept my note was if I took his in exchange. He wouldn’t have it any other way. And so in the end we swapped notes, and he went off to buy the chicken for his family. When I looked for him again a few days later I couldn’t find him or his siblings, and shortly afterwards I heard that he’d made it to the UK. I never saw him again, but I’ve kept the bank note he gave me in my purse at all times ever since. I’ve been volunteering for a few years now, and I’ve met many amazing people from many countries, and had many different experiences, some heart warming and some heart breaking. But that young man will stay in my heart and mind and forever; and whenever my purse is empty (which happens quite frequently) I look at that note, and I’m reminded that in many other ways I’m very wealthy. Eid Mubarak! Sarah, Calais<\/p>\n","protected":false},"author":21,"featured_media":35612,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35611"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35611"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35611\/revisions"}],"predecessor-version":[{"id":35617,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35611\/revisions\/35617"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35612"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35611"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35611"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35611"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}