{"id":35618,"date":"2022-04-27T18:21:38","date_gmt":"2022-04-27T18:21:38","guid":{"rendered":"https:\/\/care4calais.org\/?p=35618"},"modified":"2022-10-18T11:29:13","modified_gmt":"2022-10-18T10:29:13","slug":"were-going-to-court-to-stop-rwanda","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/were-going-to-court-to-stop-rwanda\/","title":{"rendered":"We&#8217;re going to court to stop Rwanda"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>We’re going to court to #StopRwanda<\/p>\n<p>And we need your help.<\/p>\n<p>Yesterday morning we sent a legal letter to the Government challenging their reprehensible plan to send refugees to Rwanda.<\/p>\n<p>We are doing this with our friends from Detention Action, the PCS Union, whose members will be tasked to carry out the plan, and our fantastic lawyers, Duncan Lewis.<\/p>\n<p>The government’s plan is a threat to the lives of refugees, the international reputation of the United Kingdom and the finances of British people. From the suspiciously sparse detail presented so far, it is already clear the plan holds multiple risks.<\/p>\n<p>Innocent people will be needlessly and cruelly traumatised. Refugees who have already suffered extreme trauma will now be forced on 4000-mile journeys to an unfamiliar destination where they will be detained. This will cause immeasurable fear, anguish and distress.<\/p>\n<p>Refugees will not be safe. Rwanda is a dictatorship that imprisons, tortures and murders people who speak out against the government. Amnesty International and Human Rights Watch have identified multiple opponents of President Kagame who have been found dead in mysterious circumstances. It would be impossible to ensure the safety of people the UK sends there.<\/p>\n<p>Refugees human rights may be violated. Freedom of expression is severely curtailed, with academics, journalists, bloggers and YouTubers among those imprisoned; the right to privacy is abused, with thousands of people believed to be spied on by the authorities; and Amnesty International has documented corruption which meant defendants were denied the right to free trials.<\/p>\n<p>British taxpayers will pay more. Surprisingly, the government has not costed the exercise – although the reluctance to release figures may be telling in itself. Australia’s notorious offshore scheme reportedly cost more than £5bn.<\/p>\n<p>It is essential that governments are made to explain themselves. A democratic government’s decisions must be transparent, and ministers must be accountable, so that we know what is being done in our name. If governments are not challenged, they may try to act illegally; this was amply demonstrated when the UK government was forced to withdraw its illegal pushbacks policy when we challenged them in court.<\/p>\n<p>Sending people to Rwanda is unlawful, as it would penalise asylum seekers on the grounds of their irregular entry, in direct contravention of the Refugee Convention.<\/p>\n<p>It cannot be allowed to happen, and the Government must be held to account for its decisions, which should be made with transparency and decency, not without the opportunity for public scrutiny.<\/p>\n<p>Please help us to hold them to account and to stop this reprehensible plan. We are raising funds for our own legal costs, and to protect us from paying the Home Office’s legal fees if we don’t win. Donate and share here: <a href=\"http:\/\/bit.ly\/c4c-rwanda\">bit.ly\/c4c-rwanda<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We’re going to court to #StopRwanda And we need your help. Yesterday morning we sent a legal letter to the Government challenging their reprehensible plan to send refugees to Rwanda. We are doing this with our friends from Detention Action, the PCS Union, whose members will be tasked to carry out the plan, and our fantastic lawyers, Duncan Lewis. The government’s plan is a threat to the lives of refugees, the international reputation of the United Kingdom and the finances of British people. From the suspiciously sparse detail presented so far, it is already clear the plan holds multiple risks. Innocent people will be needlessly and cruelly traumatised. Refugees who have already suffered extreme trauma will now be forced on 4000-mile journeys to an unfamiliar destination where they will be detained. This will cause immeasurable fear, anguish and distress. Refugees will not be safe. Rwanda is a dictatorship that imprisons, tortures and murders people who speak out against the government. Amnesty International and Human Rights Watch have identified multiple opponents of President Kagame who have been found dead in mysterious circumstances. It would be impossible to ensure the safety of people the UK sends there. Refugees human rights may be violated. Freedom of expression is severely curtailed, with academics, journalists, bloggers and YouTubers among those imprisoned; the right to privacy is abused, with thousands of people believed to be spied on by the authorities; and Amnesty International has documented corruption which meant defendants were denied the right to free trials. British taxpayers will pay more. Surprisingly, the government has not costed the exercise – although the reluctance to release figures may be telling in itself. Australia’s notorious offshore scheme reportedly cost more than £5bn. It is essential that governments are made to explain themselves. A democratic government’s decisions must be transparent, and ministers must be accountable, so that we know what is being done in our name. If governments are not challenged, they may try to act illegally; this was amply demonstrated when the UK government was forced to withdraw its illegal pushbacks policy when we challenged them in court. Sending people to Rwanda is unlawful, as it would penalise asylum seekers on the grounds of their irregular entry, in direct contravention of the Refugee Convention. It cannot be allowed to happen, and the Government must be held to account for its decisions, which should be made with transparency and decency, not without the opportunity for public scrutiny. Please help us to hold them to account and to stop this reprehensible plan. We are raising funds for our own legal costs, and to protect us from paying the Home Office’s legal fees if we don’t win. Donate and share here: bit.ly\/c4c-rwanda<\/p>\n","protected":false},"author":21,"featured_media":35619,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35618"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35618"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35618\/revisions"}],"predecessor-version":[{"id":38157,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35618\/revisions\/38157"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35619"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35618"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35618"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35618"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}