{"id":35679,"date":"2022-05-08T09:45:06","date_gmt":"2022-05-08T09:45:06","guid":{"rendered":"https:\/\/care4calais.org\/?p=35679"},"modified":"2022-10-18T11:28:09","modified_gmt":"2022-10-18T10:28:09","slug":"charlottes-heartfelt-plea","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/charlottes-heartfelt-plea\/","title":{"rendered":"Charlotte’s heartfelt plea"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>This week I sat holding the hand of a terrified young man.<\/p>\n<p>I’ve known him since he first arrived in the UK as an asylum seeker nearly two years ago. I’ve watched him gain confidence as his English improved and he made friends. And, although he’s been waiting in limbo for his application to progress, I’ve seen him slowly start to feel safe. He has learned to trust us, and is now a dedicated student at our weekly English class.<\/p>\n<p>This week, though, something was up. His usual keen laugh was replaced with a shrug. Those mischievous eyes looked dull.<\/p>\n<p>“You are not your usual self my friend,” I said.<\/p>\n<p>He sighed. He hadn’t been sleeping, was tired. I waited a minute before asking again what was really wrong.<\/p>\n<p>And that’s when Rwanda was mentioned.<\/p>\n<p>He’d read the headlines. He was so very worried, shocked that this plan was real, and heartbroken that his supposed safe place was once more unsafe. Trauma – that’s what I saw on his face, the reintroduction of trauma.<\/p>\n<p>I comforted him as best I could. Told him that good people wouldn’t let it happen. But even as I said it I barely believed my own words.<\/p>\n<p>Having volunteered with refugees for four years, I find it hard to believe how things seem to be getting worse. The fact we are seriously discussing the likelihood of the Home Office appearing one night at my friend’s hotel (and it will be at night, because that’s when when no one can see or help) to force traumatised, innocent men onto a plane to Rwanda – well, it’s almost unbelievable. But after years under this government I’ve also learned not to be shocked by the immoral depths they go to.<\/p>\n<p>I could say that Priti Patel and her ilk don’t realise how damaging even the suggestion of this plan is. I could say they don’t realise how terrifying these headlines are to refugees. But that wouldn’t be true.<\/p>\n<p>I’m sure that’s all actually part of the plan – the plan that means the government is seen to keep refugees in their place, downtrodden, desperate, true recipients of that great British value, the hostile environment.<\/p>\n<p>It is easy to feel disheartened. All refugees have done is to use their human right to seek asylum and refuge, and to ask to live here in safety. They are our friends. And yet our leaders use them to distract us from their own crimes, hoping that we lay the blame for rising living costs, a collapsing NHS, and lying politicians at the door of asylum seekers.<\/p>\n<p>It doesn’t even need to make economic sense anymore &#8211; it just has to distract.<\/p>\n<p>But I believe there is hope.<\/p>\n<p>I find it in the recent outpouring of compassion for refugees. I have smiled at the school-gate collections, the jingles in the supermarket telling me how much “we” have fundraised, and the flags emblazoned on everyone’s Facebook profile in support of Ukrainian refugees.<\/p>\n<p>If this public love is real, then surely we cannot suddenly be OK with shipping them off to Rwanda? It might be easy to despair, but don’t forget how much love the public has shown for refugees.<\/p>\n<p>There are also things we can do. Thankfully Care4Calais, with others, are challenging the government in court over the legality of these plans. So donating to their legal fund is a good start. You can do that here: bit.ly\/c4c-rwanda<\/p>\n<p>But also demand to speak to your MP, especially if they are Conservative. Make them realise they will lose their precious seats for this.<\/p>\n<p>We can’t know how things will play out, but we can’t just stand by and watch this.<\/p>\n<p>Ever wondered what you’d have done in 1930’s Germany? Well, now you know. It’s what you’re doing now.<\/p>\n<p>It’s what you do next.<\/p>\n<p>Charlotte, volunteer<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; This week I sat holding the hand of a terrified young man. I’ve known him since he first arrived in the UK as an asylum seeker nearly two years ago. I’ve watched him gain confidence as his English improved and he made friends. And, although he’s been waiting in limbo for his application to progress, I’ve seen him slowly start to feel safe. He has learned to trust us, and is now a dedicated student at our weekly English class. This week, though, something was up. His usual keen laugh was replaced with a shrug. Those mischievous eyes looked dull. “You are not your usual self my friend,” I said. He sighed. He hadn’t been sleeping, was tired. I waited a minute before asking again what was really wrong. And that’s when Rwanda was mentioned. He’d read the headlines. He was so very worried, shocked that this plan was real, and heartbroken that his supposed safe place was once more unsafe. Trauma – that’s what I saw on his face, the reintroduction of trauma. I comforted him as best I could. Told him that good people wouldn’t let it happen. But even as I said it I barely believed my own words. Having volunteered with refugees for four years, I find it hard to believe how things seem to be getting worse. The fact we are seriously discussing the likelihood of the Home Office appearing one night at my friend’s hotel (and it will be at night, because that’s when when no one can see or help) to force traumatised, innocent men onto a plane to Rwanda – well, it’s almost unbelievable. But after years under this government I’ve also learned not to be shocked by the immoral depths they go to. I could say that Priti Patel and her ilk don’t realise how damaging even the suggestion of this plan is. I could say they don’t realise how terrifying these headlines are to refugees. But that wouldn’t be true. I’m sure that’s all actually part of the plan – the plan that means the government is seen to keep refugees in their place, downtrodden, desperate, true recipients of that great British value, the hostile environment. It is easy to feel disheartened. All refugees have done is to use their human right to seek asylum and refuge, and to ask to live here in safety. They are our friends. And yet our leaders use them to distract us from their own crimes, hoping that we lay the blame for rising living costs, a collapsing NHS, and lying politicians at the door of asylum seekers. It doesn’t even need to make economic sense anymore &#8211; it just has to distract. But I believe there is hope. I find it in the recent outpouring of compassion for refugees. I have smiled at the school-gate collections, the jingles in the supermarket telling me how much “we” have fundraised, and the flags emblazoned on everyone’s Facebook profile in support of Ukrainian refugees. If this public love is real, then surely we cannot suddenly be OK with shipping them off to Rwanda? It might be easy to despair, but don’t forget how much love the public has shown for refugees. There are also things we can do. Thankfully Care4Calais, with others, are challenging the government in court over the legality of these plans. So donating to their legal fund is a good start. You can do that here: bit.ly\/c4c-rwanda But also demand to speak to your MP, especially if they are Conservative. Make them realise they will lose their precious seats for this. We can’t know how things will play out, but we can’t just stand by and watch this. Ever wondered what you’d have done in 1930’s Germany? Well, now you know. It’s what you’re doing now. It’s what you do next. Charlotte, volunteer<\/p>\n","protected":false},"author":21,"featured_media":35680,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35679"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35679"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35679\/revisions"}],"predecessor-version":[{"id":35681,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35679\/revisions\/35681"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35680"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35679"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35679"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35679"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}