{"id":35682,"date":"2022-05-07T09:49:20","date_gmt":"2022-05-07T09:49:20","guid":{"rendered":"https:\/\/care4calais.org\/?p=35682"},"modified":"2022-10-18T11:28:45","modified_gmt":"2022-10-18T10:28:45","slug":"soon-appearing-on-a-billboard-near-you","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/soon-appearing-on-a-billboard-near-you\/","title":{"rendered":"Soon appearing on a billboard near you !"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Amazing news! This photograph of refugees and Care4Calais volunteers has been chosen for a government ad campaign that shows what makes Britain Great – and will soon be prominently displayed at Heathrow Airport.<\/p>\n<p>The picture was taken by photographer Frederic Aranda, who works with a group based at an East London hotel. Frederic loves the way volunteers and refugees come together as a big family, and tried to get that across in his pictures. He certainly succeeded in this one, shot in London’s Smithfield market.<\/p>\n<p>“The image is a tribute to Care4Calais, an organisation that helps refugees whose immigration status is in limbo as a result of restrictive government policy,” says Monocle magazine in this story about the ad.<\/p>\n<p>“Launched in 2012, during the London Olympics and Queen Elizabeth’s Diamond Jubilee, the aim of the £125m (€150m) campaign is to increase tourism from a number of crucial markets, including India, China and Japan. However, the most salient effect of the ads – bearing pictures of Harry Potter and Buckingham Palace guardsmen with “GREAT” emblazoned across them – was to make Brits returning home from abroad cringe their way through passport control.<\/p>\n<p>“Perhaps mindful of its painful uncoolness, the campaign launched a competition alongside the Royal Photographic Society and Heathrow Airport for new images to be displayed at the UK’s largest airport.”<\/p>\n<p>Frederic’s picture was one of the winning entries. Most people shown were waiting on asylum applications when it was taken, and its use at Heathrow is wonderful statement that refugees are welcome here.<\/p>\n<p>At a time when the Home Secretary is shamefully trying to send them to Rwanda, its selection shows that at least some people in government understand the importance of welcoming refugees to the United Kingdom.<\/p>\n<p>Frederic, by the way, has donated his prize money to each of the refugees in the picture. As Monocle says – that’s truly great.<\/p>\n<p><a href=\"https:\/\/monocle.com\/minute\/2022\/04\/23\/pride-of-the-nation\/?c=Weekend\/\">https:\/\/monocle.com\/minute\/2022\/04\/23\/pride-of-the-nation\/?c=Weekend\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Amazing news! This photograph of refugees and Care4Calais volunteers has been chosen for a government ad campaign that shows what makes Britain Great – and will soon be prominently displayed at Heathrow Airport. The picture was taken by photographer Frederic Aranda, who works with a group based at an East London hotel. Frederic loves the way volunteers and refugees come together as a big family, and tried to get that across in his pictures. He certainly succeeded in this one, shot in London’s Smithfield market. “The image is a tribute to Care4Calais, an organisation that helps refugees whose immigration status is in limbo as a result of restrictive government policy,” says Monocle magazine in this story about the ad. “Launched in 2012, during the London Olympics and Queen Elizabeth’s Diamond Jubilee, the aim of the £125m (€150m) campaign is to increase tourism from a number of crucial markets, including India, China and Japan. However, the most salient effect of the ads – bearing pictures of Harry Potter and Buckingham Palace guardsmen with “GREAT” emblazoned across them – was to make Brits returning home from abroad cringe their way through passport control. “Perhaps mindful of its painful uncoolness, the campaign launched a competition alongside the Royal Photographic Society and Heathrow Airport for new images to be displayed at the UK’s largest airport.” Frederic’s picture was one of the winning entries. Most people shown were waiting on asylum applications when it was taken, and its use at Heathrow is wonderful statement that refugees are welcome here. At a time when the Home Secretary is shamefully trying to send them to Rwanda, its selection shows that at least some people in government understand the importance of welcoming refugees to the United Kingdom. Frederic, by the way, has donated his prize money to each of the refugees in the picture. As Monocle says – that’s truly great. https:\/\/monocle.com\/minute\/2022\/04\/23\/pride-of-the-nation\/?c=Weekend\/<\/p>\n","protected":false},"author":21,"featured_media":35686,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35682"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35682"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35682\/revisions"}],"predecessor-version":[{"id":38155,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35682\/revisions\/38155"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35686"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35682"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35682"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35682"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}