{"id":35894,"date":"2022-05-24T17:20:08","date_gmt":"2022-05-24T17:20:08","guid":{"rendered":"https:\/\/care4calais.org\/?p=35894"},"modified":"2023-02-08T16:47:38","modified_gmt":"2023-02-08T15:47:38","slug":"nadir-theyre-sending-me-to-rwanda","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/nadir-theyre-sending-me-to-rwanda\/","title":{"rendered":"Nadir: they’re sending me to Rwanda"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>As soon as I arrived in this detention centre, they handed me a letter. So I read it, and I was shocked by what I saw – well, beyond shocked, I don’t have a word for it, how I felt. Just numb, panicking and very scared.<\/p>\n<p>It said they wanted to send me back to Africa, to a country called Rwanda. I knew little about it, only that it is surrounded by war, and not safe for us. I had been through years of travelling, searching for somewhere to be safe, and I couldn’t believe this was happening. So I went to find someone in authority.<\/p>\n<p>They read the letter and saw my panic,. They told me now to worry. But the letter was real – they were trying to calm me down, and trying to stop me seeking help, I think.<\/p>\n<p>I’m Nadir, and I come from a small village in Sudan. We didn’t have much, and just got by doing what we could. Some days would be good, some bad – on a good day we would have electricity.<\/p>\n<p>My parents are from Darfur but they left before I was born because of the war there. I don’t know why we came to my village, because it is not a good place for black Sudanese. I wasn’t allowed to go to school because I was the wrong colour, so there was no hope of me getting a good job. But I wanted to learn so my parents found me some books and I had my phone and I studied at home.<\/p>\n<p>But then one day when I was young a gang came to my village. They said, get out of this place, you are not wanted here and do not come back, and they burnt the village down.<\/p>\n<p>After the fires died down we all got together and tried to protest. There were a few of us, we made noise, we said, “This is not right. We are human too, we have a right to live here”. The police came, but instead of protecting us they beat us up with their guns, and arrested everyone they could catch. I was beaten so badly I could hardly walk, and they killed my two friends, just hitting them them again and again and again until they died.<\/p>\n<p>Once we were all arrested, they took us to different places and we could not contact each other. I lost my wife. She was pregnant at the time. I didn’t find out until two years later that she lost our baby because of the beating.<\/p>\n<p>I managed to escape from where they were holding us, and headed towards the Nile where I hid. I borrowed a phone and called my uncle in Khartoum, and he helped me get out of Sudan.<\/p>\n<p>But Libya was horrific. When you get there they catch you and put you in prison, and demand a ransom from your family. I couldn’t pay, because I had no money and did not know where any of my family was. So I was put in prison, in a small room with maybe 35 people in it.<\/p>\n<p>Everyday they woke you up and beat you with their guns, and then pour boiling water on you. Sometimes they would use electric wires to burn you with as well. Then that was it for the day; we were just left in the heat. The only food we had was some dry bread and water every two days.<\/p>\n<p>After three months I got a skin infection. It was really bad, and they said I had to get help, so they sent me out of the prison to some other Sudanese people who said they could help me. I got some treatment, and when these people saw I was struggling they said, you can’t go back or you will die. After a while, they helped to get me to Malta.<\/p>\n<p>I thought Malta would be a good place, and that I would get help there. But there is no help, no asylum, no work, and no one wants you there. They put me in prison for eight months for being a refugee, and I got very sick again. They did not give me any help though, just sleeping pills.<\/p>\n<p>I thought there just must be somewhere better and I decided to try other countries so in 2022 I went to France to Calais. I was hearing you could get help in the UK, that maybe you would get asylum there and in Calais it was horrible. There were charities to help, but the smugglers fee was high, and I had no money. I tried the lorries, but it is so hard to get on a lorry, there is so much security. And so I made a dangerous plan with some friends I had made.<\/p>\n<p>We watched the beaches where the smugglers operated, and one night we got lucky. We watched the smugglers hide a small boat in the sand dunes and then leave, probably to wait for night or get their clients. As soon as they left we ran to the boat and put it in the water. We had no idea how to operate it and none of us could swim, but it was our only chance.<\/p>\n<p>We pushed it out into the waves, the water crashed into my face and body but we carried on, and somehow got the boat past the waves into deep water. Some others pulled us into the boat &#8211; there were 11 of us on board. Somehow we got the boat into British waters, only Allah knows how.<\/p>\n<p>If we’d gone back the smugglers may have caught us and shot us – they are really dangerous people the ones who run the boats.<\/p>\n<p>We were rescued and brought to the UK. I was kept in Dover for three days where they interviewed me and took my finger prints and photograph. Then we were taken somewhere else for four days and then to this detention centre I’m in now, I think it’s near London but I don’t really know. We are not allowed to leave, so it is a kind of jail. This is where I got the letter. After everything I had been through, I thought my life was over.<\/p>\n<p>But then I got a phone call, like a miracle. She said her name was Hannah, and she said don’t worry, we’ve got this, we will fight this for you and make you safe. She said she was with Care4Calais and had good lawyers already working for me. I felt hope begin again – just a small bit of hope but that is all we need to stay alive. I sent her all my documents and now I wait.<\/p>\n<p>In the years we travel all we have is hope – hope for a future, hope to see our families again, hope for safety, hope for acceptance and friendship. The day they gave me that letter they took away all my hope.<\/p>\n<p>Rwanda is not safe for me – the truth is that nowhere is safe for a black man in Africa. There is war all over, they killed my family in Sudan, they killed my friends, they tortured me in Libya. There is nowhere for me to go, if I go back there is no safety and no life.<\/p>\n<p>I want to tell my story because you cannot understand what it is like to be poor and black in Africa. If you are from the wrong tribe or the wrong place, nowhere is safe, money buys anything especially information. They killed my family and tortured me &#8211; how could I ever go back? I want to make people understand this. I just want people to understand that we just want to be safe.<\/p>\n<p>We are fighting to help Nadir and #StopRwanda. To help go to care4calais.org\/stop-rwanda\/<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; As soon as I arrived in this detention centre, they handed me a letter. So I read it, and I was shocked by what I saw – well, beyond shocked, I don’t have a word for it, how I felt. Just numb, panicking and very scared. It said they wanted to send me back to Africa, to a country called Rwanda. I knew little about it, only that it is surrounded by war, and not safe for us. I had been through years of travelling, searching for somewhere to be safe, and I couldn’t believe this was happening. So I went to find someone in authority. They read the letter and saw my panic,. They told me now to worry. But the letter was real – they were trying to calm me down, and trying to stop me seeking help, I think. I’m Nadir, and I come from a small village in Sudan. We didn’t have much, and just got by doing what we could. Some days would be good, some bad – on a good day we would have electricity. My parents are from Darfur but they left before I was born because of the war there. I don’t know why we came to my village, because it is not a good place for black Sudanese. I wasn’t allowed to go to school because I was the wrong colour, so there was no hope of me getting a good job. But I wanted to learn so my parents found me some books and I had my phone and I studied at home. But then one day when I was young a gang came to my village. They said, get out of this place, you are not wanted here and do not come back, and they burnt the village down. After the fires died down we all got together and tried to protest. There were a few of us, we made noise, we said, “This is not right. We are human too, we have a right to live here”. The police came, but instead of protecting us they beat us up with their guns, and arrested everyone they could catch. I was beaten so badly I could hardly walk, and they killed my two friends, just hitting them them again and again and again until they died. Once we were all arrested, they took us to different places and we could not contact each other. I lost my wife. She was pregnant at the time. I didn’t find out until two years later that she lost our baby because of the beating. I managed to escape from where they were holding us, and headed towards the Nile where I hid. I borrowed a phone and called my uncle in Khartoum, and he helped me get out of Sudan. But Libya was horrific. When you get there they catch you and put you in prison, and demand a ransom from your family. I couldn’t pay, because I had no money and did not know where any of my family was. So I was put in prison, in a small room with maybe 35 people in it. Everyday they woke you up and beat you with their guns, and then pour boiling water on you. Sometimes they would use electric wires to burn you with as well. Then that was it for the day; we were just left in the heat. The only food we had was some dry bread and water every two days. After three months I got a skin infection. It was really bad, and they said I had to get help, so they sent me out of the prison to some other Sudanese people who said they could help me. I got some treatment, and when these people saw I was struggling they said, you can’t go back or you will die. After a while, they helped to get me to Malta. I thought Malta would be a good place, and that I would get help there. But there is no help, no asylum, no work, and no one wants you there. They put me in prison for eight months for being a refugee, and I got very sick again. They did not give me any help though, just sleeping pills. I thought there just must be somewhere better and I decided to try other countries so in 2022 I went to France to Calais. I was hearing you could get help in the UK, that maybe you would get asylum there and in Calais it was horrible. There were charities to help, but the smugglers fee was high, and I had no money. I tried the lorries, but it is so hard to get on a lorry, there is so much security. And so I made a dangerous plan with some friends I had made. We watched the beaches where the smugglers operated, and one night we got lucky. We watched the smugglers hide a small boat in the sand dunes and then leave, probably to wait for night or get their clients. As soon as they left we ran to the boat and put it in the water. We had no idea how to operate it and none of us could swim, but it was our only chance. We pushed it out into the waves, the water crashed into my face and body but we carried on, and somehow got the boat past the waves into deep water. Some others pulled us into the boat &#8211; there were 11 of us on board. Somehow we got the boat into British waters, only Allah knows how. If we’d gone back the smugglers may have caught us and shot us – they are really dangerous people the ones who run the boats. We were rescued and brought to the UK. I was kept in Dover for three days where they interviewed me and took my finger prints and photograph. Then we were taken somewhere else for [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":35895,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35894"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35894"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35894\/revisions"}],"predecessor-version":[{"id":35896,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35894\/revisions\/35896"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35895"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35894"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35894"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35894"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}