{"id":35918,"date":"2022-05-26T17:24:37","date_gmt":"2022-05-26T17:24:37","guid":{"rendered":"https:\/\/care4calais.org\/?p=35918"},"modified":"2022-05-26T17:24:37","modified_gmt":"2022-05-26T17:24:37","slug":"salihs-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/salihs-story\/","title":{"rendered":"Salih’s story"},"content":{"rendered":"<p>Salih Mansur Ali had a happy, comfortable life living with his family in the Kurdistan region of Iraq, but one day when he was just 17, his dad was shot dead by by an Islamist terrorist group.<\/p>\n<p>Salih saw him lying on the ground, covered in blood; he still has the horrific photo on his phone. It was a shocking moment, one that would lead to years of running and suffering.<\/p>\n<p>His dad had been chief of police in their city, and the family knew they were now at risk of further attacks. His mum moved with her four children to another city in Kurdistan, but she fell ill.<\/p>\n<p>“They were very much in love,” Salih remembers. “After my father died, my mother entered a great depression.&#8221; Within a year of her husband’s death, she was dead too. The children went to live an uncle, but the uncle knew that without his parents Salih, as the eldest son of the family, was very vulnerable.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Thr fact that his father had been murdered closed many doors to his son. &#8220;My father had been a known man. The fact that they had killed him made it impossible for me to get a job. Not only that, but my life was in<span class=\"Apple-converted-space\">  <\/span>danger too.” To make matters worse, their city was strategically important to several different powerful countries, and in recent years there had been bombings there. His uncle knew that Salih could not be safe amid terrorism and armed struggle, and decided<span class=\"Apple-converted-space\">  <\/span>to spend his savings to get his nephew to safety.<\/p>\n<p>And so In September 2018, when Salih was just 20 years old, he left his family and set off for Turkey. Crossing the border near his city, he went to Istanbul where he spent four months trying to get to Greece, where he would be able to ask for asylum.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Twice he went to Izmir to try to get a boat to Lesbos, but the Turkish police caught them.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Eleven times he tried to cross the Evros<span class=\"Apple-converted-space\">  <\/span>river, in a forest on the border. Many people have died trying to cross this way; many more have been beaten by the police. Salih was beaten, and beaten hard.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“Why are you attacking me?” He wanted to ask. “Just because I want a better life? My father was a policeman, a very good one. II haven’t done anything bad. I want to help people, not hurt them.”<\/p>\n<p>Those beatings made him reluctant to ask for asylum in Greece when he finally made it there, and he went to Igoumenitsa with the aim of boarding a ferry to Italy so he could ask for asylum there. He slept for months in a forest, where some 200 other people also lived. But when the ferry proved impossible, he decided to make the journey on foot, and crossed Macedonia and then reached<span class=\"Apple-converted-space\">  <\/span>Serbia.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>In Serbia he went to Šid, where he lived in an abandoned building next to the train station. He could have gone to a refugee camp, but “it’s like a dictatorship inside them. They do not give clothes and we have to queue for everything,<span class=\"Apple-converted-space\">  <\/span>and they have too many rules limiting your freedom.”<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>After seven months in Šid he managed to cross from Subotica, a border city, east into Hungary in February 2020. But not without a scare before he escaped: a group of Afghans attacked him in Subotica and tried to kill him.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Arriving in Hungary, a member of the EU, he thought he would be safe. He went to a refugee camp in Tompa to ask for help and protection. To his shock and disappointment, they held him there; under a system introduced in 2015, the Hungarian government had been operating refugee camps that were effectively outdoor prisons. People applying for asylum could be held there indefinitely while their applications were processed. So two years after leaving home to seek safety, Salih found himself locked up in a field, with no way of knowing when he might be allowed to leave again.<\/p>\n<p>Then in May 2020 Salih at last had a bit of good luck &#8211; although “justice” might be a better word. The European Union Court of Justice ruled that the Hungarian camps were a deprivation of freedom, and they were closed.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Now free, Salih got to Austria by train, and from there he went to Berlin,<span class=\"Apple-converted-space\">  <\/span>where he lives at the moment, and where he would like to stay.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>&#8220;I feel exhausted. My body hurts, my heart hurts. I often cry,” he says, looking back on his journey, and on the European border policies that seem made to torture people who escape wars and conflict. “I just need a little help. I do not want to go back Hungary. I can’t go back there. All I want is a kind and calm life.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Salih Mansur Ali had a happy, comfortable life living with his family in the Kurdistan region of Iraq, but one day when he was just 17, his dad was shot dead by by an Islamist terrorist group. Salih saw him lying on the ground, covered in blood; he still has the horrific photo on his phone. It was a shocking moment, one that would lead to years of running and suffering. His dad had been chief of police in their city, and the family knew they were now at risk of further attacks. His mum moved with her four children to another city in Kurdistan, but she fell ill. “They were very much in love,” Salih remembers. “After my father died, my mother entered a great depression.&#8221; Within a year of her husband’s death, she was dead too. The children went to live an uncle, but the uncle knew that without his parents Salih, as the eldest son of the family, was very vulnerable.  Thr fact that his father had been murdered closed many doors to his son. &#8220;My father had been a known man. The fact that they had killed him made it impossible for me to get a job. Not only that, but my life was in  danger too.” To make matters worse, their city was strategically important to several different powerful countries, and in recent years there had been bombings there. His uncle knew that Salih could not be safe amid terrorism and armed struggle, and decided  to spend his savings to get his nephew to safety. And so In September 2018, when Salih was just 20 years old, he left his family and set off for Turkey. Crossing the border near his city, he went to Istanbul where he spent four months trying to get to Greece, where he would be able to ask for asylum.  Twice he went to Izmir to try to get a boat to Lesbos, but the Turkish police caught them.  Eleven times he tried to cross the Evros  river, in a forest on the border. Many people have died trying to cross this way; many more have been beaten by the police. Salih was beaten, and beaten hard.  “Why are you attacking me?” He wanted to ask. “Just because I want a better life? My father was a policeman, a very good one. II haven’t done anything bad. I want to help people, not hurt them.” Those beatings made him reluctant to ask for asylum in Greece when he finally made it there, and he went to Igoumenitsa with the aim of boarding a ferry to Italy so he could ask for asylum there. He slept for months in a forest, where some 200 other people also lived. But when the ferry proved impossible, he decided to make the journey on foot, and crossed Macedonia and then reached  Serbia.  In Serbia he went to Šid, where he lived in an abandoned building next to the train station. He could have gone to a refugee camp, but “it’s like a dictatorship inside them. They do not give clothes and we have to queue for everything,  and they have too many rules limiting your freedom.”  After seven months in Šid he managed to cross from Subotica, a border city, east into Hungary in February 2020. But not without a scare before he escaped: a group of Afghans attacked him in Subotica and tried to kill him.  Arriving in Hungary, a member of the EU, he thought he would be safe. He went to a refugee camp in Tompa to ask for help and protection. To his shock and disappointment, they held him there; under a system introduced in 2015, the Hungarian government had been operating refugee camps that were effectively outdoor prisons. People applying for asylum could be held there indefinitely while their applications were processed. So two years after leaving home to seek safety, Salih found himself locked up in a field, with no way of knowing when he might be allowed to leave again. Then in May 2020 Salih at last had a bit of good luck &#8211; although “justice” might be a better word. The European Union Court of Justice ruled that the Hungarian camps were a deprivation of freedom, and they were closed.  Now free, Salih got to Austria by train, and from there he went to Berlin,  where he lives at the moment, and where he would like to stay.  &#8220;I feel exhausted. My body hurts, my heart hurts. I often cry,” he says, looking back on his journey, and on the European border policies that seem made to torture people who escape wars and conflict. “I just need a little help. I do not want to go back Hungary. I can’t go back there. All I want is a kind and calm life.”<\/p>\n","protected":false},"author":21,"featured_media":35916,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35918"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35918"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35918\/revisions"}],"predecessor-version":[{"id":35919,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35918\/revisions\/35919"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35916"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35918"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35918"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35918"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}