{"id":35959,"date":"2022-05-31T17:10:11","date_gmt":"2022-05-31T17:10:11","guid":{"rendered":"https:\/\/care4calais.org\/?p=35959"},"modified":"2022-05-31T17:10:11","modified_gmt":"2022-05-31T17:10:11","slug":"meet-sayed-violin-virtuoso","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/meet-sayed-violin-virtuoso\/","title":{"rendered":"Meet Sayed, violin virtuoso"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Then post on site with these words<\/p>\n<p>sayed and the violin for tonight<\/p>\n<p>When I arrive in the UK it was during the pandemic, and I was sent to Napier Barracks. It was really not a nice place – there were 400 people there and half got Covid. We slept in rooms with 20 people in them, with only a few blankets between us. It was frightening to be there.<\/p>\n<p>The one good thing about Napier was that I was introduced to Care4 Calais, and especially a volunteer called Lily. They really helped us with all sorts of things. Mainly that was shoes and clothes, but sometimes there were other things too. And after a while, I plucked up the courage to make a special request – a violin!<\/p>\n<p>My name is I’m Seyed, I’m a 29-year old Iranian Kurd from the Kurdish region Kermanshah of Iran.<\/p>\n<p>My people are persecuted in so many lands it is hard to find a safe place to live. My political and religious beliefs differed from those of the government, and it became very difficult for me to stay. I have a big family, I have three sisters but I am the only son. They were able to help me escape, and we found someone who could get me to safety. I didn’t know where I was going, that was left up to the smuggler – we just paid for the safest place possible.<\/p>\n<p>It took a month for me to get to the UK, but I was very happy to be here. However, I missed my family and the times we spent together making music and dancing.<\/p>\n<p>I should explain that music is so important in my culture, it’s how we express ourselves, socialize and have fun. My brother in law was an expert violin player, he’d got me interested a few years ago and while I am not at his level I was pretty good. I didn’t play the violin at home I played an instrument called the Taar, which is common in Afghanistan, Iran and Iraq.<\/p>\n<p>Playing the violin has always been a huge part of my life, and I really missed playing while I was waiting for asylum in the UK.<\/p>\n<p>I really missed playing music, it always made me happy. And that’s why, after some time, I asked to Lily if she could find me a violin. She said of course she would try but violins were quite rare and often expensive. Over the months I asked her again a few times and she always said she was still looking. Meanwhile I listened to music on my phone, but it wasn’t quite the same as playing.<\/p>\n<p>Lily posted on social media, and asked friends and other volunteers but no luck.<\/p>\n<p>But then in March she heard about a music exhibition in Liverpool from a post on one of the Care4Calais chat groups, and she told them she had a refugee who was very keen on music, and would like a violin. It was amazing, Melodie, another volunteer saw the message and quickly messaged back “I may have one”<\/p>\n<p>I got in touch and she said, “I used to play violin and last year I bought one as I wanted to start playing again after a long break but it’s just sat in the house gathering dust. So I feel it is meant for Seyed to have”.<\/p>\n<p>Now, by this time I had been moved to Manchester, but I kept in touch with Lilly.<\/p>\n<p>And then to my surprise I got a message from Lily- she said she had found me a violin! I was so happy. The violin didn’t quite play as it was missing some parts but I video-called my brother in law and we managed to fix it so I could play.<\/p>\n<p>To be able to play the violin makes me feel so happy. I know how hard it was to find and I really appreciate Lily doing this for me when she had so many other people to help; I will never ever forget Lily and the kindness she showed me.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Then post on site with these words sayed and the violin for tonight When I arrive in the UK it was during the pandemic, and I was sent to Napier Barracks. It was really not a nice place – there were 400 people there and half got Covid. We slept in rooms with 20 people in them, with only a few blankets between us. It was frightening to be there. The one good thing about Napier was that I was introduced to Care4 Calais, and especially a volunteer called Lily. They really helped us with all sorts of things. Mainly that was shoes and clothes, but sometimes there were other things too. And after a while, I plucked up the courage to make a special request – a violin! My name is I’m Seyed, I’m a 29-year old Iranian Kurd from the Kurdish region Kermanshah of Iran. My people are persecuted in so many lands it is hard to find a safe place to live. My political and religious beliefs differed from those of the government, and it became very difficult for me to stay. I have a big family, I have three sisters but I am the only son. They were able to help me escape, and we found someone who could get me to safety. I didn’t know where I was going, that was left up to the smuggler – we just paid for the safest place possible. It took a month for me to get to the UK, but I was very happy to be here. However, I missed my family and the times we spent together making music and dancing. I should explain that music is so important in my culture, it’s how we express ourselves, socialize and have fun. My brother in law was an expert violin player, he’d got me interested a few years ago and while I am not at his level I was pretty good. I didn’t play the violin at home I played an instrument called the Taar, which is common in Afghanistan, Iran and Iraq. Playing the violin has always been a huge part of my life, and I really missed playing while I was waiting for asylum in the UK. I really missed playing music, it always made me happy. And that’s why, after some time, I asked to Lily if she could find me a violin. She said of course she would try but violins were quite rare and often expensive. Over the months I asked her again a few times and she always said she was still looking. Meanwhile I listened to music on my phone, but it wasn’t quite the same as playing. Lily posted on social media, and asked friends and other volunteers but no luck. But then in March she heard about a music exhibition in Liverpool from a post on one of the Care4Calais chat groups, and she told them she had a refugee who was very keen on music, and would like a violin. It was amazing, Melodie, another volunteer saw the message and quickly messaged back “I may have one” I got in touch and she said, “I used to play violin and last year I bought one as I wanted to start playing again after a long break but it’s just sat in the house gathering dust. So I feel it is meant for Seyed to have”. Now, by this time I had been moved to Manchester, but I kept in touch with Lilly. And then to my surprise I got a message from Lily- she said she had found me a violin! I was so happy. The violin didn’t quite play as it was missing some parts but I video-called my brother in law and we managed to fix it so I could play. To be able to play the violin makes me feel so happy. I know how hard it was to find and I really appreciate Lily doing this for me when she had so many other people to help; I will never ever forget Lily and the kindness she showed me.<\/p>\n","protected":false},"author":21,"featured_media":35960,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35959"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=35959"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35959\/revisions"}],"predecessor-version":[{"id":35961,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/35959\/revisions\/35961"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/35960"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=35959"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=35959"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=35959"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}