{"id":36025,"date":"2022-06-06T07:01:37","date_gmt":"2022-06-06T07:01:37","guid":{"rendered":"https:\/\/care4calais.org\/?p=36025"},"modified":"2022-10-18T11:14:02","modified_gmt":"2022-10-18T10:14:02","slug":"rwanda-deportees-are-increasing-desperate","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/rwanda-deportees-are-increasing-desperate\/","title":{"rendered":"Rwanda deportees are increasingly desperate"},"content":{"rendered":"<p>Rwanda update 6 June 2022<\/p>\n<p>We are now working with 80 out of the 100 people that the Government have sent ‘Notices of Intent‘ saying that they will be sent to Rwanda. 17 have received notices to say their deportation is imminent, ten of which mention 14 June. They are all in detention centres and they are all very scared.<\/p>\n<p>Priti Patel says the Rwanda plan will offer migrants “an opportunity to build prosperous lives in safety”. However every single one of the people we have spoken to is shocked and traumatised at the thought of being forcibly sent. We’ve had a five day hunger strike and numerous late night conversations with people who feel suicidal. One said “They can send my dead body to Rwanda, but I would rather die than go there”.<\/p>\n<p>The Home Office say they are only sending single men to Rwanda, but the reality is that they are sending men who are not accompanied by their wives, children or other dependent relatives at this point in time.<\/p>\n<p>The reason that many embark on these incredibly dangerous journeys is that they see it as the only way to find a safe future for their families. I spoke to a man from Sudan who left his wife and unborn child in a refugee camp where they could be trapped for many years if he did not find an alternate future for them. His journey took two years and has left horrific scars, but now he is terrified he has let them down. If he gets sent to Rwanda he may never meet the child that was born after he left.<\/p>\n<p>Another man will be forced to leave his 16 year old brother behind in the UK, and another, the wife that he came here to join and has not seen for three years. Many are fearful of the effect that being sent to Rwanda will have on their families back home.<\/p>\n<p>We have not yet been told how people are selected to go to Rwanda but around a third of those we are talking to in detention are from Sudan. The next biggest group is from Syria. In our experience this is not representative of those who generally cross the Channel.<\/p>\n<p>By contrast, we only have three Afghan refugees in our sample with a Rwanda notice – yet we are told that Afghans make up 25% of those crossing in small boats.<\/p>\n<p>Two of the boys say that they are just 16 years old. The Home Office say they are 23 and 26 so it is essential that proper age assessments are done before any deportation takes place. One 16 year old saw his brother killed in front of him when his village was raided in Sudan. He escaped and went back later to find the whole village gone.<\/p>\n<p>We estimate that over 70% of those with Rwanda notices have suffered torture or trafficking either in their home countries or on the incredibly dangerous journeys they have made. As a result, many have serious physical and mental scars and are finding the intense stress of detention, coupled with the threat of being sent Rwanda, intolerable.<\/p>\n<p>One man who endured extreme torture in Libya told me that every time the door to his room bangs shut it gives him flashbacks to being tortured in Libya. This makes him feel like he is going insane.<\/p>\n<p>Every single one of these people has a devastating account of the horrors they have escaped from in their home countries. Be it war, torture or persecution, they are all difficult to hear. The fact that our Government is putting them through the intense trauma of a deportation to another dangerous future is simply barbaric.<\/p>\n<p>I spoke to another man who was tortured In Libya. They broke his nose and his shoulder twice; he has scars on his back and stomach from being electrocuted. He said “Things like that can happen in Libya, there is no government and it is lawless. But I never expected to be put in prison in the UK for committing no crime.”<\/p>\n<p>He said that when he was being tortured the one thing that kept him going was hope in the UK as being a place where fairness and equality exists. Now, being told that the UK will forcibly deport him to a country that has been condemned for human rights violations smashes that hope to pieces.<\/p>\n<p>That people believe that the UK is a good place that will treat them fairly is something we should be proud of; that throughout the world the UK is a beacon of all that is good is an amazing reputation that we could now lose.<\/p>\n<p>The ‘logic’ to the Rwanda plan is that we take people who, by definition, have escaped from the very worst things in this world, who are so desperate they are willing to get in frightening and flimsy boats to cross the Channel, and present them with something that fills them with even more terror in order to deter them from coming. Is this really what we as a civilised nation want to do?<\/p>\n<p>There is a more humane and civilised solution right in front of us now. If we gave all refugees visas to cross the Channel, in the same way we do with Ukrainians, no one would need to risk their lives in small boats, and people smugglers would be put out of business overnight. This must be possible – we are taking seven year’s worth of Channel refugees in our 200,000 Ukrainians this year.<\/p>\n<p>Over the four day bank holiday weekend the Care4Calais access team and our fabulous refugee volunteers have worked right through to stay in touch with everyone, sort out paperwork, keep people up to date and reassure them. We cannot thank them enough for their efforts. The work of this team is essential; more than ever given the Nationality and Borders Act. We are raising funds for a new caseworker and need all the help we can get. Please donate now &#8211; no amount is too small to help bit.ly\/c4caccess<\/p>\n<p>And for more ways to #StopRwanda go to <a href=\"http:\/\/care4calais.org\/stop-rwanda\/\">care4calais.org\/stop-rwanda\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rwanda update 6 June 2022 We are now working with 80 out of the 100 people that the Government have sent ‘Notices of Intent‘ saying that they will be sent to Rwanda. 17 have received notices to say their deportation is imminent, ten of which mention 14 June. They are all in detention centres and they are all very scared. Priti Patel says the Rwanda plan will offer migrants “an opportunity to build prosperous lives in safety”. However every single one of the people we have spoken to is shocked and traumatised at the thought of being forcibly sent. We’ve had a five day hunger strike and numerous late night conversations with people who feel suicidal. One said “They can send my dead body to Rwanda, but I would rather die than go there”. The Home Office say they are only sending single men to Rwanda, but the reality is that they are sending men who are not accompanied by their wives, children or other dependent relatives at this point in time. The reason that many embark on these incredibly dangerous journeys is that they see it as the only way to find a safe future for their families. I spoke to a man from Sudan who left his wife and unborn child in a refugee camp where they could be trapped for many years if he did not find an alternate future for them. His journey took two years and has left horrific scars, but now he is terrified he has let them down. If he gets sent to Rwanda he may never meet the child that was born after he left. Another man will be forced to leave his 16 year old brother behind in the UK, and another, the wife that he came here to join and has not seen for three years. Many are fearful of the effect that being sent to Rwanda will have on their families back home. We have not yet been told how people are selected to go to Rwanda but around a third of those we are talking to in detention are from Sudan. The next biggest group is from Syria. In our experience this is not representative of those who generally cross the Channel. By contrast, we only have three Afghan refugees in our sample with a Rwanda notice – yet we are told that Afghans make up 25% of those crossing in small boats. Two of the boys say that they are just 16 years old. The Home Office say they are 23 and 26 so it is essential that proper age assessments are done before any deportation takes place. One 16 year old saw his brother killed in front of him when his village was raided in Sudan. He escaped and went back later to find the whole village gone. We estimate that over 70% of those with Rwanda notices have suffered torture or trafficking either in their home countries or on the incredibly dangerous journeys they have made. As a result, many have serious physical and mental scars and are finding the intense stress of detention, coupled with the threat of being sent Rwanda, intolerable. One man who endured extreme torture in Libya told me that every time the door to his room bangs shut it gives him flashbacks to being tortured in Libya. This makes him feel like he is going insane. Every single one of these people has a devastating account of the horrors they have escaped from in their home countries. Be it war, torture or persecution, they are all difficult to hear. The fact that our Government is putting them through the intense trauma of a deportation to another dangerous future is simply barbaric. I spoke to another man who was tortured In Libya. They broke his nose and his shoulder twice; he has scars on his back and stomach from being electrocuted. He said “Things like that can happen in Libya, there is no government and it is lawless. But I never expected to be put in prison in the UK for committing no crime.” He said that when he was being tortured the one thing that kept him going was hope in the UK as being a place where fairness and equality exists. Now, being told that the UK will forcibly deport him to a country that has been condemned for human rights violations smashes that hope to pieces. That people believe that the UK is a good place that will treat them fairly is something we should be proud of; that throughout the world the UK is a beacon of all that is good is an amazing reputation that we could now lose. The ‘logic’ to the Rwanda plan is that we take people who, by definition, have escaped from the very worst things in this world, who are so desperate they are willing to get in frightening and flimsy boats to cross the Channel, and present them with something that fills them with even more terror in order to deter them from coming. Is this really what we as a civilised nation want to do? There is a more humane and civilised solution right in front of us now. If we gave all refugees visas to cross the Channel, in the same way we do with Ukrainians, no one would need to risk their lives in small boats, and people smugglers would be put out of business overnight. This must be possible – we are taking seven year’s worth of Channel refugees in our 200,000 Ukrainians this year. Over the four day bank holiday weekend the Care4Calais access team and our fabulous refugee volunteers have worked right through to stay in touch with everyone, sort out paperwork, keep people up to date and reassure them. We cannot thank them enough for their efforts. The work of this team is essential; more than ever given the Nationality and Borders Act. We are raising funds for a new caseworker and [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":36026,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36025"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36025"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36025\/revisions"}],"predecessor-version":[{"id":38146,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36025\/revisions\/38146"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36026"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36025"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36025"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36025"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}