{"id":36043,"date":"2022-06-08T11:54:56","date_gmt":"2022-06-08T11:54:56","guid":{"rendered":"https:\/\/care4calais.org\/?p=36043"},"modified":"2022-10-18T11:13:08","modified_gmt":"2022-10-18T10:13:08","slug":"how-were-challenging-the-rwanda-scheme","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/how-were-challenging-the-rwanda-scheme\/","title":{"rendered":"How we&#8217;re challenging the Rwanda scheme"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>We have spoken to over 100 people in detention who’ve been told they will be forcibly sent to Rwanda. Almost all are overwhelmed by total shock and despair.<\/p>\n<p>Many came to the UK believing it to be a good place that would treat them more fairly than the places from which they escaped.<\/p>\n<p>We say that the Rwanda plan is unlawful.<\/p>\n<p>We hope the courts will agree with us.<\/p>\n<p>Together with the Public and Commercial Services Union (PCS), Detention Action, and four asylum seekers facing removal by plane to Rwanda on Tuesday 14 June, we have now issued judicial review proceedings in the High Court, challenging the Home Secretary’s plan to remove asylum-seekers to Rwanda. We are represented by Duncan Lewis Solicitors.<\/p>\n<p>We argue that the Rwanda removals policy, as well as the removals of the four individual asylum seekers specifically, are unlawful on multiple bases.<\/p>\n<p>These bases include, but are not limited to:<\/p>\n<p>• the \/vires\/or legal authority of the Home Secretary to carry out the removals<br \/>\n• the rationality of the Secretary of State’s conclusion that Rwanda is generally a “safe third country”<br \/>\n• the adequacy of provision for malaria prevention<br \/>\n• and compliance with the Human Rights Act.<\/p>\n<p>The claim has been issued as a matter of urgency, following the Home Secretary’s scheduling of the first removal flight to Rwanda on the 14th of June, and her refusal to give assurances that no removals to Rwanda would take place until the lawfulness of the Rwandan removals policy has been tested in court.<\/p>\n<p>We also seek an injunction in respect of the flight scheduled for 14th June.<\/p>\n<p>We urgently need to stop this brutal policy that will harm many innocent people. To find out how you can help, go to care4calais.org\/stop-rwanda\/<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We have spoken to over 100 people in detention who’ve been told they will be forcibly sent to Rwanda. Almost all are overwhelmed by total shock and despair. Many came to the UK believing it to be a good place that would treat them more fairly than the places from which they escaped. We say that the Rwanda plan is unlawful. We hope the courts will agree with us. Together with the Public and Commercial Services Union (PCS), Detention Action, and four asylum seekers facing removal by plane to Rwanda on Tuesday 14 June, we have now issued judicial review proceedings in the High Court, challenging the Home Secretary’s plan to remove asylum-seekers to Rwanda. We are represented by Duncan Lewis Solicitors. We argue that the Rwanda removals policy, as well as the removals of the four individual asylum seekers specifically, are unlawful on multiple bases. These bases include, but are not limited to: • the \/vires\/or legal authority of the Home Secretary to carry out the removals • the rationality of the Secretary of State’s conclusion that Rwanda is generally a “safe third country” • the adequacy of provision for malaria prevention • and compliance with the Human Rights Act. The claim has been issued as a matter of urgency, following the Home Secretary’s scheduling of the first removal flight to Rwanda on the 14th of June, and her refusal to give assurances that no removals to Rwanda would take place until the lawfulness of the Rwandan removals policy has been tested in court. We also seek an injunction in respect of the flight scheduled for 14th June. We urgently need to stop this brutal policy that will harm many innocent people. To find out how you can help, go to care4calais.org\/stop-rwanda\/<\/p>\n","protected":false},"author":21,"featured_media":36044,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,184,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36043"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36043"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36043\/revisions"}],"predecessor-version":[{"id":36045,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36043\/revisions\/36045"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36044"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36043"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36043"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36043"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}