{"id":36069,"date":"2022-06-09T15:45:12","date_gmt":"2022-06-09T15:45:12","guid":{"rendered":"https:\/\/care4calais.org\/?p=36069"},"modified":"2023-02-08T16:46:32","modified_gmt":"2023-02-08T15:46:32","slug":"most-rwandas-deportees-are-not-single","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/most-rwandas-deportees-are-not-single\/","title":{"rendered":"Most Rwandas deportees are NOT &#8220;single&#8221;"},"content":{"rendered":"<p>Tomorrow morning we will be in the High Court to stop the Government carrying out its barbaric Rwanda scheme.<\/p>\n<p>The Government says it’s sending only single men to Rwanda.<\/p>\n<p>This isn’t not true.<\/p>\n<p>We’re working with 100 people in detention with Rwanda notices, all men. Fifty five are married. And 17 have small children.<\/p>\n<p>So the majority aren’t single at all. They’re just separated from their families.<\/p>\n<p>Adam is typical. He had to leave his home, wife and children in Sudan when he fled because of the political situation. He just “wanted to arrive in the safest place”, but was tortured in Libya, and subjected to racism as he travelling in the back of a lorry in Italy.<\/p>\n<p>Then when he finally made it it to the UK, he was told he would be deported to Rwanda.<\/p>\n<p>He came to the UK because he believed “no other country would be safer,” so felt “shocked” to receive the letter about Rwanda.<\/p>\n<p>“All my hopes were gone. I can’t sleep. I feel in shock and desperate. I am very stressed and exhausted.”<\/p>\n<p>“I worry about my family,” he says.<\/p>\n<p>&#8220;I miss my children and hoped to bring them to safety. I have suffered for many years. I want a safe life for my children.<\/p>\n<p>“|I haven’t been able to contact my family since I got to the UK, I don’t know what situation they are in or if they are safe. They don’t know about my situation. But how could I tell them I am being sent to Rwanda? It would end their dreams.”<\/p>\n<p>People like Adam show the truth about refugees.<\/p>\n<p>In many countries such as Sudan, young men may be killed to stop them rebelling against the government, or forced into military service. That’s why many run away from their homes and their families.<\/p>\n<p>The journeys to Calais are incredibly dangerous, and few women and children would survive their horrors. Many families will not risk their daughters safety on a journey to Europe. The hope is the men who escape will then help them to safety.<\/p>\n<p>So the young men we see arriving, the young men now threatened with deportation to Rwanda, are doing their best to protect their families.<\/p>\n<p>How often does a father say they’d die for their daughter, a husband say they’d die for their wife? Well these guys are putting it into practice.<\/p>\n<p>Let us just hope that our sons, husbands, partners, nephews and brothers never have to have their love tested like this.<\/p>\n<p>The things we hear most commonly from those threatened with Rwanda, is deep shock and despair that the UK would treat them like this. They see the UK as a good place that will treat them fairly, and being told that the UK will deport them to Rwanda smashes that hope to pieces. They are also scared for their families. Wouldn’t you be in their place?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tomorrow morning we will be in the High Court to stop the Government carrying out its barbaric Rwanda scheme. The Government says it’s sending only single men to Rwanda. This isn’t not true. We’re working with 100 people in detention with Rwanda notices, all men. Fifty five are married. And 17 have small children. So the majority aren’t single at all. They’re just separated from their families. Adam is typical. He had to leave his home, wife and children in Sudan when he fled because of the political situation. He just “wanted to arrive in the safest place”, but was tortured in Libya, and subjected to racism as he travelling in the back of a lorry in Italy. Then when he finally made it it to the UK, he was told he would be deported to Rwanda. He came to the UK because he believed “no other country would be safer,” so felt “shocked” to receive the letter about Rwanda. “All my hopes were gone. I can’t sleep. I feel in shock and desperate. I am very stressed and exhausted.” “I worry about my family,” he says. &#8220;I miss my children and hoped to bring them to safety. I have suffered for many years. I want a safe life for my children. “|I haven’t been able to contact my family since I got to the UK, I don’t know what situation they are in or if they are safe. They don’t know about my situation. But how could I tell them I am being sent to Rwanda? It would end their dreams.” People like Adam show the truth about refugees. In many countries such as Sudan, young men may be killed to stop them rebelling against the government, or forced into military service. That’s why many run away from their homes and their families. The journeys to Calais are incredibly dangerous, and few women and children would survive their horrors. Many families will not risk their daughters safety on a journey to Europe. The hope is the men who escape will then help them to safety. So the young men we see arriving, the young men now threatened with deportation to Rwanda, are doing their best to protect their families. How often does a father say they’d die for their daughter, a husband say they’d die for their wife? Well these guys are putting it into practice. Let us just hope that our sons, husbands, partners, nephews and brothers never have to have their love tested like this. The things we hear most commonly from those threatened with Rwanda, is deep shock and despair that the UK would treat them like this. They see the UK as a good place that will treat them fairly, and being told that the UK will deport them to Rwanda smashes that hope to pieces. They are also scared for their families. Wouldn’t you be in their place?<\/p>\n","protected":false},"author":21,"featured_media":36070,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36069"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36069"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36069\/revisions"}],"predecessor-version":[{"id":36071,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36069\/revisions\/36071"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36070"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36069"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36069"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36069"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}