{"id":36097,"date":"2022-06-11T15:15:56","date_gmt":"2022-06-11T15:15:56","guid":{"rendered":"https:\/\/care4calais.org\/?p=36097"},"modified":"2022-10-17T16:20:41","modified_gmt":"2022-10-17T15:20:41","slug":"many-deportees-saved-some-still-threatened","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/many-deportees-saved-some-still-threatened\/","title":{"rendered":"Many deportees saved, some still threatened"},"content":{"rendered":"<p>Of the 113 people we are working with, ten still have documents saying they will be sent to Rwanda next Tuesday, 14 June.<\/p>\n<p>Thankfully a further 15 people who had these documents have had them cancelled thanks to the efforts of the amazing law firms we are working with. They will continue working on the other ten.<\/p>\n<p>Frighteningly it appears there are another seven people with removal documents whom we don’t know. Our great fear is that some of these people may not have lawyers to represent them.<\/p>\n<p>We were of course disappointed that our injunction application was denied by the court on Friday. But it is important to note that this was not the main case to decide whether the policy is lawful or not. This was a request for an injunction to stop anyone being deported before the main case is heard in July. It seems very unfair that anyone could be deported before this hearing happens.<\/p>\n<p>The good news is that we can appeal. So on Monday we will be back in court to ask again for this injunction from three new appeal judges. This is particularly important due to the risk of there being people in detention who don’t yet have lawyers. It would be horrific if they are deported without getting any help.<\/p>\n<p>It was also disappointing that our application was denied following the very strong evidence given by UNHCR. Their lawyer came to court to give evidence that UNHCR believe the Rwanda policy to be unlawful and do not endorse the Governments Rwanda plan. To see the judge ignore this was disconcerting.<\/p>\n<p>We are deeply concerned that the Government is willing to deport people who are victims of trafficking and torture. We estimate that 70% of those we talk to have suffered one or the other.<\/p>\n<p>We have also met seven boys under the age of 18 who have been given notices to send them to Rwanda. We are working with lawyers to dispute this.<\/p>\n<p>Also the disturbing trend of targeting Sudanese continues &#8211; as our sample gets larger fully one third continue to be Sudanese.<\/p>\n<p>Hearing the stories of the people who will be sent to Rwanda is enough to give you nightmares. They have escaped wars, been tortured and abused and people have tried to kill them. It’s deeply shocking that the UK may subject these victims to further trauma, and the callousness of deporting torture victims is particularly breathtaking. Be in no doubt of the suffering this is causing; people commonly talk of killing themselves in the detention centres.<\/p>\n<p>This policy is the end result of years of portraying refugees as less than human beings; it makes it possible for some to inflict pain on them without caring. Of course it makes the people inflicting the pain less than human too, because no moral human being could do this to another. We are in very dark territory now.<\/p>\n<p>Since the court ruling our exhausted team once more set out to call every person. We were so worried that the impact of the news would be devastating for them. We don’t have words to thank this amazing team for their fortitude. To support their work donate here:<a href=\"http:\/\/care4calais.org\/stop-rwanda\/\"><span style=\"font-weight: 400;\">care4calais.org\/stop-rwanda\/<\/span><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Of the 113 people we are working with, ten still have documents saying they will be sent to Rwanda next Tuesday, 14 June. Thankfully a further 15 people who had these documents have had them cancelled thanks to the efforts of the amazing law firms we are working with. They will continue working on the other ten. Frighteningly it appears there are another seven people with removal documents whom we don’t know. Our great fear is that some of these people may not have lawyers to represent them. We were of course disappointed that our injunction application was denied by the court on Friday. But it is important to note that this was not the main case to decide whether the policy is lawful or not. This was a request for an injunction to stop anyone being deported before the main case is heard in July. It seems very unfair that anyone could be deported before this hearing happens. The good news is that we can appeal. So on Monday we will be back in court to ask again for this injunction from three new appeal judges. This is particularly important due to the risk of there being people in detention who don’t yet have lawyers. It would be horrific if they are deported without getting any help. It was also disappointing that our application was denied following the very strong evidence given by UNHCR. Their lawyer came to court to give evidence that UNHCR believe the Rwanda policy to be unlawful and do not endorse the Governments Rwanda plan. To see the judge ignore this was disconcerting. We are deeply concerned that the Government is willing to deport people who are victims of trafficking and torture. We estimate that 70% of those we talk to have suffered one or the other. We have also met seven boys under the age of 18 who have been given notices to send them to Rwanda. We are working with lawyers to dispute this. Also the disturbing trend of targeting Sudanese continues &#8211; as our sample gets larger fully one third continue to be Sudanese. Hearing the stories of the people who will be sent to Rwanda is enough to give you nightmares. They have escaped wars, been tortured and abused and people have tried to kill them. It’s deeply shocking that the UK may subject these victims to further trauma, and the callousness of deporting torture victims is particularly breathtaking. Be in no doubt of the suffering this is causing; people commonly talk of killing themselves in the detention centres. This policy is the end result of years of portraying refugees as less than human beings; it makes it possible for some to inflict pain on them without caring. Of course it makes the people inflicting the pain less than human too, because no moral human being could do this to another. We are in very dark territory now. Since the court ruling our exhausted team once more set out to call every person. We were so worried that the impact of the news would be devastating for them. We don’t have words to thank this amazing team for their fortitude. To support their work donate here:care4calais.org\/stop-rwanda\/<\/p>\n","protected":false},"author":21,"featured_media":36098,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,184,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36097"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36097"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36097\/revisions"}],"predecessor-version":[{"id":38136,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36097\/revisions\/38136"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36098"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36097"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36097"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}