{"id":36112,"date":"2022-06-13T09:49:21","date_gmt":"2022-06-13T09:49:21","guid":{"rendered":"https:\/\/care4calais.org\/?p=36112"},"modified":"2022-09-16T17:29:02","modified_gmt":"2022-09-16T16:29:02","slug":"mustafas-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/mustafas-story\/","title":{"rendered":"Mustafa&#8217;s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<p>Mustafa is a young Sudanese man who sought refuge in the UK after many horrendous experiences. He is currently in detention, and has been told he will be sent to Rwanda. He told us his story; it is heartbreaking.<\/p>\n<p><strong>Can you tell us a bit about your background?<\/strong><\/p>\n<p>I’m 23 years old, almost 24. I was born in Darfur, but spent a lot of my childhood and youth in cities. When I was young I lost my dad and older brother in the conflict there, so my mother took me and my younger brother and we moved to another region.<\/p>\n<p>It was very difficult for my mother, moving to new places with with young children all alone. It wasn’t easy to get to know the people. My mum worked as a farmer and my brother and I helped her, working hard in the rainy season, when things grew. We didn’t have land, so we grew crops on someone else’s land and had to share what we harvested with them.<\/p>\n<p>When I reached 14 years old I felt that as the older brother, I needed to do more for the family, and I wanted to do something on my own to help financially, so I went to Khartoum and got work there. I would work in Khartoum in the summer, and go back home during the rainy season to help with the farming and everything.<\/p>\n<p><strong>Why did you have to leave Sudan?<\/strong><\/p>\n<p>I fell in love. I was a teenager, and I fell in love with a girl in the place where my mother and brother lived. She was so beautiful and she made me feel so at ease, I could tell her all my fears and my plans. She was the love of my life.<\/p>\n<p>But she was from a different tribe, one of the Arabic tribes that is seen as higher to mine, which was African.And as our relationship developed, she got pregnant.<\/p>\n<p>Her family wanted to kill me. I would have looked after her, but they wouldn’t want that because they saw me as lower. They came after me to attack ,me, and I had to run. I went back to Khartoum, but they came for me there too. I had crossed a line, and I was never going to safe in Sudan again.<\/p>\n<p>I crossed the border to Chad, but it didn’t work &#8211; as an illegal person there your life is very difficult, so I moved again to Libya, but I was seized and held three months by a militia, being beaten and tortured with electricity and fire, morning to night. It left marks all over my body.<\/p>\n<p>They demanded that his family send money, but I told them, my family didn’t have this sort of money. So instead they just made me work for them.<\/p>\n<p>One day I saw an opportunity to escape, and I climbed over a wall to get away. I did escape but the wall was high and I fell the wrong way and broke my pelvis. I think it is still broken in some way now.<\/p>\n<p>But still, I got away and reached another city, where I met a guy who was good, and helped me, and shared things with me. He told me many people were in the same situation as me. He helped me get a place in a boat, and I crossed to Malta.<\/p>\n<p><strong>What happened in Malta?<\/strong><\/p>\n<p>We were rescued and I had my fingerprints taken and was put in prison. After nine months I was released. I was homeless then, so I got into a lorry that took me to Genoa.<\/p>\n<p>After three days in Genoa I saw another lorry with French plates, and I got on that, and it took me to Marseille. From there I tried to get on a train to Paris, and claimed asylum there.<\/p>\n<p>But they said they would send me back to Malta and I would go to prison again. And I couldn’t go back to Malta so I just went straight to Calais. I didn’t have any particular hopes about the UK, it’s just that I desperately needed a safe option and that was the only one.<\/p>\n<p><strong>What happened when you reached the UK?<\/strong><\/p>\n<p>I got a place in a boat and when I arrived I was taken to detention. After everything that had happened, all the time I had sent being held, that’s what happened when I arrived. I was totally shocked. How could that be?<\/p>\n<p>But then they showed me the letter saying I would be sent to Rwanda. I felt… [very long pause]. It’s just total shock. You know, I was in Calais for 9 months trying to get on lorries, and people were talking about Rwanda, but I never thought it would be true, and you know as we don’t have TV there, and I wasn’t really familiar with the internet, we don’t really have proper news.<\/p>\n<p>So yes. My feeling is shock that after all the time I had spent travelling, just hoping to find somewhere safe I could have a normal life, and thinking I would find a safe place, that they would just send me back again.<\/p>\n<p><strong>If you could say anything to the UK Government, whart would it be?<\/strong><\/p>\n<p>That to do this with no notice is… it’s unhuman. The whole thing, sending people to Rwanda, just isn’t human.<\/p>\n<p><strong>What comes to your mind, thinking back to Sudan?<\/strong><\/p>\n<p>Well, it’s uncomfortable and sad memories.<\/p>\n<p>I’ve never seen my family or the girl I loved since I left. As the girl’s family took her phone, I don’t know what happened to her, or our child. It brings back sad, uncomfortable feelings to think of her. And my mother… I’ve never seen her again either.<\/p>\n<p>It’s not easy not seeing your mother for four years. When I think back, I just remember when I left and asking them to forgive me, saying I was sorry I to leave, but please forgive me. I just kept saying it, forgive me, forgive me, forgive me.<\/p>\n<p>(Names have been changed)<\/p>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">\n<p>&nbsp;<\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Mustafa is a young Sudanese man who sought refuge in the UK after many horrendous experiences. He is currently in detention, and has been told he will be sent to Rwanda. He told us his story; it is heartbreaking. Can you tell us a bit about your background? I’m 23 years old, almost 24. I was born in Darfur, but spent a lot of my childhood and youth in cities. When I was young I lost my dad and older brother in the conflict there, so my mother took me and my younger brother and we moved to another region. It was very difficult for my mother, moving to new places with with young children all alone. It wasn’t easy to get to know the people. My mum worked as a farmer and my brother and I helped her, working hard in the rainy season, when things grew. We didn’t have land, so we grew crops on someone else’s land and had to share what we harvested with them. When I reached 14 years old I felt that as the older brother, I needed to do more for the family, and I wanted to do something on my own to help financially, so I went to Khartoum and got work there. I would work in Khartoum in the summer, and go back home during the rainy season to help with the farming and everything. Why did you have to leave Sudan? I fell in love. I was a teenager, and I fell in love with a girl in the place where my mother and brother lived. She was so beautiful and she made me feel so at ease, I could tell her all my fears and my plans. She was the love of my life. But she was from a different tribe, one of the Arabic tribes that is seen as higher to mine, which was African.And as our relationship developed, she got pregnant. Her family wanted to kill me. I would have looked after her, but they wouldn’t want that because they saw me as lower. They came after me to attack ,me, and I had to run. I went back to Khartoum, but they came for me there too. I had crossed a line, and I was never going to safe in Sudan again. I crossed the border to Chad, but it didn’t work &#8211; as an illegal person there your life is very difficult, so I moved again to Libya, but I was seized and held three months by a militia, being beaten and tortured with electricity and fire, morning to night. It left marks all over my body. They demanded that his family send money, but I told them, my family didn’t have this sort of money. So instead they just made me work for them. One day I saw an opportunity to escape, and I climbed over a wall to get away. I did escape but the wall was high and I fell the wrong way and broke my pelvis. I think it is still broken in some way now. But still, I got away and reached another city, where I met a guy who was good, and helped me, and shared things with me. He told me many people were in the same situation as me. He helped me get a place in a boat, and I crossed to Malta. What happened in Malta? We were rescued and I had my fingerprints taken and was put in prison. After nine months I was released. I was homeless then, so I got into a lorry that took me to Genoa. After three days in Genoa I saw another lorry with French plates, and I got on that, and it took me to Marseille. From there I tried to get on a train to Paris, and claimed asylum there. But they said they would send me back to Malta and I would go to prison again. And I couldn’t go back to Malta so I just went straight to Calais. I didn’t have any particular hopes about the UK, it’s just that I desperately needed a safe option and that was the only one. What happened when you reached the UK? I got a place in a boat and when I arrived I was taken to detention. After everything that had happened, all the time I had sent being held, that’s what happened when I arrived. I was totally shocked. How could that be? But then they showed me the letter saying I would be sent to Rwanda. I felt… [very long pause]. It’s just total shock. You know, I was in Calais for 9 months trying to get on lorries, and people were talking about Rwanda, but I never thought it would be true, and you know as we don’t have TV there, and I wasn’t really familiar with the internet, we don’t really have proper news. So yes. My feeling is shock that after all the time I had spent travelling, just hoping to find somewhere safe I could have a normal life, and thinking I would find a safe place, that they would just send me back again. If you could say anything to the UK Government, whart would it be? That to do this with no notice is… it’s unhuman. The whole thing, sending people to Rwanda, just isn’t human. What comes to your mind, thinking back to Sudan? Well, it’s uncomfortable and sad memories. I’ve never seen my family or the girl I loved since I left. As the girl’s family took her phone, I don’t know what happened to her, or our child. It brings back sad, uncomfortable feelings to think of her. And my mother… I’ve never seen her again either. It’s not easy not seeing your mother for four years. When I think back, I just remember when I left and asking them to forgive me, saying I was sorry I to leave, but please forgive [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":36113,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36112"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36112"}],"version-history":[{"count":6,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36112\/revisions"}],"predecessor-version":[{"id":37714,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36112\/revisions\/37714"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36113"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36112"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36112"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36112"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}