{"id":36150,"date":"2022-06-14T10:14:12","date_gmt":"2022-06-14T10:14:12","guid":{"rendered":"https:\/\/care4calais.org\/?p=36150"},"modified":"2022-10-17T16:19:11","modified_gmt":"2022-10-17T15:19:11","slug":"seven-refugees-face-traumatic-deportation","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/seven-refugees-face-traumatic-deportation\/","title":{"rendered":"Seven refugees face traumatic deportation"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>We urgently need to stop this brutal policy that will harm many innocent people. To find out how you can help, go to <a href=\"http:\/\/care4calais.org\/stop-rwanda\/\">care4calais.org\/stop-rwanda\/<\/a><\/p>\n<p>At the time of writing, 10.15am on Tuesday morning, there are seven refugees booked on today&#8217;s flight to Rwanda. At least five of them have indicators of being trafficked and\/or tortured.<\/p>\n<p>Yesterday in the Court of Appeal we heard that the United Nations High Commission for Refugees unequivocally believes the UK Government’s Rwanda policy to be unlawful.<\/p>\n<p>We also heard that they do not believe Rwanda has the capacity to give people a fair hearing for their asylum claims.<\/p>\n<p>However, yesterday&#8217;s hearing was not about the lawfulness of the policy. Yesterday&#8217;s hearing was about whether our government can deport people to Rwanda before the hearing takes place to determine whether or not the policy is lawful. This hearing will take place in July.<\/p>\n<p>The court decided that it is possible to deport people in the meantime as, if is later found the policy is unlawful, anyone who was previously deported can be brought back to the UK.<\/p>\n<p>The problem with this judgement is that ignores the reality on the ground.<br \/>\nWe are talking about refugees. Victims who have suffered the worst things that can happen to human beings in this world. They have seen their families killed; they have suffered torture; they have been sold as slaves. They are scarred by these experiences, and exhausted from their journeys. Their families are sick with worry about them. And they are terrified for the future.<\/p>\n<p>Flying such people to any distant and unfamiliar country, let alone one with a poor human rights record and an ongoing armed conflict, will cause extreme trauma.<\/p>\n<p>Inflicting this trauma on people who are already traumatised by war and torture is so cruel it lies well outside the standards of behaviour we expect of today’s nations. To assume the victims can simply be brought home as if they were just inanimate packages is to think and act with a complete lack of human empathy. After this, what else is possible?<\/p>\n<p>You have to wonder what the government officers who might bring people back would say to them. We’re sorry? Never mind?<\/p>\n<p>And what too might they say to the families of these men we are putting through hell? Sorry we forcibly sent your son, who we knew to have been kidnapped, tortured and trafficked, to Rwanda?<\/p>\n<p>In fact, it seems entirely possible that there will be no-one to apologise to.<\/p>\n<p>Some refugees have said that they will kill themselves if they are sent to Rwanda.<\/p>\n<p>How will we bring them back then?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We urgently need to stop this brutal policy that will harm many innocent people. To find out how you can help, go to care4calais.org\/stop-rwanda\/ At the time of writing, 10.15am on Tuesday morning, there are seven refugees booked on today&#8217;s flight to Rwanda. At least five of them have indicators of being trafficked and\/or tortured. Yesterday in the Court of Appeal we heard that the United Nations High Commission for Refugees unequivocally believes the UK Government’s Rwanda policy to be unlawful. We also heard that they do not believe Rwanda has the capacity to give people a fair hearing for their asylum claims. However, yesterday&#8217;s hearing was not about the lawfulness of the policy. Yesterday&#8217;s hearing was about whether our government can deport people to Rwanda before the hearing takes place to determine whether or not the policy is lawful. This hearing will take place in July. The court decided that it is possible to deport people in the meantime as, if is later found the policy is unlawful, anyone who was previously deported can be brought back to the UK. The problem with this judgement is that ignores the reality on the ground. We are talking about refugees. Victims who have suffered the worst things that can happen to human beings in this world. They have seen their families killed; they have suffered torture; they have been sold as slaves. They are scarred by these experiences, and exhausted from their journeys. Their families are sick with worry about them. And they are terrified for the future. Flying such people to any distant and unfamiliar country, let alone one with a poor human rights record and an ongoing armed conflict, will cause extreme trauma. Inflicting this trauma on people who are already traumatised by war and torture is so cruel it lies well outside the standards of behaviour we expect of today’s nations. To assume the victims can simply be brought home as if they were just inanimate packages is to think and act with a complete lack of human empathy. After this, what else is possible? You have to wonder what the government officers who might bring people back would say to them. We’re sorry? Never mind? And what too might they say to the families of these men we are putting through hell? Sorry we forcibly sent your son, who we knew to have been kidnapped, tortured and trafficked, to Rwanda? In fact, it seems entirely possible that there will be no-one to apologise to. Some refugees have said that they will kill themselves if they are sent to Rwanda. How will we bring them back then?<\/p>\n","protected":false},"author":21,"featured_media":36151,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,172,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36150"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36150"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36150\/revisions"}],"predecessor-version":[{"id":38134,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36150\/revisions\/38134"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36151"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36150"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36150"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36150"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}