{"id":36540,"date":"2022-06-17T11:45:14","date_gmt":"2022-06-17T11:45:14","guid":{"rendered":"https:\/\/care4calais.org\/?p=36540"},"modified":"2022-09-16T17:16:27","modified_gmt":"2022-09-16T16:16:27","slug":"ashraf-and-alis-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/ashraf-and-alis-story\/","title":{"rendered":"Ashraf and Ali’s story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div dir=\"auto\">\n<p>Forty-eight hours ago, Ali and his father Ashraf thought they would never see each other again.<\/p>\n<p>The family are Christian, which made life in Iran dangerous for them. The authorities constantly intimidated and threatened them, so finally they made a big decision together. Ashraf and Ali would make the incredibly dangerous journey to seek asylum in the UK and, if successful, bring Ali’s mum and his two sisters – the three of them are triplets – to join them.<\/p>\n<p>It was hard for Ali to leave his mother and two sisters. Triplets share a special bond and they are very close, but he felt he had to do it to save them all.  He and his father first made a dangerous crossing through the mountains to Turkey, then passed through Greece and Italy on their way to northern France.<\/p>\n<p>They had hoped to get a boat to the UK together, but they only had  enough money for one of them.  Ashraf told Ali to go ahead, and he would follow soon after.  It meant living rough in Calais, but he stuck it out, and finally got a place in a boat; however, it sank and Ashraf, in serious danger of drowning,  had to be pulled from the cold sea by rescuers.<\/p>\n<p>Two months passed before Ashraf managed to get across the Channel, but then, just at the point when he thought he’d see his son again, he was locked in detention and told the British government was sending him to Rwanda. The shock and despair of being told this by a government that you had thought would offer you safety was unimaginable.<\/p>\n<p>Since that moment Ashraf had been living in a waking hell.   Unable to help his family after taking so many risks to find safely for them, with no control over his future and no hope to offer to his wife, he considered taking his own life.<\/p>\n<p>Throughout this time Ali was living in an asylum hotel in the north of England. He was in a strange new town, constantly fretting about the dad who “means everything to me.” Sharing news with his mum and sisters as best he could, he was never able to relax, not even able to breathe properly: “these two months have felt like two years.”<\/p>\n<p>When we finally went to the high court on 13 June, Ali and Ashraf were in our minds all day. When the shock of British judges denying our appeal sank in, we realised we would have to phone and tell them first. We couldn’t bear for them to hear it on the news. But what awful phone calls to have to make.<\/p>\n<p>The day of the flight was even worse. Our volunteers were in touch with both men up to the last few hours, when Ashraf was locked in the back of a van and his phone was taken away.<\/p>\n<p>But then amazing news. The European Court of Human Rights had stopped the flight.  There are no words to describe the overwhelming relief everyone felt. It was as if there was light in the world again.<\/p>\n<p>The next morning the first thing we did was to make arrangements to get Ali down to see his father.  By midday Ali was on the train to London. Our volunteer Tristan was there to meet him and took him to get food and to a hotel for the night. The next morning they set off to meet Ashraf at his detention centre, with Ali feeling elated and excited.<\/p>\n<p>Thanks to our amazing volunteers, an overjoyed Ali hugged his dad again, both men overcome with relief, happiness and a feeling of safety.<\/p>\n<p>“It was a really amazing feeling to see my father after two months,” he told Tristan afterwards. “It’s great to know that he is here and that I can tell my family he is fine. Now there is no stress again, there is hope, and I feel that I will not give up. Meeting my father was the best moment of being in the UK so far.<\/p>\n<p>“I&#8217;ll never forget this week because of everything that happened. After this I’ll always keep it in my mind not to forget how amazing the feeling is when you have freedom and be with your family.<\/p>\n<p>“It is not just about me and my father, but all our family. My mom and my sisters in Iran are very happy too &#8211; because we are together again, they are not worried about us any more.“<\/p>\n<p>“The meeting was every bit as emotional as you would expect,” says Tristan. “It’s hard not to ask yourself why this family has been put through this needless nightmare in the first place. It’s a very stark reminder of just how callous and barbaric this whole scheme is.”<\/p>\n<p>Ali says that he’s learned something positive from this whole dark experience. Because of the support of people like Tristan and other Care4Calais supporters, he says, he has realised that humanity is still here and there are a lot of people who still care about refugees. Now he is sure that he will never be alone again, and that makes him really, really happy.<\/p>\n<p>“These people are different,” he says. ”I love them. They are my family. I mean that with all my heart.”<\/p>\n<p>We are challenging the government’s Rwanda policy in court in July, and we need your help more than ever. To find out how to help go to care4calais.org\/stop-rwanda\/<\/p>\n<p>Names have been changed.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Forty-eight hours ago, Ali and his father Ashraf thought they would never see each other again. The family are Christian, which made life in Iran dangerous for them. The authorities constantly intimidated and threatened them, so finally they made a big decision together. Ashraf and Ali would make the incredibly dangerous journey to seek asylum in the UK and, if successful, bring Ali’s mum and his two sisters – the three of them are triplets – to join them. It was hard for Ali to leave his mother and two sisters. Triplets share a special bond and they are very close, but he felt he had to do it to save them all.  He and his father first made a dangerous crossing through the mountains to Turkey, then passed through Greece and Italy on their way to northern France. They had hoped to get a boat to the UK together, but they only had  enough money for one of them.  Ashraf told Ali to go ahead, and he would follow soon after.  It meant living rough in Calais, but he stuck it out, and finally got a place in a boat; however, it sank and Ashraf, in serious danger of drowning,  had to be pulled from the cold sea by rescuers. Two months passed before Ashraf managed to get across the Channel, but then, just at the point when he thought he’d see his son again, he was locked in detention and told the British government was sending him to Rwanda. The shock and despair of being told this by a government that you had thought would offer you safety was unimaginable. Since that moment Ashraf had been living in a waking hell.   Unable to help his family after taking so many risks to find safely for them, with no control over his future and no hope to offer to his wife, he considered taking his own life. Throughout this time Ali was living in an asylum hotel in the north of England. He was in a strange new town, constantly fretting about the dad who “means everything to me.” Sharing news with his mum and sisters as best he could, he was never able to relax, not even able to breathe properly: “these two months have felt like two years.” When we finally went to the high court on 13 June, Ali and Ashraf were in our minds all day. When the shock of British judges denying our appeal sank in, we realised we would have to phone and tell them first. We couldn’t bear for them to hear it on the news. But what awful phone calls to have to make. The day of the flight was even worse. Our volunteers were in touch with both men up to the last few hours, when Ashraf was locked in the back of a van and his phone was taken away. But then amazing news. The European Court of Human Rights had stopped the flight.  There are no words to describe the overwhelming relief everyone felt. It was as if there was light in the world again. The next morning the first thing we did was to make arrangements to get Ali down to see his father.  By midday Ali was on the train to London. Our volunteer Tristan was there to meet him and took him to get food and to a hotel for the night. The next morning they set off to meet Ashraf at his detention centre, with Ali feeling elated and excited. Thanks to our amazing volunteers, an overjoyed Ali hugged his dad again, both men overcome with relief, happiness and a feeling of safety. “It was a really amazing feeling to see my father after two months,” he told Tristan afterwards. “It’s great to know that he is here and that I can tell my family he is fine. Now there is no stress again, there is hope, and I feel that I will not give up. Meeting my father was the best moment of being in the UK so far. “I&#8217;ll never forget this week because of everything that happened. After this I’ll always keep it in my mind not to forget how amazing the feeling is when you have freedom and be with your family. “It is not just about me and my father, but all our family. My mom and my sisters in Iran are very happy too &#8211; because we are together again, they are not worried about us any more.“ “The meeting was every bit as emotional as you would expect,” says Tristan. “It’s hard not to ask yourself why this family has been put through this needless nightmare in the first place. It’s a very stark reminder of just how callous and barbaric this whole scheme is.” Ali says that he’s learned something positive from this whole dark experience. Because of the support of people like Tristan and other Care4Calais supporters, he says, he has realised that humanity is still here and there are a lot of people who still care about refugees. Now he is sure that he will never be alone again, and that makes him really, really happy. “These people are different,” he says. ”I love them. They are my family. I mean that with all my heart.” We are challenging the government’s Rwanda policy in court in July, and we need your help more than ever. To find out how to help go to care4calais.org\/stop-rwanda\/ Names have been changed.<\/p>\n","protected":false},"author":21,"featured_media":36541,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36540"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36540"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36540\/revisions"}],"predecessor-version":[{"id":37712,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36540\/revisions\/37712"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36541"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36540"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36540"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36540"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}