{"id":36552,"date":"2022-06-18T13:54:32","date_gmt":"2022-06-18T13:54:32","guid":{"rendered":"https:\/\/care4calais.org\/?p=36552"},"modified":"2023-02-08T16:46:27","modified_gmt":"2023-02-08T15:46:27","slug":"a-busy-day-in-dungeness","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/a-busy-day-in-dungeness\/","title":{"rendered":"A busy day in Dungeness"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Yesterday we welcomed about 74 refugees who came ashore in two boats at Dungeness. Many of the people on the first boat were from Afghanistan, and several of those we spoke to on the second were from Eritrea and Syria. The second had a lot of families and very young children, and had been at sea for many hours; some of those aboard were freezing cold, and their hands were shaking so much they couldn’t even open packets of biscuits for themselves.<\/p>\n<p>It is hard to see people like this, and it’s a great help to them to offer food, warmth and welcoming smiles. We distributed hats, blankets, water, biscuits, sliders, joggers, underwear, t-shirts and jumpers.<\/p>\n<p>The first boat arrived at Dungeness in the morning, brought in by the rescuing lifeboat. I walked up the beach with the refugees, and noticed a family with a young boy, and two elderly ladies among them. As I handed out biscuits and water, one young boy told me that he had family in the UK that he wanted to get to. That made me think of one of the men who was due to be on the Rwanda flight despite having family in the UK. It made me worried for this young man, and I wondered if he would ever be allowed to reunite with his family here.<\/p>\n<p>Meeting refugees coming off the boats now brings mixed emotions. I’m relieved to see them safe, but also concerned about what is going to happen to them next.<\/p>\n<p>The second boat came in much later. Two other volunteers and I arrived around 9pm and waited; the lifeboat took some time to find the dinghy, not getting back until 11pm.<\/p>\n<p>As the refugees walked up the beach, I spoke to a Syrian man who, having no shoes, had to walk up the stoney beach barefoot. They had left in the early hours of the morning, he told me, but despite this he was so happy to have arrived safely, and for us handing out oat biscuits and water. He playfully told me he would keep one of the oat bars as a reminder of our meeting! Luckily I was able to give him some socks and sliders.<\/p>\n<p>Another man I met was extremely cold and could not stop shaking. I pulled a hat on his head, wrapped two blankets around him and gave him some water and biscuits. Yet another man was absolutely freezing cold and had to be supported to the coach by two police officers. He did not look well at all, but despite this he gave me a smile when I offered him blankets, biscuits and water.<\/p>\n<p>It’s important to remember that even though we are enjoying hot weather, the people getting off the boats are often still extremely cold; their clothes are usually soaked through from the journey and they are often at sea for many hours. Even I was wearing my coat as I waited for the lifeboat to come in last night.<\/p>\n<p>Finally, as so often on these nights, I found myself feeling a bit an awe of the children. We handed out hats and blankets to them, and when they were on the coach waiting for it to leave, we stood at the window while the they waved at us and made faces playing. Their resilience always amazes me. It seems a sign of the undefeated spirit that characterises these people, – people who we should be proud to welcome to our shores.<\/p>\n<p>We are raising funds to enable us to welcome and help refugees who arrive here cold, hungry and with nothing to their name. To make a donation to our welcoming work, please go to [Fundraiser &#8211; C4C Emergency Response Team Dover](<a href=\"https:\/\/www.peoplesfundraising.com\/fundraising\/c4c-emergency-response-team-dover&amp;tag=?fbclid=IwAR1bP8useNiQDBTmPoai57o_1oUcfCbk4_hy_Mu5WDvMi3zpVGVC9_dAEj0\">https:\/\/www.peoplesfundraising.com\/fundraising\/c4c-emergency-response-team-dover&amp;tag=?fbclid=IwAR1bP8useNiQDBTmPoai57o_1oUcfCbk4_hy_Mu5WDvMi3zpVGVC9_dAEj0<\/a>)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Yesterday we welcomed about 74 refugees who came ashore in two boats at Dungeness. Many of the people on the first boat were from Afghanistan, and several of those we spoke to on the second were from Eritrea and Syria. The second had a lot of families and very young children, and had been at sea for many hours; some of those aboard were freezing cold, and their hands were shaking so much they couldn’t even open packets of biscuits for themselves. It is hard to see people like this, and it’s a great help to them to offer food, warmth and welcoming smiles. We distributed hats, blankets, water, biscuits, sliders, joggers, underwear, t-shirts and jumpers. The first boat arrived at Dungeness in the morning, brought in by the rescuing lifeboat. I walked up the beach with the refugees, and noticed a family with a young boy, and two elderly ladies among them. As I handed out biscuits and water, one young boy told me that he had family in the UK that he wanted to get to. That made me think of one of the men who was due to be on the Rwanda flight despite having family in the UK. It made me worried for this young man, and I wondered if he would ever be allowed to reunite with his family here. Meeting refugees coming off the boats now brings mixed emotions. I’m relieved to see them safe, but also concerned about what is going to happen to them next. The second boat came in much later. Two other volunteers and I arrived around 9pm and waited; the lifeboat took some time to find the dinghy, not getting back until 11pm. As the refugees walked up the beach, I spoke to a Syrian man who, having no shoes, had to walk up the stoney beach barefoot. They had left in the early hours of the morning, he told me, but despite this he was so happy to have arrived safely, and for us handing out oat biscuits and water. He playfully told me he would keep one of the oat bars as a reminder of our meeting! Luckily I was able to give him some socks and sliders. Another man I met was extremely cold and could not stop shaking. I pulled a hat on his head, wrapped two blankets around him and gave him some water and biscuits. Yet another man was absolutely freezing cold and had to be supported to the coach by two police officers. He did not look well at all, but despite this he gave me a smile when I offered him blankets, biscuits and water. It’s important to remember that even though we are enjoying hot weather, the people getting off the boats are often still extremely cold; their clothes are usually soaked through from the journey and they are often at sea for many hours. Even I was wearing my coat as I waited for the lifeboat to come in last night. Finally, as so often on these nights, I found myself feeling a bit an awe of the children. We handed out hats and blankets to them, and when they were on the coach waiting for it to leave, we stood at the window while the they waved at us and made faces playing. Their resilience always amazes me. It seems a sign of the undefeated spirit that characterises these people, – people who we should be proud to welcome to our shores. We are raising funds to enable us to welcome and help refugees who arrive here cold, hungry and with nothing to their name. To make a donation to our welcoming work, please go to [Fundraiser &#8211; C4C Emergency Response Team Dover](https:\/\/www.peoplesfundraising.com\/fundraising\/c4c-emergency-response-team-dover&amp;tag=?fbclid=IwAR1bP8useNiQDBTmPoai57o_1oUcfCbk4_hy_Mu5WDvMi3zpVGVC9_dAEj0)<\/p>\n","protected":false},"author":21,"featured_media":36553,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36552"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36552"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36552\/revisions"}],"predecessor-version":[{"id":38132,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36552\/revisions\/38132"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36553"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36552"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36552"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36552"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}