{"id":36614,"date":"2022-06-22T17:16:58","date_gmt":"2022-06-22T17:16:58","guid":{"rendered":"https:\/\/care4calais.org\/?p=36614"},"modified":"2022-06-22T17:57:19","modified_gmt":"2022-06-22T17:57:19","slug":"ahmeds-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/ahmeds-story\/","title":{"rendered":"Ahmed&#8217;s story"},"content":{"rendered":"<p>Ahmed is a young man from a village in the Afghan countryside. His beautiful brown eyes show all the worry of the world. When I met him, his first question was, “ Are they sending me to Rwanda?”<\/p>\n<p>He doesn’t speak English so can’t really follow the news. I reassured him the best I could, saying he should be ok he arrived before people were doing detained. I told him Care4Calais was fighting this case, and that no-one had been removed yet. And I said “Our founder Clare Moseley will never stop fighting for what was right. If Priti Patel think she can win, she doesn’t know Clare.<\/p>\n<p>With that his brow unfurrowed a bit, and he smiled.<\/p>\n<p>“Thank you” he said.<\/p>\n<p>Of course the awful thing is that right now, I couldn’t promise he would not be removed to Rwanda.<\/p>\n<p>Ahmed is 22, and from Nangahar Province in Afghanistan, not too far from the border with Pakistan.<\/p>\n<p>“I went to school as much as I could” he told me (a volunteer was helping with interpretation) “but there was always Taliban activity and threats, so the school kept closing. But I stayed until I was about 17, then I couldn’t go to college. The Taliban would not let me go. Instead I just got a job with the old Afghan government, working for the police. There was no chance to do anything else. My dad was in the police force, and he got me the the job. That was all I could do.<\/p>\n<p>“But the police there are not like your police, they fight and they kill people. They don’t care how old you are, they just give you a gun and tell you to do your job.<\/p>\n<p>“But when the Taliban came in July my family and me started to get lots of threats. Anyone who worked for the old government get threats, there is no trial, no prison – you’re just executed when they find you.<\/p>\n<p>“They killed my dad like that.<\/p>\n<p>“So I had to leave.<\/p>\n<p>“My mum and sisters helped pay a fee, a very big fee, to a people smuggler. They sacrificed a lot. I didn’t choose the UK, the smugglers choose it for me, and they brought me all the way here.<\/p>\n<p>“My mum and my three sisters got threats after I left and they’re still getting them now. The Taliban say they must tell them where I am, or they will be tortured. I’m still scared for my family though. That’s why I can’t show my face in the photograph.<\/p>\n<p>Even with the help of a smuggler Ahmed’s journey was so horrific.<\/p>\n<p>“First I went into Pakistan, and then Iran. The police on that border are horrible and I was beaten many times. We made our way to Turkey by walking &#8211; lots of walking! – and in cars. Some of the cars were so full I couldn’t move, and we had to stay in them for long hours.<\/p>\n<p>“From Turkey I went to Bulgaria and Serbia – that meant going from it being very hot in Iran to being freezing cold in Serbia. I was always so, so hungry, but we never had proper food to eat, just a few biscuits and water because that’s all we could buy. In the Balkans was the worst, the police are so bad and I was beaten again, just over and over again.<\/p>\n<p>“I would think back to my home, and would make me so sad. I remembered all the rivers and the high mountains… Afghanistan is a beautiful country. Just amazing places, and such beautiful empty spaces.”<\/p>\n<p>The journey took Ahmed four months. After passing through Hungary, Austria, and Switzerland and France, Ahmed got a small boat across the channel, in February, and ended up in his hotel. It’s somewhere in there countryside – he thinks he is near Birmingham but isn’t sure – and he still feels nervous about going out.<\/p>\n<p>“I feel safe here though. It is a very secure country and everyone is nice to me, I’m glad this is where I was brought. The UK is the only place the Taliban cannot reach me.”<\/p>\n<p>Ahmed is just a young boy who has been forced to leave his home. He seems bewildered and lost. When I ask about Afghanistan, his eyes fill with tears. “What I loved the most was going to Kabul,” he says. “It’s a big city, and is a bit safer than the rest of Afghanistan. I felt secure there. There is so much to do in the city and it is so modern and clean. It is a very beautiful place – and the dried fruits you can buy are delicious!”<\/p>\n<p>Like so many refugees he wants to go to college and learn English. He’d like to become a doctor; tell him that it will take him a long time to qualify, and he says he would just love the chance to try. So many young refugees are not able to access learning or jobs in their home country so the chance to learn here is precious.<\/p>\n<p>Right now, he wants to go to the city that he thinks is Birmingham, to see if it is as nice as Kabul. He wants to go to the gym, and to play cricket just like any young man.<\/p>\n<p>Ahmed is still yearning for home – he loves Afghanistan and everything there, and needs help to really thrive as he could do here. That’s why we need volunteers to help young refugees – they can make the world of difference to a young life. If you can help people like Ahmed, please email annie@care4calais.org to get started.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ahmed is a young man from a village in the Afghan countryside. His beautiful brown eyes show all the worry of the world. When I met him, his first question was, “ Are they sending me to Rwanda?” He doesn’t speak English so can’t really follow the news. I reassured him the best I could, saying he should be ok he arrived before people were doing detained. I told him Care4Calais was fighting this case, and that no-one had been removed yet. And I said “Our founder Clare Moseley will never stop fighting for what was right. If Priti Patel think she can win, she doesn’t know Clare. With that his brow unfurrowed a bit, and he smiled. “Thank you” he said. Of course the awful thing is that right now, I couldn’t promise he would not be removed to Rwanda. Ahmed is 22, and from Nangahar Province in Afghanistan, not too far from the border with Pakistan. “I went to school as much as I could” he told me (a volunteer was helping with interpretation) “but there was always Taliban activity and threats, so the school kept closing. But I stayed until I was about 17, then I couldn’t go to college. The Taliban would not let me go. Instead I just got a job with the old Afghan government, working for the police. There was no chance to do anything else. My dad was in the police force, and he got me the the job. That was all I could do. “But the police there are not like your police, they fight and they kill people. They don’t care how old you are, they just give you a gun and tell you to do your job. “But when the Taliban came in July my family and me started to get lots of threats. Anyone who worked for the old government get threats, there is no trial, no prison – you’re just executed when they find you. “They killed my dad like that. “So I had to leave. “My mum and sisters helped pay a fee, a very big fee, to a people smuggler. They sacrificed a lot. I didn’t choose the UK, the smugglers choose it for me, and they brought me all the way here. “My mum and my three sisters got threats after I left and they’re still getting them now. The Taliban say they must tell them where I am, or they will be tortured. I’m still scared for my family though. That’s why I can’t show my face in the photograph. Even with the help of a smuggler Ahmed’s journey was so horrific. “First I went into Pakistan, and then Iran. The police on that border are horrible and I was beaten many times. We made our way to Turkey by walking &#8211; lots of walking! – and in cars. Some of the cars were so full I couldn’t move, and we had to stay in them for long hours. “From Turkey I went to Bulgaria and Serbia – that meant going from it being very hot in Iran to being freezing cold in Serbia. I was always so, so hungry, but we never had proper food to eat, just a few biscuits and water because that’s all we could buy. In the Balkans was the worst, the police are so bad and I was beaten again, just over and over again. “I would think back to my home, and would make me so sad. I remembered all the rivers and the high mountains… Afghanistan is a beautiful country. Just amazing places, and such beautiful empty spaces.” The journey took Ahmed four months. After passing through Hungary, Austria, and Switzerland and France, Ahmed got a small boat across the channel, in February, and ended up in his hotel. It’s somewhere in there countryside – he thinks he is near Birmingham but isn’t sure – and he still feels nervous about going out. “I feel safe here though. It is a very secure country and everyone is nice to me, I’m glad this is where I was brought. The UK is the only place the Taliban cannot reach me.” Ahmed is just a young boy who has been forced to leave his home. He seems bewildered and lost. When I ask about Afghanistan, his eyes fill with tears. “What I loved the most was going to Kabul,” he says. “It’s a big city, and is a bit safer than the rest of Afghanistan. I felt secure there. There is so much to do in the city and it is so modern and clean. It is a very beautiful place – and the dried fruits you can buy are delicious!” Like so many refugees he wants to go to college and learn English. He’d like to become a doctor; tell him that it will take him a long time to qualify, and he says he would just love the chance to try. So many young refugees are not able to access learning or jobs in their home country so the chance to learn here is precious. Right now, he wants to go to the city that he thinks is Birmingham, to see if it is as nice as Kabul. He wants to go to the gym, and to play cricket just like any young man. Ahmed is still yearning for home – he loves Afghanistan and everything there, and needs help to really thrive as he could do here. That’s why we need volunteers to help young refugees – they can make the world of difference to a young life. If you can help people like Ahmed, please email annie@care4calais.org to get started. &nbsp; &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":36615,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36614"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36614"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36614\/revisions"}],"predecessor-version":[{"id":36618,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36614\/revisions\/36618"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36615"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36614"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36614"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36614"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}