{"id":36705,"date":"2022-07-01T17:35:58","date_gmt":"2022-07-01T17:35:58","guid":{"rendered":"https:\/\/care4calais.org\/?p=36705"},"modified":"2023-02-08T16:45:02","modified_gmt":"2023-02-08T15:45:02","slug":"care4calais-fc-adventure-at-the-refugee-world-cup","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/care4calais-fc-adventure-at-the-refugee-world-cup\/","title":{"rendered":"Care4Calais FC&#8217;s adventure at the Refugee World Cup"},"content":{"rendered":"<p>Refugees are often incredibly resourceful and inspiring people, and when you support them as a volunteer with Care4Calais, you can find yourself doing amazing things that you probably wouldn’t have otherwise tried. That’s how our group in Manchester came to set up a football team and enter the Refugee World Cup!<\/p>\n<p>It started when we began running social afternoons at a hotel housing asylum seekers in the city. We began supporting a couple of people who were struggling with their mental health, and one Sunday afternoon we decided to take along some footballs and snacks to see if that helped.<\/p>\n<p>It did. First one, then another person came out to see what was happening, and then more and more; eventually a competitive game of five-a-side football took shape with several other groups sat around in the sunshine watching, chatting.<\/p>\n<p>Many of the guys had only recently arrived at the hotel, and one told us that this was the first time they had all come together in such a way. Now people from many different countries and cultures were mixing, and even though many were speaking different languages, it didn’t matter. All this had come from someone thinking to take a ball along! It really showed the power of football and sport in general. Refugees can be so isolated and used to being on their own, and little things like this can make all the difference.<\/p>\n<p>Now, there is a competition called the Refugee World Cup, which takes place annually in Manchester as part of Refugee Week celebrations. This year’s event was run by Manchester Refugee Support Network (MRSN) and the Manchester FA and had more than 22 teams of refugees, asylum seekers and community groups from across the city taking part.<\/p>\n<p>As we were watching the guys playing football in the sun we decided to get a Care4Calais team together and enter.<\/p>\n<p>We only had a month to organize it all – not easy, as we didn’t know the refugees well at the time, they did not know us and we had no supplies.<\/p>\n<p>Luckily we had met Mohammed, a refugee at the hotel, who was a massive help. He got the group together and did all the interpretation for us. Organising the team was a real community effort. A local football club called Lymm Rovers loaned us a set of strips. Football boots were donated by Happy Somedays community group. Lots of people helped, and when they day came, we were ready.<\/p>\n<p>We had 13 players from so many countries &#8211; Sudan, Yemen, Eritrea, Syria, and Kurdistan &#8211; and a great photographer from Egypt to take pictures. Mohammed didn’t play, but translated and helped us organise everyone.<\/p>\n<p>Despite no regular training, the team drew 4 of their 5 matches and by the end of the day had really come together and were looking threatening on the pitch. Our goalkeeper, Abdelrahman, made some spectacular saves which earnt him recognition as the teams (unofficial) player of the tournament.<\/p>\n<p>Mohammed told me, “I would like to thank Care 4 Calais to do this activity and previous activities, it’s a good organisation and a lot of thanks to Lucy, Rebecca and Mara for making our day. It was a good day and we were delighted and wish to do more and more activities. Thank you.”<\/p>\n<p>It’s been a great experience, and although the tournament is over, this is hopefully only the beginning. We are already planning for more matches over the summer, and will keep up our social afternoons at the hotel. You might be seeing us as a stadium near you one day!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Refugees are often incredibly resourceful and inspiring people, and when you support them as a volunteer with Care4Calais, you can find yourself doing amazing things that you probably wouldn’t have otherwise tried. That’s how our group in Manchester came to set up a football team and enter the Refugee World Cup! It started when we began running social afternoons at a hotel housing asylum seekers in the city. We began supporting a couple of people who were struggling with their mental health, and one Sunday afternoon we decided to take along some footballs and snacks to see if that helped. It did. First one, then another person came out to see what was happening, and then more and more; eventually a competitive game of five-a-side football took shape with several other groups sat around in the sunshine watching, chatting. Many of the guys had only recently arrived at the hotel, and one told us that this was the first time they had all come together in such a way. Now people from many different countries and cultures were mixing, and even though many were speaking different languages, it didn’t matter. All this had come from someone thinking to take a ball along! It really showed the power of football and sport in general. Refugees can be so isolated and used to being on their own, and little things like this can make all the difference. Now, there is a competition called the Refugee World Cup, which takes place annually in Manchester as part of Refugee Week celebrations. This year’s event was run by Manchester Refugee Support Network (MRSN) and the Manchester FA and had more than 22 teams of refugees, asylum seekers and community groups from across the city taking part. As we were watching the guys playing football in the sun we decided to get a Care4Calais team together and enter. We only had a month to organize it all – not easy, as we didn’t know the refugees well at the time, they did not know us and we had no supplies. Luckily we had met Mohammed, a refugee at the hotel, who was a massive help. He got the group together and did all the interpretation for us. Organising the team was a real community effort. A local football club called Lymm Rovers loaned us a set of strips. Football boots were donated by Happy Somedays community group. Lots of people helped, and when they day came, we were ready. We had 13 players from so many countries &#8211; Sudan, Yemen, Eritrea, Syria, and Kurdistan &#8211; and a great photographer from Egypt to take pictures. Mohammed didn’t play, but translated and helped us organise everyone. Despite no regular training, the team drew 4 of their 5 matches and by the end of the day had really come together and were looking threatening on the pitch. Our goalkeeper, Abdelrahman, made some spectacular saves which earnt him recognition as the teams (unofficial) player of the tournament. Mohammed told me, “I would like to thank Care 4 Calais to do this activity and previous activities, it’s a good organisation and a lot of thanks to Lucy, Rebecca and Mara for making our day. It was a good day and we were delighted and wish to do more and more activities. Thank you.” It’s been a great experience, and although the tournament is over, this is hopefully only the beginning. We are already planning for more matches over the summer, and will keep up our social afternoons at the hotel. You might be seeing us as a stadium near you one day!<\/p>\n","protected":false},"author":21,"featured_media":36706,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,185,70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36705"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36705"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36705\/revisions"}],"predecessor-version":[{"id":36708,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36705\/revisions\/36708"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36706"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36705"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36705"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36705"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}