{"id":36804,"date":"2022-07-10T15:04:42","date_gmt":"2022-07-10T15:04:42","guid":{"rendered":"https:\/\/care4calais.org\/?p=36804"},"modified":"2022-07-10T15:04:42","modified_gmt":"2022-07-10T15:04:42","slug":"omers-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/omers-story\/","title":{"rendered":"Omer&#8217;s Story"},"content":{"rendered":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">In Sudan I was tired, tired to depths of my soul of the rape of our women, the rape of the land, the burning of the villages and the killing &#8211; the senseless brutal killing of my people by the Janjaweed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“And then there was the stealing of the young boys to be made into killers who would start the cycle all over again.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">“I needed to leave before my future was ended by this violence. Before it ate my soul.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">My name is Omer, and I am from Darfur in Sudan. I was only 8 or so when the war started so it’s really all I’ve ever known. We lived in a small village and were mainly farmers. We grew maize to eat but also to sell for money. It wasn’t our land it was like communal land we shared with other people. It was a simple life but it became really hard after the war started, we were always in danger from the Janaweed killers or people from other tribes wanting our land. The police don’t help &#8211; they just watch and even help the killers.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">So I left Darfur and moved to a new city. Then in 2013 when I was about 17 I moved to a city that is part of Khartoum. I found a charity there who helped people with food but the police chased us away. My hand got broken badly in the fight and I was caught. This was the first of so many times of being detained. They said the people giving donations were against the government and I was part of it too. Detention is horrible, they torture you and there is not enough food, ever. It is always crowded and there are no beds. This time my hand was really bad and one of the guards had noticed and wanted to help me. He sent me to the hospital and told me not to come back.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">I tried to get a job, but each time I was arrested as the police still thought I was linked to these people who opposed the government. They would not believe I had only gone there to get food. I was detained again and again. Each time you are beaten and tortured for information or just because they can. In 2021 I was detained one more time. But this time they said they would let me go on three conditions:-<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">1. I would discover information on my friends<\/div>\n<div dir=\"auto\">2. I would report in weekly<\/div>\n<div dir=\"auto\">3. I would never leave Sudan, if you do we will kill you.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">It was then I decided I had to leave Sudan. I found a smuggler who found me a passport of someone who looked just like me. Of course I was scared but the smuggler told me not to be. He said he would help me until I got on the plane and he did. The passport cost me $200, that was a lot for me.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">The plane landed in Turkiye, in Istanbul. I was with a group of people, I had no particular place to be going, just somewhere safe. Someone in the group mentioned the UK and it sounded like a good place to go. They said it was the safest country in the world and I like Manchester United so I thought I would go there.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But when I got off the plane, I was detained again, this time for 21 days. It was horrible, sometimes they would open the door and you would think you would get food but then they closed it again and you got nothing. After 21 days I was released without my passport and told to leave Turkiye. I met up with this group again and we started walking.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">We walked to Greece, crossing a small bit of water, then we walked into Albania and up into Serbia. All the way we were sleeping in parks. We would go there in the evening when people were going home. They always leave some food, stuff they don’t eat or want and survived on that. It was all I could do, I had no money. You just have to find a way to live- it is better than being killed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In Austria I was detained again but only for a day. They took my fingerprints and a photo but then we got on a train all the way to France. I was lucky we were not found and thrown off.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">In Calais it was really difficult, I was very hungry but I would rather starve than let the Janjaweed kill me. I saw Care4Calais, they were always trying to help us. I would do whatever it took to get to the UK now. I was in Calais 15 days. I suppose I was lucky that I got on a truck so quickly. You have to try every night, walking so far and running after the trucks to get in.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">When I got across I was arrested again by the Border Force but this time they respected us. us, we were given food and clothes and I was moved to near a big airport and now I am in Colnbrook detention cebtre They treat us well here. It is still a prison but not like any other country. You even get food every day. At first I felt really safe and happy to be here. I thought I would only be in detention until they did my papers and I was happy to wait.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">But on the second day they gave me a letter that mentioned Rwanda. I had a hard time translating it but when I understood I was drained. I started having flashbacks to the killings, the rapes and fires in Darfur. Rwanda is Africa, it is not far from Sudan and not so very different, there is always issues and problems in Africa. If I go to Rwanda I will be killed.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">On the third day Katherine from Care4Calais rang me. She said they would help me, I was so depressed but she made me feel safe and I felt a peace of mind. But I am struggling because it is not over. Some days I just feel so hopeless and I can’t eat. Some days I have horrible dreams of the screams in Darfur. I even think I have been hallucinating I am back there. It is too long to be in jail while we wait. This time I do not have a lawyer yet and although Katherine tells me I will get one I am very worried. Care4Calais are my lifeline I am so grateful to them for listening to me.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">Back home I have two brothers and three sisters and my mum and dad. I speak to them when I can, Care4Calais get me phone credit. But Sudan is a very dangerous country and I do not think they are safe. If the police threaten you and say they will kill you they mean it and it will happen so you have to leave. I had no choice but to leave them.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">There has been war in Darfur for as long as I can remember so I don’t remember anything good about Sudan. Ok the music, yes, I like Sudanese music but the thought of going back there terrifies me. The UK is safe, you can sleep and no one will run through your house with a machete and fire. You wake up safe. That is all I want.<\/div>\n<\/div>\n<div class=\"cxmmr5t8 oygrvhab hcukyx3x c1et5uql o9v6fnle ii04i59q\">\n<div dir=\"auto\">To help us oppose the brutal Rwanda plan go to <a class=\"oajrlxb2 g5ia77u1 qu0x051f esr5mh6w e9989ue4 r7d6kgcz rq0escxv nhd2j8a9 nc684nl6 p7hjln8o kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x jb3vyjys rz4wbd8a qt6c0cv9 a8nywdso i1ao9s8h esuyzwwr f1sip0of lzcic4wl gpro0wi8 py34i1dx\" tabindex=\"0\" role=\"link\" href=\"http:\/\/care4calais.org\/stop-rwanda?fbclid=IwAR0tgrwkZCmT6CoQt9HkpYmAOdMzytjtQXAnlN086ZBEuWmDyg1iOZ9i1QQ\" target=\"_blank\" rel=\"nofollow noopener\">Care4Calais.org\/stop-rwanda<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>In Sudan I was tired, tired to depths of my soul of the rape of our women, the rape of the land, the burning of the villages and the killing &#8211; the senseless brutal killing of my people by the Janjaweed. “And then there was the stealing of the young boys to be made into killers who would start the cycle all over again. “I needed to leave before my future was ended by this violence. Before it ate my soul. My name is Omer, and I am from Darfur in Sudan. I was only 8 or so when the war started so it’s really all I’ve ever known. We lived in a small village and were mainly farmers. We grew maize to eat but also to sell for money. It wasn’t our land it was like communal land we shared with other people. It was a simple life but it became really hard after the war started, we were always in danger from the Janaweed killers or people from other tribes wanting our land. The police don’t help &#8211; they just watch and even help the killers. So I left Darfur and moved to a new city. Then in 2013 when I was about 17 I moved to a city that is part of Khartoum. I found a charity there who helped people with food but the police chased us away. My hand got broken badly in the fight and I was caught. This was the first of so many times of being detained. They said the people giving donations were against the government and I was part of it too. Detention is horrible, they torture you and there is not enough food, ever. It is always crowded and there are no beds. This time my hand was really bad and one of the guards had noticed and wanted to help me. He sent me to the hospital and told me not to come back. I tried to get a job, but each time I was arrested as the police still thought I was linked to these people who opposed the government. They would not believe I had only gone there to get food. I was detained again and again. Each time you are beaten and tortured for information or just because they can. In 2021 I was detained one more time. But this time they said they would let me go on three conditions:- 1. I would discover information on my friends 2. I would report in weekly 3. I would never leave Sudan, if you do we will kill you. It was then I decided I had to leave Sudan. I found a smuggler who found me a passport of someone who looked just like me. Of course I was scared but the smuggler told me not to be. He said he would help me until I got on the plane and he did. The passport cost me $200, that was a lot for me. The plane landed in Turkiye, in Istanbul. I was with a group of people, I had no particular place to be going, just somewhere safe. Someone in the group mentioned the UK and it sounded like a good place to go. They said it was the safest country in the world and I like Manchester United so I thought I would go there. But when I got off the plane, I was detained again, this time for 21 days. It was horrible, sometimes they would open the door and you would think you would get food but then they closed it again and you got nothing. After 21 days I was released without my passport and told to leave Turkiye. I met up with this group again and we started walking. We walked to Greece, crossing a small bit of water, then we walked into Albania and up into Serbia. All the way we were sleeping in parks. We would go there in the evening when people were going home. They always leave some food, stuff they don’t eat or want and survived on that. It was all I could do, I had no money. You just have to find a way to live- it is better than being killed. In Austria I was detained again but only for a day. They took my fingerprints and a photo but then we got on a train all the way to France. I was lucky we were not found and thrown off. In Calais it was really difficult, I was very hungry but I would rather starve than let the Janjaweed kill me. I saw Care4Calais, they were always trying to help us. I would do whatever it took to get to the UK now. I was in Calais 15 days. I suppose I was lucky that I got on a truck so quickly. You have to try every night, walking so far and running after the trucks to get in. When I got across I was arrested again by the Border Force but this time they respected us. us, we were given food and clothes and I was moved to near a big airport and now I am in Colnbrook detention cebtre They treat us well here. It is still a prison but not like any other country. You even get food every day. At first I felt really safe and happy to be here. I thought I would only be in detention until they did my papers and I was happy to wait. But on the second day they gave me a letter that mentioned Rwanda. I had a hard time translating it but when I understood I was drained. I started having flashbacks to the killings, the rapes and fires in Darfur. Rwanda is Africa, it is not far from Sudan and not so very different, there is always issues and problems in Africa. If I go to Rwanda I will be killed. On the third day Katherine from Care4Calais [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":36805,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36804"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36804"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36804\/revisions"}],"predecessor-version":[{"id":36806,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36804\/revisions\/36806"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36805"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36804"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36804"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36804"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}