{"id":36810,"date":"2022-07-11T16:20:12","date_gmt":"2022-07-11T16:20:12","guid":{"rendered":"https:\/\/care4calais.org\/?p=36810"},"modified":"2022-10-17T15:57:21","modified_gmt":"2022-10-17T14:57:21","slug":"rwanda-case-adjourned","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/rwanda-case-adjourned\/","title":{"rendered":"Rwanda Case Adjourned"},"content":{"rendered":"<p>Breaking: Rwanda case adjourned<\/p>\n<p>Good news! We are pleased to report that the Divisional Court has granted our application for an adjournment of the Rwanda case until September.<\/p>\n<p>However the Government has refused to rule out flights in the interim, before the lawfulness of the policy is determined by the courts.<\/p>\n<p>We are currently working with more than 20 people who have been detained and issued with Rwanda notices since the last court case, and many of those from before remain detained, exhausted and alone, and terrified for what the future might bring. They have suffered some of the very worst things that can happen on this planet. They have appalling physical and mental scars, and now face the threat of further extreme trauma. Some have now been in detention more than six weeks and urgently need to be released.<\/p>\n<p>The Rwanda plan is brutal. Given the more humane and effective options available is this really what we as a compassionate country want to do?<\/p>\n<p>We have been overwhelmed by the public support we have received so far but it’s essential that we keep the pressure up. We still have only seven weeks until we will be in court to fight against this cruel plan. To see how you can help please go to <a href=\"http:\/\/care4calais.org\/stop-Rwanda\">care4calais.org\/stop-Rwanda<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Breaking: Rwanda case adjourned Good news! We are pleased to report that the Divisional Court has granted our application for an adjournment of the Rwanda case until September. However the Government has refused to rule out flights in the interim, before the lawfulness of the policy is determined by the courts. We are currently working with more than 20 people who have been detained and issued with Rwanda notices since the last court case, and many of those from before remain detained, exhausted and alone, and terrified for what the future might bring. They have suffered some of the very worst things that can happen on this planet. They have appalling physical and mental scars, and now face the threat of further extreme trauma. Some have now been in detention more than six weeks and urgently need to be released. The Rwanda plan is brutal. Given the more humane and effective options available is this really what we as a compassionate country want to do? We have been overwhelmed by the public support we have received so far but it’s essential that we keep the pressure up. We still have only seven weeks until we will be in court to fight against this cruel plan. To see how you can help please go to care4calais.org\/stop-Rwanda<\/p>\n","protected":false},"author":21,"featured_media":36811,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,172,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36810"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36810"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36810\/revisions"}],"predecessor-version":[{"id":38115,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36810\/revisions\/38115"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36811"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36810"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36810"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36810"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}