{"id":36854,"date":"2022-07-16T12:36:11","date_gmt":"2022-07-16T12:36:11","guid":{"rendered":"https:\/\/care4calais.org\/?p=36854"},"modified":"2023-02-08T16:44:56","modified_gmt":"2023-02-08T15:44:56","slug":"more-refugees-greeted-at-dungeness","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/more-refugees-greeted-at-dungeness\/","title":{"rendered":"More refugees greeted at Dungeness"},"content":{"rendered":"<p>Since the end of June we&#8217;ve welcomed 107 refugees who&#8217;ve come ashore in three boats at Dungeness on the Kent coast. Many of these people were from Kuwait, Syria, Libya, Egypt and Ethiopia. The first boat, which arrived at 4.45am on 29 June, had 40 people on board, including five women and five children aged 8-10; the second (10.50pm, 6 July) carried 22 men, and the last (8.15pm, 11 July) was carrying 45 people, including families with 14 kids in total, some of them did not look even a year old. It was incredibly moving to see such young children in these families, seeking safety on our shores.<\/p>\n<p>We gave out sliders, socks, joggers, oat bars, water, blankets, hats, hoodies, t-shirts, underwear, joggers, nappies for children, and hand wipes (people are often particularly grateful for the hand wipes after all the time at sea).<\/p>\n<p>The people on the second and third boats told us they had been at sea for 10 and 15 hours, and two of the men in the second were not well at all. One had a broken or dislocated big toe, and may have been suffering from hypothermia, and had to be supported as he made his way up the beach. The other also had to be supported to the waiting coach by two officers and was suffering from pain in his back and legs. Luckily we were able to give dry clothes to both men and a thick blanket and hypothermic foil blanket to the man that was shaking so much from the cold.<\/p>\n<p>When you see people suffering like this after their journey, it really brings home to you how much some people can go through on these journeys, and how much they have to risk are to reach safety. Having said that, it&#8217;s also striking how calm, polite and friendly people are when we meet them.<\/p>\n<p>It&#8217;s the bravery of these people that always amazes me &#8211; especially the children, and it really melted my heart to see such young children wrapped up in blankets with their big curious eyes peeking out at me and their sometimes shy\/sometimes big cheeky smiles! When we were welcoming people on the third boat, I noticed one little girl who had a pink hair tie decorated with plastic figures, and it reminded me of one I had when I was a little girl. &#8220;That&#8217;s nice,&#8221; I said, catching her eye, and she smiled back. When I turned back, there was another little girl getting off the boat with exactly the same tie. &#8220;You must be sisters!&#8221; I said, and she smiled back too; as I watched her join her sister, mum and dad on the beach and felt amazed at the bravery and togetherness of this young family. It must be such a terrifying decision to make this sort of crossing together, and to see their bravery and love for each other there on that stony beach was just an incredible, heart-melting sight.<\/p>\n<p>When refugees arrive like this my first reaction is always relief that they are safe and not still in danger at sea. They&#8217;re often so cold and exhausted it breaks your heart, and we&#8217;re always looking for ways to improve the help we give them. Dungeness beach is very long and stony, so we&#8217;ve learned the best thing is to fill our rucksacks with as much water, biscuits and hats as we can fit, so that we can immediately hand out as much as we can to them as we walk up the beach with them welcoming and chatting to them. We have also started carrying a few pairs of sliders with us so we can give them to people who may not have shoes to avoid them having to walk up the stoney beach barefoot. Then when they get to the top of the beach we can give them clothes and blankets etc. This all works really well &#8211; we&#8217;re learning as we go along.<\/p>\n<p>We&#8217;re raising funds to enable us to welcome and help refugees who arrive here cold, hungry and with nothing to their name. To make a donation to our welcoming work please go to [LINK]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since the end of June we&#8217;ve welcomed 107 refugees who&#8217;ve come ashore in three boats at Dungeness on the Kent coast. Many of these people were from Kuwait, Syria, Libya, Egypt and Ethiopia. The first boat, which arrived at 4.45am on 29 June, had 40 people on board, including five women and five children aged 8-10; the second (10.50pm, 6 July) carried 22 men, and the last (8.15pm, 11 July) was carrying 45 people, including families with 14 kids in total, some of them did not look even a year old. It was incredibly moving to see such young children in these families, seeking safety on our shores. We gave out sliders, socks, joggers, oat bars, water, blankets, hats, hoodies, t-shirts, underwear, joggers, nappies for children, and hand wipes (people are often particularly grateful for the hand wipes after all the time at sea). The people on the second and third boats told us they had been at sea for 10 and 15 hours, and two of the men in the second were not well at all. One had a broken or dislocated big toe, and may have been suffering from hypothermia, and had to be supported as he made his way up the beach. The other also had to be supported to the waiting coach by two officers and was suffering from pain in his back and legs. Luckily we were able to give dry clothes to both men and a thick blanket and hypothermic foil blanket to the man that was shaking so much from the cold. When you see people suffering like this after their journey, it really brings home to you how much some people can go through on these journeys, and how much they have to risk are to reach safety. Having said that, it&#8217;s also striking how calm, polite and friendly people are when we meet them. It&#8217;s the bravery of these people that always amazes me &#8211; especially the children, and it really melted my heart to see such young children wrapped up in blankets with their big curious eyes peeking out at me and their sometimes shy\/sometimes big cheeky smiles! When we were welcoming people on the third boat, I noticed one little girl who had a pink hair tie decorated with plastic figures, and it reminded me of one I had when I was a little girl. &#8220;That&#8217;s nice,&#8221; I said, catching her eye, and she smiled back. When I turned back, there was another little girl getting off the boat with exactly the same tie. &#8220;You must be sisters!&#8221; I said, and she smiled back too; as I watched her join her sister, mum and dad on the beach and felt amazed at the bravery and togetherness of this young family. It must be such a terrifying decision to make this sort of crossing together, and to see their bravery and love for each other there on that stony beach was just an incredible, heart-melting sight. When refugees arrive like this my first reaction is always relief that they are safe and not still in danger at sea. They&#8217;re often so cold and exhausted it breaks your heart, and we&#8217;re always looking for ways to improve the help we give them. Dungeness beach is very long and stony, so we&#8217;ve learned the best thing is to fill our rucksacks with as much water, biscuits and hats as we can fit, so that we can immediately hand out as much as we can to them as we walk up the beach with them welcoming and chatting to them. We have also started carrying a few pairs of sliders with us so we can give them to people who may not have shoes to avoid them having to walk up the stoney beach barefoot. Then when they get to the top of the beach we can give them clothes and blankets etc. This all works really well &#8211; we&#8217;re learning as we go along. We&#8217;re raising funds to enable us to welcome and help refugees who arrive here cold, hungry and with nothing to their name. To make a donation to our welcoming work please go to [LINK]<\/p>\n","protected":false},"author":21,"featured_media":36855,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36854"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=36854"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36854\/revisions"}],"predecessor-version":[{"id":36856,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/36854\/revisions\/36856"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/36855"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=36854"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=36854"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=36854"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}