{"id":37142,"date":"2022-08-06T15:21:34","date_gmt":"2022-08-06T14:21:34","guid":{"rendered":"https:\/\/care4calais.org\/?p=37142"},"modified":"2022-10-17T14:53:52","modified_gmt":"2022-10-17T13:53:52","slug":"the-terrifying-change-facing-refugees","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-terrifying-change-facing-refugees\/","title":{"rendered":"The terrifying change facing UK asylum seekers"},"content":{"rendered":"<p>Your emotions are always up and down when you work with refugees, but today I had a moment that was so bittersweet it set my head reeling.<\/p>\n<p>A young Sudanese refugee I&#8217;d been helping sent me a message that made my spirits soar. Having been through hell at home and on his journey, he&#8217;d been granted leave to remain for five years, and had finally accessed the medical treatment he had waited so long for.<\/p>\n<p>&#8220;First of all I want say thank you very much for standing with me in difficult time,&#8221; he wrote &#8220;I will never forget your help and I have good news, I get my documents and second thing I&#8217;m completely cured. All credit goes to the doctors and to you for your mighty stance I&#8217;m very grateful for you thanks 🥰<\/p>\n<p>&#8220;U make feel I have someone standing with me.&#8221;<\/p>\n<p>Wonderful news, of course. He can start to rebuild his life, and to study too. It’s all he ever talks about.<\/p>\n<p>He’s a really smart kid and he’s been through a lot. His father, uncle and brother were all part of the revolution against the dictator Omar Al-Bashir who has been charged with genocide and war crimes. They were all killed during the revolution and he was left alone at 16. He made his own long and dangerous journey to the UK having read about it in book, and with an untreated injury he sustained in Sudan. He’s quiet, smart and very brave too.<\/p>\n<p>But now the Nationality and Borders Bill is in force it hit me like a blow that from now on boys like him will arrive in our country, thinking they will finally be safe, only to face the ruthless new world of UK immigration policy.<\/p>\n<p>My young friend got leave to remain for five years because he arrived before the bill passed. The best those arriving now can hope for is temporary protection – meaning that they will never really feel safe, so they cannot heal and begin to build a new life. And what is asylum if it’s not safety?<\/p>\n<p>The Government have pulled a neat trick. They haven’t ‘changed the rules’. They are ending UK asylum for the vast majority of refugees. Our leaders have quietly brought about a truly momentous change.<\/p>\n<p>And people like my young friend &#8211; the only surviving family of men brave enough to stand up to a war criminal &#8211; will pay the price.<\/p>\n<p>For centuries, our approach to asylum was based on showing empathy for people who needed it, and respecting their human rights.<\/p>\n<p>In the new world, it seems, we will think only of ourselves. And we will not only be indifferent to other people&#8217;s suffering, we will exploit and intensify it in grotesque pantomimes of detainment and deportation &#8211; chiefly to appease the beliefs of a small number of people whose votes are being courted.<\/p>\n<p>It is a dark vision of the future, and we have to resist it. As I did today, we must remember more people have empathy and compassion than do not, and that this change can be resisted if we work together.<\/p>\n<p>We must do it for the sake of all the people like my friend Sudan.<\/p>\n<p>For all those who seek only safety and a little help as they remake their lives.<\/p>\n<p>For all those who need to feel they have someone standing with them in a difficult time 🥰<\/p>\n<p>To help go to <a href=\"http:\/\/care4calais.org\/stop-Rwanda\">care4calais.org\/stop-Rwanda<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your emotions are always up and down when you work with refugees, but today I had a moment that was so bittersweet it set my head reeling. A young Sudanese refugee I&#8217;d been helping sent me a message that made my spirits soar. Having been through hell at home and on his journey, he&#8217;d been granted leave to remain for five years, and had finally accessed the medical treatment he had waited so long for. &#8220;First of all I want say thank you very much for standing with me in difficult time,&#8221; he wrote &#8220;I will never forget your help and I have good news, I get my documents and second thing I&#8217;m completely cured. All credit goes to the doctors and to you for your mighty stance I&#8217;m very grateful for you thanks 🥰 &#8220;U make feel I have someone standing with me.&#8221; Wonderful news, of course. He can start to rebuild his life, and to study too. It’s all he ever talks about. He’s a really smart kid and he’s been through a lot. His father, uncle and brother were all part of the revolution against the dictator Omar Al-Bashir who has been charged with genocide and war crimes. They were all killed during the revolution and he was left alone at 16. He made his own long and dangerous journey to the UK having read about it in book, and with an untreated injury he sustained in Sudan. He’s quiet, smart and very brave too. But now the Nationality and Borders Bill is in force it hit me like a blow that from now on boys like him will arrive in our country, thinking they will finally be safe, only to face the ruthless new world of UK immigration policy. My young friend got leave to remain for five years because he arrived before the bill passed. The best those arriving now can hope for is temporary protection – meaning that they will never really feel safe, so they cannot heal and begin to build a new life. And what is asylum if it’s not safety? The Government have pulled a neat trick. They haven’t ‘changed the rules’. They are ending UK asylum for the vast majority of refugees. Our leaders have quietly brought about a truly momentous change. And people like my young friend &#8211; the only surviving family of men brave enough to stand up to a war criminal &#8211; will pay the price. For centuries, our approach to asylum was based on showing empathy for people who needed it, and respecting their human rights. In the new world, it seems, we will think only of ourselves. And we will not only be indifferent to other people&#8217;s suffering, we will exploit and intensify it in grotesque pantomimes of detainment and deportation &#8211; chiefly to appease the beliefs of a small number of people whose votes are being courted. It is a dark vision of the future, and we have to resist it. As I did today, we must remember more people have empathy and compassion than do not, and that this change can be resisted if we work together. We must do it for the sake of all the people like my friend Sudan. For all those who seek only safety and a little help as they remake their lives. For all those who need to feel they have someone standing with them in a difficult time 🥰 To help go to care4calais.org\/stop-Rwanda<\/p>\n","protected":false},"author":21,"featured_media":37143,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,187,212],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37142"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37142"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37142\/revisions"}],"predecessor-version":[{"id":38061,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37142\/revisions\/38061"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37143"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37142"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37142"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37142"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}