{"id":37172,"date":"2022-08-10T18:00:28","date_gmt":"2022-08-10T17:00:28","guid":{"rendered":"https:\/\/care4calais.org\/?p=37172"},"modified":"2022-08-10T18:00:28","modified_gmt":"2022-08-10T17:00:28","slug":"lem-lems-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/lem-lems-story\/","title":{"rendered":"Lem Lem&#8217;s story"},"content":{"rendered":"<p style=\"font-weight: 400;\">My name is Lem Lem, and I crossed from Calais to the UK with my little daughter Meloda. In Calais I was desperate and I found a smuggler to help me cross to England, but I daren’t tell him I had a little daughter.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">When I saw the boat on the night we were to travel, I was afraid. “No,” I said, “I can’t go on that. It is too dangerous for my child.” And then he told me he wouldn’t take my child anyway.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">“Leave her here,” he said. She was so small, not long able to walk. He grabbed me, and tried to force me into the boat, so I ran up the beach holding my daughter. He caught me, and tried to pull my daughter away, but I just held onto her.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">At last he pulled my daughter off me. And then he threw her in the boat.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">We came to Calais from Eritrea. I am an Orthodox Christian, and my religion is very important to me and my family, but we were not allowed to practise it at home. It’s very hard to get a job or good education, and you are persecuted for believing in it. People are killed for it; when I was three years old, they killed my father.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">My mum, who was a small trader selling clothes and fabrics in street markets, took us to Ethiopia, but then war broke out in Ethiopia and we went to Sudan, where there is a big Ethiopian community. For some years it worked. I stayed with some of my mum’s friends while she travelled for work, but then in 2014 she disappeared. I never saw her again; I think she’s still alive, but I’m not sure.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">By then I was getting older and the people I was living with decided I was old enough to go to South Sudan to work in a restaurant they owned. But after some time there were military clashes in that area, and I had to come back to Sudan. I didn’t really feel safe in Sudan as a single woman either, but then I met an Eritrean Christian boy.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">We became very close and were married. He said we had to leave Sudan, and he got us fake passports, and found someone to drive us to Turkey, with us hiding in a secret compartment in a car.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">In Turkey we spent eight months trying to get into Greece. One night, trying to cross the border, I became separated from my husband. I looked, but never found him again &#8211; maybe he was taken by the police, I don’t know.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">Then I found out I was pregnant.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">I had no choice but to keep going now, and in the end I reached Greece by a small boat, and from there I travelled up to Belgium. All along the way I met small groups of Eritreans who helped me with the next part of my journey. There is is a big network of Eritreans outside the country, as so many have left.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">In Belgium I gave birth to my beautiful daughter. I called her Meloda. I could not get help from anyone though, and still had to sleep outside with her. It was hard. All I could think of trying was to get on a lorry to the UK, but it was just too difficult to do that with a baby  so I moved to Calais to see if it was at least safer there.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">But it was worse there, because now the police destroyed my shelter every week. And it wasn’t a safe place to live. Time passed and it didn’t get any better. And then one night when I was cooking on the fire my daughter Meloda fell in the fire. It burned her so badly on her legs and body that she still has the scars.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">I had to leave, but where could I go? I didn’t know about the UK then, but everyone in Calais was going there so I thought it must be OK. Really it was the last chance to find safety.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">That’s why I found the smuggler and that’s how I ended up on the shore with my daughter being thrown into a boat.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">They pushed me into the boat too, and threatened me to make me stay there. It was a very small boat and we were only three people inside, and we were on the sea all night. It was so scary and cold, and I was crying all the way. Crying and praying; let my daughter survive, take me if you must.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">But in the end, the British saw the boat and we were rescued and taken to the UK.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">Since I claimed asylum I have lived in London, Wakefield and now Newcastle, where I met Elizabeth from Care4Calais. Elizabeth is wonderful. I love her so much. God gave her to me me; she is like the gift of a mother. The Care4Calais volunteers are like parents to us and so kind. I feel like I have found my mother when she is around, and I miss her when she cannot visit.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">Newcastle is nice, quite small with lots of parks for children, and there is a church I can go to that is very important for me. When I have time I like to draw, I paint on Fabric traditional designs it’s very relaxing for me.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">I have refugee status now, and I’m doing GCSE Maths and English, and will start my nursing qualification after this. One day I want to try to find my mother.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">Meloda is in school now and she loves it. She loves all her friends and teachers, and she never wants to miss a day! She doesn’t remember much about the journey.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">Our home is here now. I like it here and it was worth the risk, although I don’t think I’d do it again, but I am so sad for the refugees who might be told they have  to go to Rwanda. That is not right. It is not a safe place and it will harm their mental health. People are devastated to read this news, it’s very scary, because they know they will not be protected there. Really people just want to survive.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>My name is Lem Lem, and I crossed from Calais to the UK with my little daughter Meloda. In Calais I was desperate and I found a smuggler to help me cross to England, but I daren’t tell him I had a little daughter. When I saw the boat on the night we were to travel, I was afraid. “No,” I said, “I can’t go on that. It is too dangerous for my child.” And then he told me he wouldn’t take my child anyway. “Leave her here,” he said. She was so small, not long able to walk. He grabbed me, and tried to force me into the boat, so I ran up the beach holding my daughter. He caught me, and tried to pull my daughter away, but I just held onto her. At last he pulled my daughter off me. And then he threw her in the boat. We came to Calais from Eritrea. I am an Orthodox Christian, and my religion is very important to me and my family, but we were not allowed to practise it at home. It’s very hard to get a job or good education, and you are persecuted for believing in it. People are killed for it; when I was three years old, they killed my father. My mum, who was a small trader selling clothes and fabrics in street markets, took us to Ethiopia, but then war broke out in Ethiopia and we went to Sudan, where there is a big Ethiopian community. For some years it worked. I stayed with some of my mum’s friends while she travelled for work, but then in 2014 she disappeared. I never saw her again; I think she’s still alive, but I’m not sure. By then I was getting older and the people I was living with decided I was old enough to go to South Sudan to work in a restaurant they owned. But after some time there were military clashes in that area, and I had to come back to Sudan. I didn’t really feel safe in Sudan as a single woman either, but then I met an Eritrean Christian boy. We became very close and were married. He said we had to leave Sudan, and he got us fake passports, and found someone to drive us to Turkey, with us hiding in a secret compartment in a car. In Turkey we spent eight months trying to get into Greece. One night, trying to cross the border, I became separated from my husband. I looked, but never found him again &#8211; maybe he was taken by the police, I don’t know. Then I found out I was pregnant. I had no choice but to keep going now, and in the end I reached Greece by a small boat, and from there I travelled up to Belgium. All along the way I met small groups of Eritreans who helped me with the next part of my journey. There is is a big network of Eritreans outside the country, as so many have left. In Belgium I gave birth to my beautiful daughter. I called her Meloda. I could not get help from anyone though, and still had to sleep outside with her. It was hard. All I could think of trying was to get on a lorry to the UK, but it was just too difficult to do that with a baby  so I moved to Calais to see if it was at least safer there. But it was worse there, because now the police destroyed my shelter every week. And it wasn’t a safe place to live. Time passed and it didn’t get any better. And then one night when I was cooking on the fire my daughter Meloda fell in the fire. It burned her so badly on her legs and body that she still has the scars. I had to leave, but where could I go? I didn’t know about the UK then, but everyone in Calais was going there so I thought it must be OK. Really it was the last chance to find safety. That’s why I found the smuggler and that’s how I ended up on the shore with my daughter being thrown into a boat. They pushed me into the boat too, and threatened me to make me stay there. It was a very small boat and we were only three people inside, and we were on the sea all night. It was so scary and cold, and I was crying all the way. Crying and praying; let my daughter survive, take me if you must. But in the end, the British saw the boat and we were rescued and taken to the UK. Since I claimed asylum I have lived in London, Wakefield and now Newcastle, where I met Elizabeth from Care4Calais. Elizabeth is wonderful. I love her so much. God gave her to me me; she is like the gift of a mother. The Care4Calais volunteers are like parents to us and so kind. I feel like I have found my mother when she is around, and I miss her when she cannot visit. Newcastle is nice, quite small with lots of parks for children, and there is a church I can go to that is very important for me. When I have time I like to draw, I paint on Fabric traditional designs it’s very relaxing for me. I have refugee status now, and I’m doing GCSE Maths and English, and will start my nursing qualification after this. One day I want to try to find my mother. Meloda is in school now and she loves it. She loves all her friends and teachers, and she never wants to miss a day! She doesn’t remember much about the journey. Our home is here now. I like it here and it was worth the risk, although I don’t think I’d do it again, but I am so sad for the refugees who [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":37173,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37172"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37172"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37172\/revisions"}],"predecessor-version":[{"id":37174,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37172\/revisions\/37174"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37173"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37172"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37172"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37172"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}