{"id":37361,"date":"2022-08-20T09:02:47","date_gmt":"2022-08-20T08:02:47","guid":{"rendered":"https:\/\/care4calais.org\/?p=37361"},"modified":"2022-10-17T14:42:47","modified_gmt":"2022-10-17T13:42:47","slug":"rwanda-update","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/rwanda-update\/","title":{"rendered":"Rwanda Update"},"content":{"rendered":"<p>In just two weeks we will be back in court to challenge the lawfulness of the Government’s cruel Rwanda policy. To have any chance of stopping this, the time to act is now.<\/p>\n<p>We’ve recently learned that the Foreign Office warned Priti Patel that refugees should not be sent to Rwanda due to human rights concerns, including that they could be forced to join the country’s army and sent to fight in neighbouring states. Following this disclosure, the Government has been ordered by the court to deliver more documents next week that had previously been redacted. What else could they be hiding?<\/p>\n<p>This policy is brutal beyond words and, as we gear up to support another group of terrified refugees, the memories of the last attempted flight haunt us: suicide attempts, self harm, hunger strikes and distraught relatives. The thought of facing it again is weakening.<\/p>\n<p>We need your help to remind the public why this policy must be stopped. Here are some easy things you can do:<\/p>\n<p>1. Write to your local newspaper. This is a great way to raise awareness! We provide a template letter and can help you to get it sent =&gt; <a href=\"http:\/\/bit.ly\/RWDwrite\">bit.ly\/RWDwrite<\/a><\/p>\n<p>2. Campaign at home or at work. For lots of easy ideas =&gt; <a href=\"http:\/\/bit.ly\/RWDcmpn\">bit.ly\/RWDcmpn<\/a><\/p>\n<p>3. Go to a demo or join us at the Notting Hill Carnival =&gt; <a href=\"http:\/\/bit.ly\/RWDdemo\">bit.ly\/RWDdemo<\/a><\/p>\n<p>4. Support the campaign on social media =&gt; <a href=\"http:\/\/bit.ly\/RWDsocial\">bit.ly\/RWDsocial<\/a><\/p>\n<p>5. Please share this post!<\/p>\n<p>Thank you 🙏<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In just two weeks we will be back in court to challenge the lawfulness of the Government’s cruel Rwanda policy. To have any chance of stopping this, the time to act is now. We’ve recently learned that the Foreign Office warned Priti Patel that refugees should not be sent to Rwanda due to human rights concerns, including that they could be forced to join the country’s army and sent to fight in neighbouring states. Following this disclosure, the Government has been ordered by the court to deliver more documents next week that had previously been redacted. What else could they be hiding? This policy is brutal beyond words and, as we gear up to support another group of terrified refugees, the memories of the last attempted flight haunt us: suicide attempts, self harm, hunger strikes and distraught relatives. The thought of facing it again is weakening. We need your help to remind the public why this policy must be stopped. Here are some easy things you can do: 1. Write to your local newspaper. This is a great way to raise awareness! We provide a template letter and can help you to get it sent =&gt; bit.ly\/RWDwrite 2. Campaign at home or at work. For lots of easy ideas =&gt; bit.ly\/RWDcmpn 3. Go to a demo or join us at the Notting Hill Carnival =&gt; bit.ly\/RWDdemo 4. Support the campaign on social media =&gt; bit.ly\/RWDsocial 5. Please share this post! Thank you 🙏<\/p>\n","protected":false},"author":21,"featured_media":37362,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[104,70,184,187],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37361"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37361"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37361\/revisions"}],"predecessor-version":[{"id":38047,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37361\/revisions\/38047"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37362"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}