{"id":37395,"date":"2022-08-23T18:22:11","date_gmt":"2022-08-23T17:22:11","guid":{"rendered":"https:\/\/care4calais.org\/?p=37395"},"modified":"2023-02-08T16:41:46","modified_gmt":"2023-02-08T15:41:46","slug":"meet-the-refugees-remaking-a-garden-in-folkestone","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/meet-the-refugees-remaking-a-garden-in-folkestone\/","title":{"rendered":"Meet the refugees remaking a garden in Folkestone"},"content":{"rendered":"<p>This is the work of the fantastic gardening club that our volunteers run with asylum seekers who are housed in the notorious Napier Barracks in Folkestone. In the last few weeks these hardworking men have completely re-landscaped and planted up the garden of the local scout hut the group is based in – they&#8217;ve even installed fire pit, impressing the group leaders with the speed and quality of the work!<\/p>\n<p>It&#8217;s great to see people who are housed in such a harsh and stultifying environment like Napier find enjoyment and sense of purpose working with the earth and plants like this. One of the regulars was a farmer in Eritrea and says he finds it very relaxing to have some time away from the camp, using his skills to benefit the local community. When you&#8217;re not allowed to work, finding other meaningful activity can be so important for wellbeing.<\/p>\n<p>Despite a series of reports and rulings finding Napier unfit for this purpose, up to 330 men are still being accommodated here at any one time. It&#8217;s an unsuitable place for anyone to live, let alone people who have experienced horrors including war, detention, forced military service. Sometimes you can hear gunshots from nearby training facilities. There is no privacy, little comfort, not a lot to do to keep busy.<\/p>\n<p>One of the improvements since the camp opened is that people only stay for two to three months now which is good for the men&#8217;s mental health as they know they are at least moving through the system to dispersal accommodation. However, it does also mean that we have a high turnover of people needing shoes, clothes, jackets and so on, so we volunteers in Folkestone are always trying to fundraise to be able to provide something for everyone at our distributions week in, week out!<\/p>\n<p>We also try to create things to do to keep the men&#8217;s minds active, which is how our fantastic volunteer Julie started up the gardening club in our local scout hut. She runs an English club too, so that the guys can improve their language skills. Both clubs have made a big difference to refugees&#8217; lives as they pass through Napier.<\/p>\n<p>I am proud of the fact that many refugees I&#8217;ve met say they came to the UK because it has a reputation for being welcoming, fair and compassionate.<\/p>\n<p>However, when they arrive and are treated so badly in the asylum system, we can see their views of the UK change &#8211; as one of the guys told me about arriving at Napier, &#8220;of course we have experienced so much worse than this &#8211; we are refugees for a reason. But we didn&#8217;t expect this from the UK&#8221;.<\/p>\n<p>We hope that by providing these clubs, we&#8217;re helping to make up for that impression.<\/p>\n<p>L, volunteer<\/p>\n<p>To support our work at Napier Barracks, you can donate to our fundraiser:https:\/\/www.peoplesfundraising.com\/fundraising\/c4c-napier<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This is the work of the fantastic gardening club that our volunteers run with asylum seekers who are housed in the notorious Napier Barracks in Folkestone. In the last few weeks these hardworking men have completely re-landscaped and planted up the garden of the local scout hut the group is based in – they&#8217;ve even installed fire pit, impressing the group leaders with the speed and quality of the work! It&#8217;s great to see people who are housed in such a harsh and stultifying environment like Napier find enjoyment and sense of purpose working with the earth and plants like this. One of the regulars was a farmer in Eritrea and says he finds it very relaxing to have some time away from the camp, using his skills to benefit the local community. When you&#8217;re not allowed to work, finding other meaningful activity can be so important for wellbeing. Despite a series of reports and rulings finding Napier unfit for this purpose, up to 330 men are still being accommodated here at any one time. It&#8217;s an unsuitable place for anyone to live, let alone people who have experienced horrors including war, detention, forced military service. Sometimes you can hear gunshots from nearby training facilities. There is no privacy, little comfort, not a lot to do to keep busy. One of the improvements since the camp opened is that people only stay for two to three months now which is good for the men&#8217;s mental health as they know they are at least moving through the system to dispersal accommodation. However, it does also mean that we have a high turnover of people needing shoes, clothes, jackets and so on, so we volunteers in Folkestone are always trying to fundraise to be able to provide something for everyone at our distributions week in, week out! We also try to create things to do to keep the men&#8217;s minds active, which is how our fantastic volunteer Julie started up the gardening club in our local scout hut. She runs an English club too, so that the guys can improve their language skills. Both clubs have made a big difference to refugees&#8217; lives as they pass through Napier. I am proud of the fact that many refugees I&#8217;ve met say they came to the UK because it has a reputation for being welcoming, fair and compassionate. However, when they arrive and are treated so badly in the asylum system, we can see their views of the UK change &#8211; as one of the guys told me about arriving at Napier, &#8220;of course we have experienced so much worse than this &#8211; we are refugees for a reason. But we didn&#8217;t expect this from the UK&#8221;. We hope that by providing these clubs, we&#8217;re helping to make up for that impression. L, volunteer To support our work at Napier Barracks, you can donate to our fundraiser:https:\/\/www.peoplesfundraising.com\/fundraising\/c4c-napier<\/p>\n","protected":false},"author":21,"featured_media":37396,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[193,191,192,104],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37395"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37395"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37395\/revisions"}],"predecessor-version":[{"id":37397,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37395\/revisions\/37397"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37396"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37395"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37395"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37395"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}