{"id":37591,"date":"2022-09-02T19:57:34","date_gmt":"2022-09-02T18:57:34","guid":{"rendered":"https:\/\/care4calais.org\/?p=37591"},"modified":"2022-10-19T19:34:12","modified_gmt":"2022-10-19T18:34:12","slug":"nathaniels-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/nathaniels-story\/","title":{"rendered":"Nathaniel&#8217;s Story"},"content":{"rendered":"<div class=\"m8h3af8h l7ghb35v kjdc1dyq kmwttqpk gh25dzvf n3t5jt4f\">\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\"><\/div>\n<\/div>\n<div class=\"l7ghb35v kjdc1dyq kmwttqpk gh25dzvf jikcssrz n3t5jt4f\">\n<div dir=\"auto\">\n<p>Even now that I have made it to the UK and I feel safer, I have such difficult feelings and thoughts. I had to leave my mum and sister in Sudan and now they are suffering and I feel so guilty. My dad is dead and my uncle, who used to help my mum, was imprisoned when I got out of Sudan. I’m only 17 but I feel I should go back to help them – but if I did I think I would be killed. It makes me feel bad. I don’t like to think about it as I can’t control my thinking.<\/p>\n<p>My name is Nathaniel, I’m from Darfur in Sudan and I’m 17. In Darfur I went to junior school, but we were poor and my dad died when I was small, so I had to leave school and work to help with money at home. At first I worked on a farm near our village and then I was working in a small shop selling sweets and cigarettes, small things like that. It was just a small store like so many others in Sudan, but that’s where my problem started.<\/p>\n<p>The problem was it was near the university. Before the revolution it was good because there were so many students who wanted to buy things.One day about a year ago, the government militia came and told me to close it.<\/p>\n<p>They said I opposed the government and was causing trouble. I said I wasn’t at all, I was just trying to make some money, but they arrested me and locked me up in a prison. I was there for maybe a week. They tortured me by throwing scalding water on me, and using their cigarettes to burn my hands and arms. I had to sleep on the floor. After a week they made me sign a paper saying that I would not go to the doctor to treat my wounds, I would not leave Sudan, and I would to spy for them.<\/p>\n<p>After that they put me in a cattle truck, and drove it out into the desert and threw me out onto the road and left me there. I managed to stop a someone in a car, and they took me back to the city.<\/p>\n<p>I went to my uncle’s house, and he said I had to leave Sudan. He said once they had your name you would never be left alone, they would follow you and steal your things and never let you go. I didn’t know how to leave, but my uncle said he would find someone to get me out of the country.<\/p>\n<p>Soon I got instructions to get into another cattle truck. These are big trucks with open backs, and they can fit many people inside. My truck set off driving across the desert towards Libya. It took 13 days to reach the border, a long time because we had trouble getting past the gold digging areas. There was lots of fighting and conflict going on there, and it was very dangerous. We had to hide from the militia that controlled the gangs. Through all that time we had maybe two hours of sleep at night, and hardly any food or water.<\/p>\n<p>As soon as we got over the border I was arrested along with the other Sudanese people in the truck. They men who arrested us wanted money to let me go, but I had nothing and I knew I couldn’t get anything.<\/p>\n<p>They said, “You must pay, or you’re going to prison.” I had to choose prison, but when they took me thereI saw it wasn’t really a prison, just a house that they kept us in.<\/p>\n<p>After a while a man came to the house, I think to try to persuade them to let me go becuase I was only 16. He asked me how old I was, and I think he felt sorry for me. Anwyay, when they were all talking, I noticed the door behind them was unlocked behind them. Moving so they didn’t notice, I got to the door, opened it – and then I ran. I ran so fast, never looking back. I I don’t know if they chased me or not. I just ran looking for somewhere safe.<\/p>\n<p>I found a man who said he’d keep me safe, but then he said I had to work on his farm for free. I said I didn’t want to do that but he pulled a gun out and threatened me, so I had no choice. He would have shot me if I refused. You have to understand that our lives are worthless to people like them.<\/p>\n<p>On the farm I found other Sudanese people who worked for the man. Some of these Sudanese were smugglers, and I made a deal with one of them to get out. He told me get in a truck he was driving, and be quiet. He said if I made one noise I would be killed.<\/p>\n<p>It took two days to get across the sea to an Italian island called Lampedusa, in between Libya and Sicily. The Red Cross met us there and gave us some food. We were soon transferred to mainland Italy, where the police asked if I wanted to stay in Italy to give my biometrics, or go back to my country?<\/p>\n<p>I didn’t want to do either. I had no plan to go to the UK at that point, but there was no help in Italy, and I didn’t want to stay. I decided to move on, so I ran away again. They didn’t follow me, I don’t think they really cared.<\/p>\n<p>Then I had some real luck. I got into a lorry in Milan with some friends, and it went all the way to Calais without stopping! It took about two days, so wasn’t that bad although I was a bit cramped by the time I got out.<\/p>\n<p>Since we were in Calais I decided to try for the UK, but I wasn’t lucky again. I was in Calais for five months, and it’s not a nice place for refugees. It’s hard to find shelter and to cook but I found Care4Calais there and we were treated so kindly by them, especially by Jessica. They made sure we had food and some shelter at night, and they would come to check on us even if it was raining. They helped so much when the police stole all our things.<\/p>\n<p>I had no money for a boat so I had to try to get a lorry from Calais. You have to try every night, and sometimes walk a long, long way to find a lorry park. The police are everywhere. But finally I found my lorry.<\/p>\n<p>I arrived in the UK on May 31. When I got to the police station they did not believe my age, and said I was born in 2000. They put me in detention; I said I needed an appointment to see a doctor about my back and my mental health but I didn’t get any help.<\/p>\n<p>On my first day in the detention centre they gave me the letter to go to Rwanda. It was so shocking, in Africa there are no rights and no hope. One of the other Sudanese in the detention centre gave me the Care4Calais number to call. I gave all my details to Hannah and she got me a lawyer to prepare all my papers so I felt some hope. I was in detention a month and they let me out on July 1. I really hope I do not have to go back.<\/p>\n<p>I’m still worried about what will happen, if they will believe my age or if I will get another letter.<\/p>\n<p>I hope the government will listen to us, listen to what we have suffered. It is not an easy choice to leave your home, and it is very difficult to make the journey to Europe when you have no money.<\/p>\n<p>I try to think about how I could get a job here to help my family. I’m taking English lessons, but really need more help so that I can get a job. I think it’s my best hope.<\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Even now that I have made it to the UK and I feel safer, I have such difficult feelings and thoughts. I had to leave my mum and sister in Sudan and now they are suffering and I feel so guilty. My dad is dead and my uncle, who used to help my mum, was imprisoned when I got out of Sudan. I’m only 17 but I feel I should go back to help them – but if I did I think I would be killed. It makes me feel bad. I don’t like to think about it as I can’t control my thinking. My name is Nathaniel, I’m from Darfur in Sudan and I’m 17. In Darfur I went to junior school, but we were poor and my dad died when I was small, so I had to leave school and work to help with money at home. At first I worked on a farm near our village and then I was working in a small shop selling sweets and cigarettes, small things like that. It was just a small store like so many others in Sudan, but that’s where my problem started. The problem was it was near the university. Before the revolution it was good because there were so many students who wanted to buy things.One day about a year ago, the government militia came and told me to close it. They said I opposed the government and was causing trouble. I said I wasn’t at all, I was just trying to make some money, but they arrested me and locked me up in a prison. I was there for maybe a week. They tortured me by throwing scalding water on me, and using their cigarettes to burn my hands and arms. I had to sleep on the floor. After a week they made me sign a paper saying that I would not go to the doctor to treat my wounds, I would not leave Sudan, and I would to spy for them. After that they put me in a cattle truck, and drove it out into the desert and threw me out onto the road and left me there. I managed to stop a someone in a car, and they took me back to the city. I went to my uncle’s house, and he said I had to leave Sudan. He said once they had your name you would never be left alone, they would follow you and steal your things and never let you go. I didn’t know how to leave, but my uncle said he would find someone to get me out of the country. Soon I got instructions to get into another cattle truck. These are big trucks with open backs, and they can fit many people inside. My truck set off driving across the desert towards Libya. It took 13 days to reach the border, a long time because we had trouble getting past the gold digging areas. There was lots of fighting and conflict going on there, and it was very dangerous. We had to hide from the militia that controlled the gangs. Through all that time we had maybe two hours of sleep at night, and hardly any food or water. As soon as we got over the border I was arrested along with the other Sudanese people in the truck. They men who arrested us wanted money to let me go, but I had nothing and I knew I couldn’t get anything. They said, “You must pay, or you’re going to prison.” I had to choose prison, but when they took me thereI saw it wasn’t really a prison, just a house that they kept us in. After a while a man came to the house, I think to try to persuade them to let me go becuase I was only 16. He asked me how old I was, and I think he felt sorry for me. Anwyay, when they were all talking, I noticed the door behind them was unlocked behind them. Moving so they didn’t notice, I got to the door, opened it – and then I ran. I ran so fast, never looking back. I I don’t know if they chased me or not. I just ran looking for somewhere safe. I found a man who said he’d keep me safe, but then he said I had to work on his farm for free. I said I didn’t want to do that but he pulled a gun out and threatened me, so I had no choice. He would have shot me if I refused. You have to understand that our lives are worthless to people like them. On the farm I found other Sudanese people who worked for the man. Some of these Sudanese were smugglers, and I made a deal with one of them to get out. He told me get in a truck he was driving, and be quiet. He said if I made one noise I would be killed. It took two days to get across the sea to an Italian island called Lampedusa, in between Libya and Sicily. The Red Cross met us there and gave us some food. We were soon transferred to mainland Italy, where the police asked if I wanted to stay in Italy to give my biometrics, or go back to my country? I didn’t want to do either. I had no plan to go to the UK at that point, but there was no help in Italy, and I didn’t want to stay. I decided to move on, so I ran away again. They didn’t follow me, I don’t think they really cared. Then I had some real luck. I got into a lorry in Milan with some friends, and it went all the way to Calais without stopping! It took about two days, so wasn’t that bad although I was a bit cramped by the time I got out. Since we were in Calais I [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":37592,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37591"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37591"}],"version-history":[{"count":7,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37591\/revisions"}],"predecessor-version":[{"id":38275,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37591\/revisions\/38275"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37592"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37591"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37591"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37591"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}