{"id":37654,"date":"2022-09-04T17:33:00","date_gmt":"2022-09-04T16:33:00","guid":{"rendered":"https:\/\/care4calais.org\/?p=37654"},"modified":"2023-02-08T16:39:57","modified_gmt":"2023-02-08T15:39:57","slug":"meet-the-manchesters-amazing-afghan-dressmakers","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/meet-the-manchesters-amazing-afghan-dressmakers\/","title":{"rendered":"Meet the Manchester&#8217;s amazing Afghan dressmakers"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>A small group of us in Manchester have been running weekly creative and wellbeing sessions for refugees in the airport hotels here. We thought they’d be opportunities for the ladies and children to have a break, chat to different people and do some light crafts-type activities as a change from their normal routine.<\/p>\n<p>In fact, as the sessions have developed, they have become as much of a learning experience and treat for the volunteers as the refugees, because the Afghan ladies have utterly amazed us with their sewing and creative skills. The intricacy of their sewing and embroidery really is incredible, and we have watched in wonder as different generations have collaborated on spectacular dresses.<\/p>\n<p>Their kindness and generosity has touched us too. Last week, on learning that Karen, one of the volunteers, had a one-year-old granddaughter, they made the most amazing embroided panel and traditional Afghan dress for her. It was beautiful – you can see it in one of the pictures – and said so much about their talent and the friendship between us.<\/p>\n<p>You can see the sense of safety and fun growing in these ladies who have been through so much fear and hardship in the last year. The feelings of friendship, belonging, safety and trust that have developed among us have really warmed my heart.<\/p>\n<p>There are many other things we experience together, small and large. We volunteers were recently treated to Zafaran &#8211; a warm homemade saffron drink. And we were honoured recently to be able to accompany many women and children to the amazing garden at Bridgewater, Salford, run by the RRHS &#8211; Royal Horticultural Society on a trip kindly arranged by the amazing team at Manchester City Council and also the Walkden branch of RRotary International<\/p>\n<p>I would recommend volunteering for sessions like ours to anyone – we always need more people, so please get in touch!<\/p>\n<p>A, volunteer<\/p>\n<p>To volunteer or donate go to <a href=\"http:\/\/care4calais.org\/get-involved\">care4calais.org\/get-involved<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; A small group of us in Manchester have been running weekly creative and wellbeing sessions for refugees in the airport hotels here. We thought they’d be opportunities for the ladies and children to have a break, chat to different people and do some light crafts-type activities as a change from their normal routine. In fact, as the sessions have developed, they have become as much of a learning experience and treat for the volunteers as the refugees, because the Afghan ladies have utterly amazed us with their sewing and creative skills. The intricacy of their sewing and embroidery really is incredible, and we have watched in wonder as different generations have collaborated on spectacular dresses. Their kindness and generosity has touched us too. Last week, on learning that Karen, one of the volunteers, had a one-year-old granddaughter, they made the most amazing embroided panel and traditional Afghan dress for her. It was beautiful – you can see it in one of the pictures – and said so much about their talent and the friendship between us. You can see the sense of safety and fun growing in these ladies who have been through so much fear and hardship in the last year. The feelings of friendship, belonging, safety and trust that have developed among us have really warmed my heart. There are many other things we experience together, small and large. We volunteers were recently treated to Zafaran &#8211; a warm homemade saffron drink. And we were honoured recently to be able to accompany many women and children to the amazing garden at Bridgewater, Salford, run by the RRHS &#8211; Royal Horticultural Society on a trip kindly arranged by the amazing team at Manchester City Council and also the Walkden branch of RRotary International I would recommend volunteering for sessions like ours to anyone – we always need more people, so please get in touch! A, volunteer To volunteer or donate go to care4calais.org\/get-involved<\/p>\n","protected":false},"author":21,"featured_media":37655,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37654"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37654"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37654\/revisions"}],"predecessor-version":[{"id":38032,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37654\/revisions\/38032"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37655"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37654"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37654"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37654"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}