{"id":37840,"date":"2022-09-29T18:07:36","date_gmt":"2022-09-29T17:07:36","guid":{"rendered":"https:\/\/care4calais.org\/?p=37840"},"modified":"2023-02-08T16:39:09","modified_gmt":"2023-02-08T15:39:09","slug":"almost-1000-refugees-rescued-this-month","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/almost-1000-refugees-rescued-this-month\/","title":{"rendered":"Almost 1000 refugees rescued from the Channel this month"},"content":{"rendered":"<p>Early this morning we were out a food distribution in Calais when I noticed a group of Sudanese refugees looking very subdued and downcast. I was a bit worried about them, so decided to see if everything was ok.<\/p>\n<p>As I got closer, I realised that all their clothes were wet. Not just caught-in-the-rain wet, they looked as if they&#8217;d been completely soaked from head to foot. When I asked what had happened to them, they explained there had been &#8220;a problem with the boat&#8221; and made plunging signs with their hands. I understood; they had experienced something that has become all too common here in the last few weeks.<\/p>\n<p>They had decided to risk their lives crossing the Channel, but their boat had sunk just off the French shore and they had been rescued. As they own only the clothes they stand up in, they had had to get as dry as they could and then spend the day waiting for the damp to leave them &#8211; not easy in the autumn in Northern France.<\/p>\n<p>Some 970 refugees have been reported rescued in the seas off the French coast this month. It&#8217;s easy to see that as just a statistic, but that&#8217;s almost 1000 people who risked their lives trying to find safety, who must have been terrified as they waited for their rescuers, and then who had to live with the memories afterwards. It&#8217;s horrific.<\/p>\n<p>For us it means there are lots more people who are soaking wet at night needing dry clothing as a minimum – we make sure to look out for them to offer all the help we can. Of course that&#8217;s what we did for the men I met.<\/p>\n<p>This situation is chilling when you think that we&#8217;re approaching the first anniversary of the worst-ever loss of life by refugees trying to cross; as many readers will remember, in November last year, 29 people died horrifically when their dinghy sank. The horrific truth is that nothing significant has been done to prevent it happening again.<\/p>\n<p>This should be the real story when we talk about 30,000 refugees crossing the Channel; 30,000 lives being needlessly risked, and that risk increasing as the weather starts to worsen. It is the most important reason of all that we need to provide safe passage for refugees now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Early this morning we were out a food distribution in Calais when I noticed a group of Sudanese refugees looking very subdued and downcast. I was a bit worried about them, so decided to see if everything was ok. As I got closer, I realised that all their clothes were wet. Not just caught-in-the-rain wet, they looked as if they&#8217;d been completely soaked from head to foot. When I asked what had happened to them, they explained there had been &#8220;a problem with the boat&#8221; and made plunging signs with their hands. I understood; they had experienced something that has become all too common here in the last few weeks. They had decided to risk their lives crossing the Channel, but their boat had sunk just off the French shore and they had been rescued. As they own only the clothes they stand up in, they had had to get as dry as they could and then spend the day waiting for the damp to leave them &#8211; not easy in the autumn in Northern France. Some 970 refugees have been reported rescued in the seas off the French coast this month. It&#8217;s easy to see that as just a statistic, but that&#8217;s almost 1000 people who risked their lives trying to find safety, who must have been terrified as they waited for their rescuers, and then who had to live with the memories afterwards. It&#8217;s horrific. For us it means there are lots more people who are soaking wet at night needing dry clothing as a minimum – we make sure to look out for them to offer all the help we can. Of course that&#8217;s what we did for the men I met. This situation is chilling when you think that we&#8217;re approaching the first anniversary of the worst-ever loss of life by refugees trying to cross; as many readers will remember, in November last year, 29 people died horrifically when their dinghy sank. The horrific truth is that nothing significant has been done to prevent it happening again. This should be the real story when we talk about 30,000 refugees crossing the Channel; 30,000 lives being needlessly risked, and that risk increasing as the weather starts to worsen. It is the most important reason of all that we need to provide safe passage for refugees now.<\/p>\n","protected":false},"author":21,"featured_media":37841,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[22,74,156,70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37840"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37840"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37840\/revisions"}],"predecessor-version":[{"id":37844,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37840\/revisions\/37844"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37841"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37840"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37840"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37840"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}