{"id":37971,"date":"2022-10-13T19:46:07","date_gmt":"2022-10-13T18:46:07","guid":{"rendered":"https:\/\/care4calais.org\/?p=37971"},"modified":"2023-02-08T16:35:59","modified_gmt":"2023-02-08T15:35:59","slug":"outrage-as-home-office-tells-pregnant-refugee-shell-be-sent-to-rwanda","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/outrage-as-home-office-tells-pregnant-refugee-shell-be-sent-to-rwanda\/","title":{"rendered":"Home Office gives pregnant refugee Rwanda letter"},"content":{"rendered":"<p>Delina, a Eritrean refugee who fled to the UK, is 37 weeks pregnant.<\/p>\n<p>Despite this the UK Home Office is, shockingly, trying to force her onto a plane so they can deport her to Rwanda.<\/p>\n<p>The Home Office has previously said that it would not send pregnant women to Rwanda under its new scheme. However, we have seen paperwork that shows they knew Delina was pregnant, but still served her with a letter saying she would sent to Rwanda.<\/p>\n<p>This is an incredibly brutal example of the carelessness of the Rwanda plan, and the horrific human suffering that it causes.<\/p>\n<p>As the interview reveals, Delina&#8217;s story prior to reaching the UK is harrowing enough. When she was three her father was killed by the Eritrean government, and her mother took her to live first in Sudan, and then Lebanon. Her mother is now also dead, and she has no other family. She came to the UK already pregnant in July this year.<\/p>\n<p>When she made her claim for asylum Home Office staff knew she was pregnant, and organised her first scan. Later, they arranged for her to move to more comfortable rooms in her accommodation.<\/p>\n<p>And yet, even though she was by now noticeably pregnant, the Home Office then served her with notice saying she would be deported to Rwanda.<\/p>\n<p>Since then she has not slept, and her recent scans show her baby has stopped growing – probably because of Delina&#8217;s stress. The doctors current plan is to induce her in just under two weeks time.<\/p>\n<p>Seeking to deport someone so soon after giving birth seems shocking by any standards.<\/p>\n<p>“We have supported hundreds of refugees who have received Rwanda notices but this is the most egregious case yet,&#8221; our founder Clare Moseley says.<\/p>\n<p>“The Government knows this woman is pregnant but have still seen fit to issue a letter threatening forced deportation to Rwanda. This case demonstrates the lack of compassion, cruelty and brutality at the heart of the Government’s Rwanda policy.<\/p>\n<p>&#8220;Targeting a pregnant woman is disgusting.”<\/p>\n<p>Names have been changed.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Delina, a Eritrean refugee who fled to the UK, is 37 weeks pregnant. Despite this the UK Home Office is, shockingly, trying to force her onto a plane so they can deport her to Rwanda. The Home Office has previously said that it would not send pregnant women to Rwanda under its new scheme. However, we have seen paperwork that shows they knew Delina was pregnant, but still served her with a letter saying she would sent to Rwanda. This is an incredibly brutal example of the carelessness of the Rwanda plan, and the horrific human suffering that it causes. As the interview reveals, Delina&#8217;s story prior to reaching the UK is harrowing enough. When she was three her father was killed by the Eritrean government, and her mother took her to live first in Sudan, and then Lebanon. Her mother is now also dead, and she has no other family. She came to the UK already pregnant in July this year. When she made her claim for asylum Home Office staff knew she was pregnant, and organised her first scan. Later, they arranged for her to move to more comfortable rooms in her accommodation. And yet, even though she was by now noticeably pregnant, the Home Office then served her with notice saying she would be deported to Rwanda. Since then she has not slept, and her recent scans show her baby has stopped growing – probably because of Delina&#8217;s stress. The doctors current plan is to induce her in just under two weeks time. Seeking to deport someone so soon after giving birth seems shocking by any standards. “We have supported hundreds of refugees who have received Rwanda notices but this is the most egregious case yet,&#8221; our founder Clare Moseley says. “The Government knows this woman is pregnant but have still seen fit to issue a letter threatening forced deportation to Rwanda. This case demonstrates the lack of compassion, cruelty and brutality at the heart of the Government’s Rwanda policy. &#8220;Targeting a pregnant woman is disgusting.” Names have been changed. &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":37966,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[74,172,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37971"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=37971"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37971\/revisions"}],"predecessor-version":[{"id":38014,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/37971\/revisions\/38014"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/37966"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=37971"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=37971"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=37971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}