{"id":38455,"date":"2022-10-26T11:53:00","date_gmt":"2022-10-26T10:53:00","guid":{"rendered":"https:\/\/care4calais.org\/?p=38455"},"modified":"2023-02-08T16:35:19","modified_gmt":"2023-02-08T15:35:19","slug":"agrins-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/agrins-story\/","title":{"rendered":"Agrin&#8217;s Story"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">One night in 2018, the government of the Independent Kurdish Region (IKR) in Iraq firebombed my house. My family were inside at the time, but luckily they escaped. But something like this could happen again, even after we had fled to stay with a family member.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I kept my head down for eight months, but then I was summoned to trial, and I knew that I would be imprisoned or worse.  My wife begged me to run, to leave Iraq. I had never in my life imagined being in this position. But nowhere was safe. I had to do something.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">My name is Agrin. I am a 51-year-old Iraqi national from the IKR. I work as a senior lawyer and a journalist, and I&#8217;m married – my wife worked as a lawyer for Iraq&#8217;s Justice Department – and we have three children. Until 2018, we also had a beautiful family home.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In 2013 I became head partner of my law firm and began to take on controversial cases against Kurdish government – cases that involved senior politicians and even the President of Iraq. These cases were blocked and barred and I began to receive threats.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">By  2016 those threats had become serious, and it was clear to me that the judicial system itself was corrupt. My wife was forced to leave her job, and I had to close my offices. Some of my staff lawyers moved away for safety because of the threats and intimidation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I continued to work, but quietly. I also began to publish articles exposing corruption, always with documented evidence. I was arrested and imprisoned, but was released thanks to a campaign by political journalists. There remained a pending court case against me, but political journalism was now my passion and I continued to write and publish details of the corruption. There are YouTube videos of me on national television debates, giving evidence and proof of a number of fraudulent  cases as well as embezzlement by the government.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Of course this made me a great enemy of the IKR, which is why they firebombed my house.  After lying low for eight months I realised I&#8217;d have to flee, and thought of my brother who lives in London.  He is an engineer and a German national who has lived and worked in Europe for more than 22 years. I wanted to be with him.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a I’m a lawyer and a journalist I never in my life imagined that, one day I would have to catch a bus to Turkey, a boat across the Mediterranean and hide in the back of a lorry to reach safety. But that&#8217;s what I did. I arrived in December 2020 and I submitted every piece of evidence to the Home Office, proving who I am and why I had to leave.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I am still awaiting my HO Interview, and I have been living in a hotel all this time. I worry about my family, In particular my son who is coming of age and may become a target for the IKR government.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I love to help people, and  I pass my days volunteering with food banks, the Felix Project food charity in London, and a community kitchen.   It helps me stop worrying.  I&#8217;ve seen how the mental health of many asylum seekers can decline – even strong tenacious, enthusiastic people with lots to offer can lose their will to live. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I miss my own country, but it is impossible for me to return. They will take my life.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I do not expect the British Government to pay for my accommodation or living expenses – I&#8217;m fit and healthy, and I have means and an education. I don’t want benefits; on the contrary I have a lot I would like to offer this country. But I do need safety and to be allowed  to work.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To volunteer or donate go to<\/span><a href=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2FCare4Calais.org%2F&amp;h=AT1f6__Cy7EpdmOYdCwVDqPfYVlEPJa5QaVxI5tMa5UKr4PDk-vJf-dwmHrUzAoHPVgACv15Q9pVWLOwdgO_dKmESJBNFQtnud2ShDFJ9-WZaRUyiL_CCBTsZxuKhHK1HlSwWKCMMGMs9j3SvBfJ&amp;__tn__=-UK-R&amp;c[0]=AT2DQddR6iLktSmY2aTIMn3920V1aLQs3VKvSTItbdjztVqDcpChRJ6xCRP3et2ThEpVYAg2JSWuO_sDFR7MSHuhclByZpnIE2HkX9RTULn1yaPHdzhZ1YKJ9v_izi5CuUIdFDiJgXF03AZSkLlR5LlkmCZdziqeS-uP2mnC6gIRQ1qNgnFiAoD7F8jX2YJKivyOiN12SmyIJe0l5VP6c20biXqextyLb8YG\"> <span style=\"font-weight: 400;\">Care4Calais.org<\/span><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; One night in 2018, the government of the Independent Kurdish Region (IKR) in Iraq firebombed my house. My family were inside at the time, but luckily they escaped. But something like this could happen again, even after we had fled to stay with a family member. I kept my head down for eight months, but then I was summoned to trial, and I knew that I would be imprisoned or worse.  My wife begged me to run, to leave Iraq. I had never in my life imagined being in this position. But nowhere was safe. I had to do something. My name is Agrin. I am a 51-year-old Iraqi national from the IKR. I work as a senior lawyer and a journalist, and I&#8217;m married – my wife worked as a lawyer for Iraq&#8217;s Justice Department – and we have three children. Until 2018, we also had a beautiful family home. In 2013 I became head partner of my law firm and began to take on controversial cases against Kurdish government – cases that involved senior politicians and even the President of Iraq. These cases were blocked and barred and I began to receive threats. By  2016 those threats had become serious, and it was clear to me that the judicial system itself was corrupt. My wife was forced to leave her job, and I had to close my offices. Some of my staff lawyers moved away for safety because of the threats and intimidation.  I continued to work, but quietly. I also began to publish articles exposing corruption, always with documented evidence. I was arrested and imprisoned, but was released thanks to a campaign by political journalists. There remained a pending court case against me, but political journalism was now my passion and I continued to write and publish details of the corruption. There are YouTube videos of me on national television debates, giving evidence and proof of a number of fraudulent  cases as well as embezzlement by the government. Of course this made me a great enemy of the IKR, which is why they firebombed my house.  After lying low for eight months I realised I&#8217;d have to flee, and thought of my brother who lives in London.  He is an engineer and a German national who has lived and worked in Europe for more than 22 years. I wanted to be with him. As a I’m a lawyer and a journalist I never in my life imagined that, one day I would have to catch a bus to Turkey, a boat across the Mediterranean and hide in the back of a lorry to reach safety. But that&#8217;s what I did. I arrived in December 2020 and I submitted every piece of evidence to the Home Office, proving who I am and why I had to leave. I am still awaiting my HO Interview, and I have been living in a hotel all this time. I worry about my family, In particular my son who is coming of age and may become a target for the IKR government. I love to help people, and  I pass my days volunteering with food banks, the Felix Project food charity in London, and a community kitchen.   It helps me stop worrying.  I&#8217;ve seen how the mental health of many asylum seekers can decline – even strong tenacious, enthusiastic people with lots to offer can lose their will to live.  I miss my own country, but it is impossible for me to return. They will take my life. I do not expect the British Government to pay for my accommodation or living expenses – I&#8217;m fit and healthy, and I have means and an education. I don’t want benefits; on the contrary I have a lot I would like to offer this country. But I do need safety and to be allowed  to work. To volunteer or donate go to Care4Calais.org<\/p>\n","protected":false},"author":21,"featured_media":38456,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38455"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=38455"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38455\/revisions"}],"predecessor-version":[{"id":38457,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38455\/revisions\/38457"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/38456"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=38455"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=38455"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=38455"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}