{"id":38580,"date":"2022-11-12T12:55:21","date_gmt":"2022-11-12T11:55:21","guid":{"rendered":"https:\/\/care4calais.org\/?p=38580"},"modified":"2022-11-12T12:55:21","modified_gmt":"2022-11-12T11:55:21","slug":"never-forget-a-vigil-for-the-channel-drownings","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/never-forget-a-vigil-for-the-channel-drownings\/","title":{"rendered":"Never forget: A vigil for the Channel drownings"},"content":{"rendered":"<p>On 24 November last year, 32 men, women and children died in the English Channel when their flimsy boat sank in the freezing cold sea, and British and French authorities ignored their desperate calls for help..<\/p>\n<p>Those authorities face countless questions about what happened that fateful night, but a year on the victims’ families are still waiting for answers. They have been let down appallingly by the British and the French states, and at the very least they deserve explanations about what happened their loved ones.<\/p>\n<p>For the victims and their families, we demand justice, and we will never let the lives lost on 24 November 2021 be forgotten.<\/p>\n<p>Stand Up To Racism, Care4Calais and the TUC are organising a vigil to take place at 6pm on 24 November outside Westminster Abbey in London. We will say the names of those lost, and gather to condemn the hostile environment that allowed this tragedy to happen in the first place, and is now being intensified by Home Secretary Suella Braverman and the current government.<\/p>\n<p>Please join us there if you can.<\/p>\n<p>https:\/\/www.facebook.com\/events\/429947779349503\/?ref=newsfeed<\/p>\n","protected":false},"excerpt":{"rendered":"<p>On 24 November last year, 32 men, women and children died in the English Channel when their flimsy boat sank in the freezing cold sea, and British and French authorities ignored their desperate calls for help.. Those authorities face countless questions about what happened that fateful night, but a year on the victims’ families are still waiting for answers. They have been let down appallingly by the British and the French states, and at the very least they deserve explanations about what happened their loved ones. For the victims and their families, we demand justice, and we will never let the lives lost on 24 November 2021 be forgotten. Stand Up To Racism, Care4Calais and the TUC are organising a vigil to take place at 6pm on 24 November outside Westminster Abbey in London. We will say the names of those lost, and gather to condemn the hostile environment that allowed this tragedy to happen in the first place, and is now being intensified by Home Secretary Suella Braverman and the current government. Please join us there if you can. https:\/\/www.facebook.com\/events\/429947779349503\/?ref=newsfeed<\/p>\n","protected":false},"author":21,"featured_media":38581,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[22,155,239,240,104,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38580"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=38580"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38580\/revisions"}],"predecessor-version":[{"id":38582,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38580\/revisions\/38582"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/38581"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=38580"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=38580"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=38580"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}