{"id":38638,"date":"2022-11-15T10:40:29","date_gmt":"2022-11-15T09:40:29","guid":{"rendered":"https:\/\/care4calais.org\/?p=38638"},"modified":"2022-11-15T11:42:15","modified_gmt":"2022-11-15T10:42:15","slug":"call-log-from-channel-tragedy-released","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/call-log-from-channel-tragedy-released\/","title":{"rendered":"Call log from Channel tragedy released"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">In the seven years that I have worked with refugees in Calais I have heard many sad and shocking stories. Yesterday, however, I read something that chilled me to the marrow.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It was the record of the distress calls made to French and British rescue services by refugees in a boat in difficulty on the English Channel on the night of 24 November last year. Thirty two of the 34 passengers would drown, and the French authorities investigating the tragedy have now disclosed their record of the emergency calls made that night – a record showing British and French emergency services spent crucial hours passing responsibility for the rescue between themselves. What follows an edited version.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">24 November, 01.51: A man calls the French authorities to say he is one of 34 people in a small inflatable boat on the English Channel who need help.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">&#8220;Please please !… We need help, if you please.” he begs.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The operator tells the man she has received his location and she will send help.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">02:06: The French authorities call their English counterparts to discuss the man&#8217;s call. They say that the boat is French waters, 0.6 nautical miles from English territory.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">02.10–02.33: Several further calls are made by to the French and English authorities by people on the boat.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">02h33: French authorities tell a passenger from the boat to call 999 as they are in UK waters.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">02:45: Screams are heard in the background as a male passenger calls the French authorities to ask for assistance. The coastguard says the boat is in UK waters, and he should call 999.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Approx. 03.00 The boat overturns, tipping all passengers into the sea. Some begin to drown.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">03:31: A passenger calls the French authorities to tell them they are literally &#8220;in the water&#8221;. &#8220;Yes,&#8221; the coastguards replies, &#8220;but you are in English waters, sir.&#8221;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">03:44: A passenger calling for help is told by the French authorities that they are in English waters, and should call 999. The passenger says he cannot call them, and is told that &#8220;they have already been informed. They are on their way&#8221;. Eventually the call is cut off.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">04:08: The UK authorities call their French counterparts to inform them that they have received a distress call from a small boat, but have &#8220;found nothing at this location&#8221;. (Email exchanges between the French and British authorities indicate that the boat arrived in English waters at 02.30.)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">04:09: A passenger calling to ask for help is told that &#8220;we have to wait&#8221; and a lifeboat will &#8220;arrive in a few minutes&#8221;.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">04:34: The French authorities &#8220;close the operation&#8221; of the wrecked boat, assuming that the cessation of calls for help means there is no longer any distress, and British rescue services have intervened.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">14.00: A French fisherman spots the bodies of the passengers in the water, and raises the alarm. When the French coastguard arrives they find only two survivors. Twenty-seven bodies were recovered, including those of six women and a girl. Three bodies remain missing.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Many questions must be answered over the terrible failures and delays to send rescue.  On top of this authorities on both sides of the Channel have responded with scandalous callousness and apathy, leaving tortured families waiting a year after that terrible night for answers on how they could have been so badly let down.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In a sense, ALL refugees in France have been let down. The vast majority of people in Calais are genuine refugees who have simply to ask for help. They shouldn’t be risking their lives to claim asylum in the UK.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We must urgently know what lessons should be learned from this incident before more people die.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Let the final words be those of a brother of one of the victims, Zana Mamand Mohammad.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“My teenage brother… if you knew how we have passed this past year you would never have made that journey. Every day has been like a year. Our mother is destroyed as if she is not alive anymore. Our father is sallow and has aged in a way that you would never recognize him. Our sisters are constantly praying for your return, our brothers are just living with your memories. Where are you brother? Where did the waves take you? Please show yourself and take me out of this nightmare.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A vigil will be held to mark the anniversary of the tragedy at 6pm on 24 November outside Westminster Abbey in London. Please come if you can.<\/span><\/p>\n<p><a href=\"https:\/\/www.facebook.com\/events\/429947779349503\/?__cft__[0]=AZV8OSJT_gnDETRak-AOap_moy_EMjG25cAM06Y6dLlBpRwJq2Lhz8xtRzbNzUBd_TMAo8U_K9ltBfRwSuIRSRv53dLKf_OJFaWZULiyAR1nslkZNtsVAGW6rSYdfR8CEwnjWBqz0QzzJBB32rYpB7DgZPxs5clww8Jczu2H3ZWmgezzAtDWq8tmVcJx13IS0wPNLmZyp8HEbCfXNdQoXi_Z&amp;__tn__=-UK-R\"><span style=\"font-weight: 400;\">www.facebook.com\/events\/429947779349503\/<\/span><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; In the seven years that I have worked with refugees in Calais I have heard many sad and shocking stories. Yesterday, however, I read something that chilled me to the marrow. It was the record of the distress calls made to French and British rescue services by refugees in a boat in difficulty on the English Channel on the night of 24 November last year. Thirty two of the 34 passengers would drown, and the French authorities investigating the tragedy have now disclosed their record of the emergency calls made that night – a record showing British and French emergency services spent crucial hours passing responsibility for the rescue between themselves. What follows an edited version. 24 November, 01.51: A man calls the French authorities to say he is one of 34 people in a small inflatable boat on the English Channel who need help. &#8220;Please please !… We need help, if you please.” he begs. The operator tells the man she has received his location and she will send help. 02:06: The French authorities call their English counterparts to discuss the man&#8217;s call. They say that the boat is French waters, 0.6 nautical miles from English territory. 02.10–02.33: Several further calls are made by to the French and English authorities by people on the boat. 02h33: French authorities tell a passenger from the boat to call 999 as they are in UK waters. 02:45: Screams are heard in the background as a male passenger calls the French authorities to ask for assistance. The coastguard says the boat is in UK waters, and he should call 999. Approx. 03.00 The boat overturns, tipping all passengers into the sea. Some begin to drown. 03:31: A passenger calls the French authorities to tell them they are literally &#8220;in the water&#8221;. &#8220;Yes,&#8221; the coastguards replies, &#8220;but you are in English waters, sir.&#8221; 03:44: A passenger calling for help is told by the French authorities that they are in English waters, and should call 999. The passenger says he cannot call them, and is told that &#8220;they have already been informed. They are on their way&#8221;. Eventually the call is cut off. 04:08: The UK authorities call their French counterparts to inform them that they have received a distress call from a small boat, but have &#8220;found nothing at this location&#8221;. (Email exchanges between the French and British authorities indicate that the boat arrived in English waters at 02.30.) 04:09: A passenger calling to ask for help is told that &#8220;we have to wait&#8221; and a lifeboat will &#8220;arrive in a few minutes&#8221;. 04:34: The French authorities &#8220;close the operation&#8221; of the wrecked boat, assuming that the cessation of calls for help means there is no longer any distress, and British rescue services have intervened. 14.00: A French fisherman spots the bodies of the passengers in the water, and raises the alarm. When the French coastguard arrives they find only two survivors. Twenty-seven bodies were recovered, including those of six women and a girl. Three bodies remain missing. Many questions must be answered over the terrible failures and delays to send rescue.  On top of this authorities on both sides of the Channel have responded with scandalous callousness and apathy, leaving tortured families waiting a year after that terrible night for answers on how they could have been so badly let down. In a sense, ALL refugees in France have been let down. The vast majority of people in Calais are genuine refugees who have simply to ask for help. They shouldn’t be risking their lives to claim asylum in the UK. We must urgently know what lessons should be learned from this incident before more people die. Let the final words be those of a brother of one of the victims, Zana Mamand Mohammad. “My teenage brother… if you knew how we have passed this past year you would never have made that journey. Every day has been like a year. Our mother is destroyed as if she is not alive anymore. Our father is sallow and has aged in a way that you would never recognize him. Our sisters are constantly praying for your return, our brothers are just living with your memories. Where are you brother? Where did the waves take you? Please show yourself and take me out of this nightmare.” A vigil will be held to mark the anniversary of the tragedy at 6pm on 24 November outside Westminster Abbey in London. Please come if you can. www.facebook.com\/events\/429947779349503\/<\/p>\n","protected":false},"author":21,"featured_media":38639,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38638"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=38638"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38638\/revisions"}],"predecessor-version":[{"id":38640,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38638\/revisions\/38640"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/38639"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=38638"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=38638"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=38638"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}