{"id":38716,"date":"2022-11-20T12:49:27","date_gmt":"2022-11-20T11:49:27","guid":{"rendered":"https:\/\/care4calais.org\/?p=38716"},"modified":"2022-11-24T12:10:44","modified_gmt":"2022-11-24T11:10:44","slug":"vigil-for-the-channel-drownings-november-24","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/vigil-for-the-channel-drownings-november-24\/","title":{"rendered":"English Channel Tragedy: What Really Happened?"},"content":{"rendered":"<p>It wasn’t an accident or a mistake. Accidents and mistakes happen in minutes. Seconds even.<\/p>\n<p>It wasn’t an error of judgement, or a panic reaction either.<\/p>\n<p>It was a sustained period of consciously and deliberately ignoring desperate calls for help. A 12-hour period, beginning when the authorities were first notified of a boat in distress, and ending when rescue finally arrived. Twelve hours during which 32 lives were lost. Twelve hours of people ever so slowly freezing to death, giving up and letting go of the remains of a boat, and then slowly slipping under icy cold water.<\/p>\n<p>One by one, until only two were left alive.<\/p>\n<p>That&#8217;s the reality of what happened on 24 November last year, when 32 men, women and children died and their flimsy boat sank in the English Channel.<\/p>\n<p>If rescue had come at any point earlier, more of those 32 men, women and children might have been saved. How can the people who made those decisions have sat there all that time and done nothing? How?<\/p>\n<p>How can the British and French authorities have decided not to act even after communications had taken place between them? And how could they then have sat with that decision for hours, knowing what was happening out at sea.<\/p>\n<p>Make no mistake; it is now clear that they did know, and in some detail.<\/p>\n<p>This week, thanks to the release of a report that is part of the current French investigation we have seen the log of calls made by people on the boat to the French authorities. Reading them is stomach turning. Over pages of notes we see the harsh reality of the events unfold. One call lasts 14 minutes, another 17. People can be heard begging and screaming in the background.<\/p>\n<p>Crucially, we can see that 02:06am, a telephone conversation between the English and French coastguards indicated the position of the boat, which was then 0.6 nautical miles from English waters. Let it sink in: at just after two am both authorities learned the exact location of those in distress. They chose not to send rescue services until 12 hours later.<\/p>\n<p>At 02:33, a position is again sent by a passenger to the French authorities, who then reply to say to call 999 as they are in English waters. So we know that for a significant part of the time that the boat was sinking it was in British waters and that is likely where many people drowned.<\/p>\n<p>At 02:45, a passenger contacted the French authorities and asked for assistance. Screams could be heard in the background.<\/p>\n<p>Around 3am the boat overturned spilling all passengers into the water and some began to drown because of the waves. At 03:31, a passenger called the French authorities, explaining that they were now all literally in the water. The authorities replied &#8220;yes, but you are in English waters Sir&#8221;.<\/p>\n<p>At 04:16, a passenger contacted the French authorities and said that 40 people are in the water and that &#8220;it&#8217;s over&#8221;. He asks for a helicopter because they are dying.<\/p>\n<p>Email exchanges between the French and British authorities indicate that the boat arrived in English waters at 2.30am. The British coastguard said in another email that they had contacted a passenger and that a French dial tone had revealed that the boat was in French waters.<\/p>\n<p>At 04:34, the French authorities &#8220;closed the operation&#8221; of the wrecked boat, considering that there was no longer any distress given the cessation of calls for help and the probable intervention of the British rescue services.<\/p>\n<p>It is surely unimaginable that such things could have been said about the passengers in the boat if they had been British or French citizens. Would the authorities have ignored the pleas and screams had the voices of English or French children been among them? Let’s be honest: we know they wouldn&#8217;t.<\/p>\n<p>It is absolutely essential that the UK government order a full public enquiry to established what happened and why. That is why we vow never to let them be forgotten. We will do all we can keep their memories in the public consciousness until their families have the answers they deserve.<\/p>\n<p>This Thursday Stand Up To Racism, Care4Calais and the TUC are holding a vigil for the 32 lives that were lost on 24 November last year. Families of the victims will attend and it will take place at 6pm outside Westminster Abbey in London.<\/p>\n<p>We will say the names of those lost, and gather to condemn the hostile environment that allowed this tragedy to happen in the first place, and is now being intensified by Home Secretary Suella Braverman and the current government.<\/p>\n<p>Please come if you can.<\/p>\n<p><a href=\"http:\/\/www.facebook.com\/events\/429947779349503\/\">www.facebook.com\/events\/429947779349503\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>It wasn’t an accident or a mistake. Accidents and mistakes happen in minutes. Seconds even. It wasn’t an error of judgement, or a panic reaction either. It was a sustained period of consciously and deliberately ignoring desperate calls for help. A 12-hour period, beginning when the authorities were first notified of a boat in distress, and ending when rescue finally arrived. Twelve hours during which 32 lives were lost. Twelve hours of people ever so slowly freezing to death, giving up and letting go of the remains of a boat, and then slowly slipping under icy cold water. One by one, until only two were left alive. That&#8217;s the reality of what happened on 24 November last year, when 32 men, women and children died and their flimsy boat sank in the English Channel. If rescue had come at any point earlier, more of those 32 men, women and children might have been saved. How can the people who made those decisions have sat there all that time and done nothing? How? How can the British and French authorities have decided not to act even after communications had taken place between them? And how could they then have sat with that decision for hours, knowing what was happening out at sea. Make no mistake; it is now clear that they did know, and in some detail. This week, thanks to the release of a report that is part of the current French investigation we have seen the log of calls made by people on the boat to the French authorities. Reading them is stomach turning. Over pages of notes we see the harsh reality of the events unfold. One call lasts 14 minutes, another 17. People can be heard begging and screaming in the background. Crucially, we can see that 02:06am, a telephone conversation between the English and French coastguards indicated the position of the boat, which was then 0.6 nautical miles from English waters. Let it sink in: at just after two am both authorities learned the exact location of those in distress. They chose not to send rescue services until 12 hours later. At 02:33, a position is again sent by a passenger to the French authorities, who then reply to say to call 999 as they are in English waters. So we know that for a significant part of the time that the boat was sinking it was in British waters and that is likely where many people drowned. At 02:45, a passenger contacted the French authorities and asked for assistance. Screams could be heard in the background. Around 3am the boat overturned spilling all passengers into the water and some began to drown because of the waves. At 03:31, a passenger called the French authorities, explaining that they were now all literally in the water. The authorities replied &#8220;yes, but you are in English waters Sir&#8221;. At 04:16, a passenger contacted the French authorities and said that 40 people are in the water and that &#8220;it&#8217;s over&#8221;. He asks for a helicopter because they are dying. Email exchanges between the French and British authorities indicate that the boat arrived in English waters at 2.30am. The British coastguard said in another email that they had contacted a passenger and that a French dial tone had revealed that the boat was in French waters. At 04:34, the French authorities &#8220;closed the operation&#8221; of the wrecked boat, considering that there was no longer any distress given the cessation of calls for help and the probable intervention of the British rescue services. It is surely unimaginable that such things could have been said about the passengers in the boat if they had been British or French citizens. Would the authorities have ignored the pleas and screams had the voices of English or French children been among them? Let’s be honest: we know they wouldn&#8217;t. It is absolutely essential that the UK government order a full public enquiry to established what happened and why. That is why we vow never to let them be forgotten. We will do all we can keep their memories in the public consciousness until their families have the answers they deserve. This Thursday Stand Up To Racism, Care4Calais and the TUC are holding a vigil for the 32 lives that were lost on 24 November last year. Families of the victims will attend and it will take place at 6pm outside Westminster Abbey in London. We will say the names of those lost, and gather to condemn the hostile environment that allowed this tragedy to happen in the first place, and is now being intensified by Home Secretary Suella Braverman and the current government. Please come if you can. www.facebook.com\/events\/429947779349503\/<\/p>\n","protected":false},"author":21,"featured_media":38717,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38716"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=38716"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38716\/revisions"}],"predecessor-version":[{"id":38767,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38716\/revisions\/38767"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/38717"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=38716"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=38716"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=38716"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}