{"id":38790,"date":"2022-11-26T16:30:56","date_gmt":"2022-11-26T15:30:56","guid":{"rendered":"https:\/\/care4calais.org\/?p=38790"},"modified":"2023-02-08T16:20:14","modified_gmt":"2023-02-08T15:20:14","slug":"in-calais-refugees-help-volunteers-too","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/in-calais-refugees-help-volunteers-too\/","title":{"rendered":"In Calais, refugees help volunteers too"},"content":{"rendered":"<p style=\"font-weight: 400;\">We were out distributing snug packs in Calais today, and with the weather getting chillier people were really happy to get these warm gloves, hats and scarves.<\/p>\n<p style=\"font-weight: 400;\">Quite a few pulled them on straight away, and were asking what we thought of the colours. One guy with a football scarf was asking “What is Bradford City?” laughing and pretending he had to know before he could wear the scarf. Luckily we had some football fans who could put him straight, and he seemed happy!<\/p>\n<p style=\"font-weight: 400;\">Despite the chill there was a wonderful atmosphere, with music playing and stories being told, and I felt happy just seeing people smiling, joking and getting on as the afternoon went on.<\/p>\n<p style=\"font-weight: 400;\">And then at the end, a small thing happened that I don’t think I’ll ever forget. I was helping to pack our things away when I caught my thumb against something sharp, and cut it. It really hurt, and when I looked down I saw that there was rather a lot of blood.<\/p>\n<p style=\"font-weight: 400;\">I was still trying to wipe some blood away and wondering what to do when I saw one of the guys, I think his name was Omar, rushing over to me. He reached into his bumbag and took out a clean dressing. He must have kept it there as injuries are so common here when people are trying to hide in lorries. Such things are not always easily available to refugees, but nevertheless he calmly and quietly wiped my thumb, and then neatly dressed it.<\/p>\n<p style=\"font-weight: 400;\">Once it had stopped bleeding so much he bandaged it carefully and gently. I felt so well looked after that my thumb immediately felt much better.<\/p>\n<p style=\"font-weight: 400;\">This is someone who will have had an incredibly hard time even getting to Calais, and will be now sleeping in a makeshift tent, knowing that the police may come at any moment to destroy the camp and move them elsewhere. But he was still not only ready to help me, but also to give me something that was important to him.<\/p>\n<p style=\"font-weight: 400;\">I have so much respect for the people we meet here, who are so resilient and kind. It is so  far from the ridiculous stereotype of refugees as people who want to take things from us.  Any country should be begging them to come as they will be an asset to any society.<\/p>\n<p style=\"font-weight: 400;\">A, volunteer<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We were out distributing snug packs in Calais today, and with the weather getting chillier people were really happy to get these warm gloves, hats and scarves. Quite a few pulled them on straight away, and were asking what we thought of the colours. One guy with a football scarf was asking “What is Bradford City?” laughing and pretending he had to know before he could wear the scarf. Luckily we had some football fans who could put him straight, and he seemed happy! Despite the chill there was a wonderful atmosphere, with music playing and stories being told, and I felt happy just seeing people smiling, joking and getting on as the afternoon went on. And then at the end, a small thing happened that I don’t think I’ll ever forget. I was helping to pack our things away when I caught my thumb against something sharp, and cut it. It really hurt, and when I looked down I saw that there was rather a lot of blood. I was still trying to wipe some blood away and wondering what to do when I saw one of the guys, I think his name was Omar, rushing over to me. He reached into his bumbag and took out a clean dressing. He must have kept it there as injuries are so common here when people are trying to hide in lorries. Such things are not always easily available to refugees, but nevertheless he calmly and quietly wiped my thumb, and then neatly dressed it. Once it had stopped bleeding so much he bandaged it carefully and gently. I felt so well looked after that my thumb immediately felt much better. This is someone who will have had an incredibly hard time even getting to Calais, and will be now sleeping in a makeshift tent, knowing that the police may come at any moment to destroy the camp and move them elsewhere. But he was still not only ready to help me, but also to give me something that was important to him. I have so much respect for the people we meet here, who are so resilient and kind. It is so  far from the ridiculous stereotype of refugees as people who want to take things from us.  Any country should be begging them to come as they will be an asset to any society. A, volunteer<\/p>\n","protected":false},"author":21,"featured_media":38791,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[242,104,70,117],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38790"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=38790"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38790\/revisions"}],"predecessor-version":[{"id":39697,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38790\/revisions\/39697"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/38791"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=38790"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=38790"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=38790"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}