{"id":38895,"date":"2022-12-07T19:04:33","date_gmt":"2022-12-07T18:04:33","guid":{"rendered":"https:\/\/care4calais.org\/?p=38895"},"modified":"2022-12-07T19:04:33","modified_gmt":"2022-12-07T18:04:33","slug":"the-channel-dover-manston-one-refugees-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/the-channel-dover-manston-one-refugees-story\/","title":{"rendered":"The Channel, Dover, Manston: one refugee&#8217;s story"},"content":{"rendered":"<hr \/>\n<p>Today on a distribution, I met Jon, a refugee that I recognised. I was overjoyed to see him, because he&#8217;d been through something unbelievably frightening after he arrived in the UK. When I asked him how he was, he said &#8220;I am OK &#8211; now. After everything, you know.&#8221;<\/p>\n<p>That said everything.<\/p>\n<p>I only met Jon for a few minutes one October morning on a beach on the South Coast. Another volunteer and I were greeting some refugees as they arrived after a terrifying journey across the Channel. It&#8217;s something I do often, but this day would be different.<\/p>\n<p>Mostly from Afghanistan and Sudan, the men, women and children were exhausted, frightened and and disoriented. It didn&#8217;t help that it was raining, with the wind whipping in from the sea.<\/p>\n<p>Your heart hurts when you see people arriving in this state; the one positive thing is that now they&#8217;re at least relatively safe, and can ask for help. Well, that should be the case anyway.<\/p>\n<p>On this particular day, we two volunteers gave out water, blankets, biscuits, sliders and hats. I remember there was a little girl on the bus, and we gave her a furry hat shaped like a cat and a fidget spinner; a police officer told us she was wearing a coat that was too big for her because a member of the public had come to the beach and given it to her.<\/p>\n<p>I also remember the bus driver telling me not to give out biscuits because the crumbs would make a mess on the coach. We gave them out anyway!<\/p>\n<p>Finally the coach taking them to their processing centre set off, and I drove home. But soon after getting in, I saw the news: a man had thrown two petrol bombs at a refugee processing centre in Dover. I knew that the people I&#8217;d met earlier would have been taken there, so you can imagine the fear and horror I felt.<\/p>\n<p>Ever since that day I&#8217;ve not been able to get the faces of the people I met out of my head. It was just so horrible to think that after the problems they faced at home, and the terrifying journey across the sea, they would arrive in the supposedly safe UK and be caught in a bomb attack.<\/p>\n<p>I asked Jon how he had been. The attack had been frightening, he said. There had been a loud bang, then someone had told them to run, and then someone else had told them stay where they were. I can&#8217;t imagine how terrifying it would have been like to go through this so soon after that awful journey.<\/p>\n<p>But incredibly, things had got worse for him, because he and many others had been taken from the Dover centre to Manston, where the buildings were overcrowded, and people were sick. This seemed to have been worse for him than the bomb attack.<\/p>\n<p>He said it had been bad, and they should not have been there with so many people. With the sick people around him and no way of knowing what was going to happen, he must have worried that his journey could end there.<\/p>\n<p>&#8220;But that is over now,&#8221; he said, calmly. &#8220;I want to forget it. I just want to work and build my life.&#8221;<\/p>\n<p>My heart just melted at that.<\/p>\n<p>I said I couldn&#8217;t believe how well he had coped with it all. And then he said something I&#8217;ll never forget. &#8220;Thank you for your help that day when we came from the sea. It meant everything to me. I will keep it in my heart forever.&#8221;<\/p>\n<p>This is why what we do is so important; that little bit of kindness goes a long way, and it sustains people when things get dark for them. And with people as brave and resilient as this, it is an honour to help.<\/p>\n<p>To volunteer please contact annie@care4calais.org<\/p>\n<p>To donate to our Emergency Response Team, who welcome refugees arriving in the UK, go to https:\/\/bit.ly\/C4CERT<\/p>\n<p>Names and pictures have been changed<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today on a distribution, I met Jon, a refugee that I recognised. I was overjoyed to see him, because he&#8217;d been through something unbelievably frightening after he arrived in the UK. When I asked him how he was, he said &#8220;I am OK &#8211; now. After everything, you know.&#8221; That said everything. I only met Jon for a few minutes one October morning on a beach on the South Coast. Another volunteer and I were greeting some refugees as they arrived after a terrifying journey across the Channel. It&#8217;s something I do often, but this day would be different. Mostly from Afghanistan and Sudan, the men, women and children were exhausted, frightened and and disoriented. It didn&#8217;t help that it was raining, with the wind whipping in from the sea. Your heart hurts when you see people arriving in this state; the one positive thing is that now they&#8217;re at least relatively safe, and can ask for help. Well, that should be the case anyway. On this particular day, we two volunteers gave out water, blankets, biscuits, sliders and hats. I remember there was a little girl on the bus, and we gave her a furry hat shaped like a cat and a fidget spinner; a police officer told us she was wearing a coat that was too big for her because a member of the public had come to the beach and given it to her. I also remember the bus driver telling me not to give out biscuits because the crumbs would make a mess on the coach. We gave them out anyway! Finally the coach taking them to their processing centre set off, and I drove home. But soon after getting in, I saw the news: a man had thrown two petrol bombs at a refugee processing centre in Dover. I knew that the people I&#8217;d met earlier would have been taken there, so you can imagine the fear and horror I felt. Ever since that day I&#8217;ve not been able to get the faces of the people I met out of my head. It was just so horrible to think that after the problems they faced at home, and the terrifying journey across the sea, they would arrive in the supposedly safe UK and be caught in a bomb attack. I asked Jon how he had been. The attack had been frightening, he said. There had been a loud bang, then someone had told them to run, and then someone else had told them stay where they were. I can&#8217;t imagine how terrifying it would have been like to go through this so soon after that awful journey. But incredibly, things had got worse for him, because he and many others had been taken from the Dover centre to Manston, where the buildings were overcrowded, and people were sick. This seemed to have been worse for him than the bomb attack. He said it had been bad, and they should not have been there with so many people. With the sick people around him and no way of knowing what was going to happen, he must have worried that his journey could end there. &#8220;But that is over now,&#8221; he said, calmly. &#8220;I want to forget it. I just want to work and build my life.&#8221; My heart just melted at that. I said I couldn&#8217;t believe how well he had coped with it all. And then he said something I&#8217;ll never forget. &#8220;Thank you for your help that day when we came from the sea. It meant everything to me. I will keep it in my heart forever.&#8221; This is why what we do is so important; that little bit of kindness goes a long way, and it sustains people when things get dark for them. And with people as brave and resilient as this, it is an honour to help. To volunteer please contact annie@care4calais.org To donate to our Emergency Response Team, who welcome refugees arriving in the UK, go to https:\/\/bit.ly\/C4CERT Names and pictures have been changed &nbsp; &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":38896,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38895"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=38895"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38895\/revisions"}],"predecessor-version":[{"id":39240,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/38895\/revisions\/39240"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/38896"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=38895"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=38895"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=38895"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}