{"id":39126,"date":"2022-12-31T11:10:29","date_gmt":"2022-12-31T10:10:29","guid":{"rendered":"https:\/\/care4calais.org\/?p=39126"},"modified":"2023-01-03T11:18:00","modified_gmt":"2023-01-03T10:18:00","slug":"how-you-helped-refugees-in-2022","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/how-you-helped-refugees-in-2022\/","title":{"rendered":"How you helped refugees in 2022!"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xdj266r x126k92a\"><\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">\n<p><span style=\"font-weight: 400;\">This year it’s hard to believe how much good has been done for refugees by our volunteers and supporters in the UK and in northern France.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Together we&#8217;ve supported more than 15,000 refugees in 200 hotels in the UK, and many more that that who have passed through Calais throughout the year.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We&#8217;ve clothed and fed people. We have taught English, gone on theatre trips, played games, and simply drunk tea and chatted and listened. We&#8217;ve touched lives and helped to restore human dignity. We&#8217;ve helped families in times of crisis, we&#8217;ve supported refugees go to school and graduate college, and in our hotel groups friendships have been made that endure long after people move on with their lives.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Our volunteers continue to be outstanding in the face of overwhelming odds. Our supporters continue to stand up to bitter hostility from the Government, media and a small but vocal part of the public encouraged by politicians&#8217; rhetoric. All that means that despite the problems this year, we&#8217;ve been able to make a huge difference at important times.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At the start of the year  the Government said they would forcibly push back small refugee boats in the English Channel, but with @pcsunion we made a legal challenge and they backed down.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Together with our friends at<\/span><a href=\"https:\/\/www.facebook.com\/PcsUnion?__cft__[0]=AZU-NHf5-_ASJBhuI7sqFf6CIwLvVVPfcs3Rt88dgnLAo0dtGAfzewcsm2tTdpil-y5FyjJ99vv8-zKnzQ6YbchkbX6LwC3589e78patb_FI58tqU_giX_4F3W4sSv7wNp61pH6NZbwwzXFFPgh_jrjKOiNxF_n_CH-fPtcpHKd8rPanVet8c93n1QnYI1Il8Z85Bs-k_DgSZzbxq0E6zJA8&amp;__tn__=-]K-R\"> <span style=\"font-weight: 400;\">PCS Union<\/span><\/a><span style=\"font-weight: 400;\"> and<\/span><a href=\"https:\/\/www.facebook.com\/DetentionAction?__cft__[0]=AZU-NHf5-_ASJBhuI7sqFf6CIwLvVVPfcs3Rt88dgnLAo0dtGAfzewcsm2tTdpil-y5FyjJ99vv8-zKnzQ6YbchkbX6LwC3589e78patb_FI58tqU_giX_4F3W4sSv7wNp61pH6NZbwwzXFFPgh_jrjKOiNxF_n_CH-fPtcpHKd8rPanVet8c93n1QnYI1Il8Z85Bs-k_DgSZzbxq0E6zJA8&amp;__tn__=-]K-R\"> <span style=\"font-weight: 400;\">Detention Action<\/span><\/a><span style=\"font-weight: 400;\"> , we challenged the Government&#8217;s Rwanda policy in court. When Rwanda notices were issued to asylum seekers, our volunteers worked day and night to support 131 very scared refugees. On June 14, the Government tried to send a flight, one by one the tickets were cancelled and finally, after an intervention by the European Court of Human Rights, the flight was cancelled<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The backdrop to all this was the horrific dangers faced by those forced to cross the Channel in flimsy dinghies. Last year 32 people drowned in the channel in controversial, tragic circumstances, and we have supported the families of the victims, and worked hard to expose the truth about what happened that night.  In November, we remembered the victims at a vigil in London, and pleaded with the authorities to hold an enquiry so that such tragedies might be avoided in future. To underline the need, just over two weeks ago, eight more people died in another entirely unnecessary Channel incident.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For much of the year the mainstream news was filled by Ukrainian refugees fleeing the Russian invasion. Our volunteers helped countless Ukrainians as they began to arrive in France and then the UK, and initially faced severe problems caused by the UK Government&#8217;s inaction.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The treatment of Ukrainians has shown that it is possible to give refugees safe passage to the UK. That was the backdrop to the launch of our<\/span><a href=\"https:\/\/www.facebook.com\/hashtag\/safepassage?__eep__=6&amp;__cft__[0]=AZU-NHf5-_ASJBhuI7sqFf6CIwLvVVPfcs3Rt88dgnLAo0dtGAfzewcsm2tTdpil-y5FyjJ99vv8-zKnzQ6YbchkbX6LwC3589e78patb_FI58tqU_giX_4F3W4sSv7wNp61pH6NZbwwzXFFPgh_jrjKOiNxF_n_CH-fPtcpHKd8rPanVet8c93n1QnYI1Il8Z85Bs-k_DgSZzbxq0E6zJA8&amp;__tn__=*NK-R\"> <span style=\"font-weight: 400;\">#SafePassage<\/span><\/a><span style=\"font-weight: 400;\"> policy report with the PCS Union in the House of Lords in November. Cross-party MPs and peers came to the launch, and lent their support to a paper that clearly set out a humane alternative to the Rwanda Plan. Amid all the bile, rancour and tragedy of 2022, this report represents light and hope for a better, more compassionate approach to UK asylum.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">None of this would not have been possible with out the help of our supporters and volunteers; and so we thank you once again, look forward with optimism to 2023, and wish you and all refugees the happiest of New Years.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you share our vision for a kinder and more effective way to stop small boats crossing the Channel please read and share our safe passage report now at<\/span><a href=\"http:\/\/care4calais.org\/safepassage\"> <span style=\"font-weight: 400;\">care4calais.org\/safepassage<\/span><\/a><\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; This year it’s hard to believe how much good has been done for refugees by our volunteers and supporters in the UK and in northern France. Together we&#8217;ve supported more than 15,000 refugees in 200 hotels in the UK, and many more that that who have passed through Calais throughout the year. We&#8217;ve clothed and fed people. We have taught English, gone on theatre trips, played games, and simply drunk tea and chatted and listened. We&#8217;ve touched lives and helped to restore human dignity. We&#8217;ve helped families in times of crisis, we&#8217;ve supported refugees go to school and graduate college, and in our hotel groups friendships have been made that endure long after people move on with their lives. Our volunteers continue to be outstanding in the face of overwhelming odds. Our supporters continue to stand up to bitter hostility from the Government, media and a small but vocal part of the public encouraged by politicians&#8217; rhetoric. All that means that despite the problems this year, we&#8217;ve been able to make a huge difference at important times. At the start of the year  the Government said they would forcibly push back small refugee boats in the English Channel, but with @pcsunion we made a legal challenge and they backed down. Together with our friends at PCS Union and Detention Action , we challenged the Government&#8217;s Rwanda policy in court. When Rwanda notices were issued to asylum seekers, our volunteers worked day and night to support 131 very scared refugees. On June 14, the Government tried to send a flight, one by one the tickets were cancelled and finally, after an intervention by the European Court of Human Rights, the flight was cancelled The backdrop to all this was the horrific dangers faced by those forced to cross the Channel in flimsy dinghies. Last year 32 people drowned in the channel in controversial, tragic circumstances, and we have supported the families of the victims, and worked hard to expose the truth about what happened that night.  In November, we remembered the victims at a vigil in London, and pleaded with the authorities to hold an enquiry so that such tragedies might be avoided in future. To underline the need, just over two weeks ago, eight more people died in another entirely unnecessary Channel incident. For much of the year the mainstream news was filled by Ukrainian refugees fleeing the Russian invasion. Our volunteers helped countless Ukrainians as they began to arrive in France and then the UK, and initially faced severe problems caused by the UK Government&#8217;s inaction. The treatment of Ukrainians has shown that it is possible to give refugees safe passage to the UK. That was the backdrop to the launch of our #SafePassage policy report with the PCS Union in the House of Lords in November. Cross-party MPs and peers came to the launch, and lent their support to a paper that clearly set out a humane alternative to the Rwanda Plan. Amid all the bile, rancour and tragedy of 2022, this report represents light and hope for a better, more compassionate approach to UK asylum. None of this would not have been possible with out the help of our supporters and volunteers; and so we thank you once again, look forward with optimism to 2023, and wish you and all refugees the happiest of New Years. If you share our vision for a kinder and more effective way to stop small boats crossing the Channel please read and share our safe passage report now at care4calais.org\/safepassage<\/p>\n","protected":false},"author":21,"featured_media":39127,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39126"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=39126"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39126\/revisions"}],"predecessor-version":[{"id":39128,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39126\/revisions\/39128"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/39127"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=39126"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=39126"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=39126"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}