{"id":39421,"date":"2023-01-17T13:56:40","date_gmt":"2023-01-17T12:56:40","guid":{"rendered":"https:\/\/care4calais.org\/?p=39421"},"modified":"2023-01-19T13:58:54","modified_gmt":"2023-01-19T12:58:54","slug":"stoprwanda-court-update","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/stoprwanda-court-update\/","title":{"rendered":"#StopRwanda Court Update"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>Rwanda Court Update<\/p>\n<p>In December, the High Court ruled that the Governments Rwanda policy is lawful. Today we went back to court to ask permission to appeal that decision.<\/p>\n<p>We are pleased that permission to appeal has been granted to the individuals who are claimants in the case on a number of grounds and that the case will go forward. However we are disappointed that the court has not recognised our standing to represent the people we support and we will be discussing appealling this decision with our lawyers.<\/p>\n<p>We remain committed to ensuring that no person who has suffered the horrors of war, torture and human rights abuses will be forcibly deported to Rwanda, where their safety cannot be guaranteed.<\/p>\n<p>The people we work with in Calais come from countries such as Afghanistan, Iran, Syria and Sudan that have asylum acceptance rates that are as high as 82 &#8211; 98%. They are people who have escaped from the very worst things in this world and they urgently need our help.<\/p>\n<p>The Rwanda plan won&#8217;t end small boat crossings, it won’t stop people smugglers and it won’t keep refugees safe.<\/p>\n<p>There is a kinder and more effective way to achieve these ends; giving safe passage to refugees in Calais.<\/p>\n<p>Care4Calais.org\/safepassage<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Rwanda Court Update In December, the High Court ruled that the Governments Rwanda policy is lawful. Today we went back to court to ask permission to appeal that decision. We are pleased that permission to appeal has been granted to the individuals who are claimants in the case on a number of grounds and that the case will go forward. However we are disappointed that the court has not recognised our standing to represent the people we support and we will be discussing appealling this decision with our lawyers. We remain committed to ensuring that no person who has suffered the horrors of war, torture and human rights abuses will be forcibly deported to Rwanda, where their safety cannot be guaranteed. The people we work with in Calais come from countries such as Afghanistan, Iran, Syria and Sudan that have asylum acceptance rates that are as high as 82 &#8211; 98%. They are people who have escaped from the very worst things in this world and they urgently need our help. The Rwanda plan won&#8217;t end small boat crossings, it won’t stop people smugglers and it won’t keep refugees safe. There is a kinder and more effective way to achieve these ends; giving safe passage to refugees in Calais. Care4Calais.org\/safepassage<\/p>\n","protected":false},"author":21,"featured_media":39422,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39421"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=39421"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39421\/revisions"}],"predecessor-version":[{"id":39423,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39421\/revisions\/39423"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/39422"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=39421"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=39421"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=39421"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}