{"id":39712,"date":"2023-02-08T18:59:03","date_gmt":"2023-02-08T17:59:03","guid":{"rendered":"https:\/\/care4calais.org\/?p=39712"},"modified":"2023-02-08T18:59:03","modified_gmt":"2023-02-08T17:59:03","slug":"second-pregnant-refugee-threatened-with-rwanda","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/second-pregnant-refugee-threatened-with-rwanda\/","title":{"rendered":"Second pregnant refugee threatened with Rwanda"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Shockingly, the Home Office told a second pregnant refugee that she was at risk of deportation to Rwanda.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">The news came just three months after the Home Office caused a scandal by serving a similar  notice of intent to a pregnant rape victim. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Our intervention helped to persuade the Home Office to withdraw the notice, but it is deeply troubling that they made this egregious error in the first place. After receiving the Rwanda letter, the mother-to-be was hospitalised with what she described as ‘stress induced’ symptoms; it was an unimaginably painful conclusion to a journey beset with persecution and suffering.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Her name is Faven, and she is only 20 years old. In her home country she grew up under the cloud of religious persecution. Because of her faith, her mother was put in prison when Faven was in her late teens, and died there last year. ‘It broke my heart when she died,’ she says. ‘It still breaks my heart.’ <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Faven had heard the national security forces were looking for her, and she knew it meant they would arrest her, and put her in prison. ‘Whenever they find out you are Protestant they put you in prison. There is no justice. No hope.’<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Desperate to escape, she and some friends from her religious group fled to Ethiopia. Once there though, she fell into the hands of traffickers. They told her they would take her to the UK, and as she had heard the UK was safe, she believed she would be alright. However, the journey was terrifying, and she went for days on end with neither food nor basic shelter; at times she was left out on the streets.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">She had hoped her life would be safe and normal once she arrived in the UK and claimed asylum, but in fact, she found herself in a hotel in the middle of nowhere, almost entirely full of men, with no money or support.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">After finding out she was pregnant, the UK Home Office moved her to a more suitable accommodation – but then, shockingly, in early January they sent her a letter about deporting her to Rwanda.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">After receiving the news, Faven began to experience severe headaches, believed to be connected to the stress of the Rwanda threat. It was this that saw her admitted to hospital.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">‘They would be better taking my dead body to the place which I ran away from,’ she told us from her hospital bed. ‘It&#8217;s better for me to kill myself rather than go to Rwanda. It&#8217;s no different to my home country. I don&#8217;t know what&#8217;s going to happen to my baby because of my stress, and who is responsible for that?’<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">The threat of forced deportation to Rwanda inflicts so much stress on the refugees we work with. In this case we were able to help. ‘Thank you! You people are so kind. God bless you,’ she wrote. But there are still so many living with this threat, and no refugee who has fled war, torture and human rights abuses should be subjected to this level of cruelty and brutality – least of all a vulnerable, pregnant woman.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">To support our work with people like Faven, please go to care4calais.org\/donate<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Shockingly, the Home Office told a second pregnant refugee that she was at risk of deportation to Rwanda. &nbsp; The news came just three months after the Home Office caused a scandal by serving a similar  notice of intent to a pregnant rape victim.  &nbsp; Our intervention helped to persuade the Home Office to withdraw the notice, but it is deeply troubling that they made this egregious error in the first place. After receiving the Rwanda letter, the mother-to-be was hospitalised with what she described as ‘stress induced’ symptoms; it was an unimaginably painful conclusion to a journey beset with persecution and suffering. &nbsp; Her name is Faven, and she is only 20 years old. In her home country she grew up under the cloud of religious persecution. Because of her faith, her mother was put in prison when Faven was in her late teens, and died there last year. ‘It broke my heart when she died,’ she says. ‘It still breaks my heart.’  &nbsp; Faven had heard the national security forces were looking for her, and she knew it meant they would arrest her, and put her in prison. ‘Whenever they find out you are Protestant they put you in prison. There is no justice. No hope.’ &nbsp; Desperate to escape, she and some friends from her religious group fled to Ethiopia. Once there though, she fell into the hands of traffickers. They told her they would take her to the UK, and as she had heard the UK was safe, she believed she would be alright. However, the journey was terrifying, and she went for days on end with neither food nor basic shelter; at times she was left out on the streets. &nbsp; She had hoped her life would be safe and normal once she arrived in the UK and claimed asylum, but in fact, she found herself in a hotel in the middle of nowhere, almost entirely full of men, with no money or support. &nbsp; After finding out she was pregnant, the UK Home Office moved her to a more suitable accommodation – but then, shockingly, in early January they sent her a letter about deporting her to Rwanda. &nbsp; After receiving the news, Faven began to experience severe headaches, believed to be connected to the stress of the Rwanda threat. It was this that saw her admitted to hospital. &nbsp; ‘They would be better taking my dead body to the place which I ran away from,’ she told us from her hospital bed. ‘It&#8217;s better for me to kill myself rather than go to Rwanda. It&#8217;s no different to my home country. I don&#8217;t know what&#8217;s going to happen to my baby because of my stress, and who is responsible for that?’ &nbsp; The threat of forced deportation to Rwanda inflicts so much stress on the refugees we work with. In this case we were able to help. ‘Thank you! You people are so kind. God bless you,’ she wrote. But there are still so many living with this threat, and no refugee who has fled war, torture and human rights abuses should be subjected to this level of cruelty and brutality – least of all a vulnerable, pregnant woman. &nbsp; To support our work with people like Faven, please go to care4calais.org\/donate<\/p>\n","protected":false},"author":21,"featured_media":39713,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39712"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=39712"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39712\/revisions"}],"predecessor-version":[{"id":39714,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39712\/revisions\/39714"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/39713"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=39712"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=39712"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=39712"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}