{"id":39801,"date":"2023-02-12T15:54:45","date_gmt":"2023-02-12T14:54:45","guid":{"rendered":"https:\/\/care4calais.org\/?p=39801"},"modified":"2023-02-12T15:54:45","modified_gmt":"2023-02-12T14:54:45","slug":"knowsley-hotel-update","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/knowsley-hotel-update\/","title":{"rendered":"Knowsley hotel update"},"content":{"rendered":"<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xdj266r x126k92a\">\n<div dir=\"auto\">Yesterday we went back to the hotel to visit the asylum seekers and see if they were okay. The mood was muted. People were naturally disturbed. The most common things we heard were “We just want to be safe” “we haven&#8217;t done anything wrong” and “Please, can you help us move to another town?”<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">The saddest thing I heard was a man from Afganistan who said “I wasn&#8217;t safe in my country and I&#8217;m not safe here.”<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">We didn&#8217;t have much time but we took what we could to cheer them up. Boxes of fresh fruit, chocolate, lots of cakes, cans of coke and lemonade. Just small things, but they were so happy to see them. It was the gesture that mattered. The fact that some people had come to tell them that we cared. There were many smiles and handshakes.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">But underlying it all they are trapped in that hotel. They can&#8217;t leave. They can&#8217;t go to the shop to buy a snack or cigarettes. So many told us they can&#8217;t sleep.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">The situation is overwhelmingly sad. Every person in that hotel has had to leave their homes and their loved ones behind because of situations that they cannot control and did not ask for. No one does that by choice.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">We met people from Afghanistan, Iran, Syria, Sudan, Iraq &#8211; these are some of the most dangerous places in the world. Their homes have been bombed, villages ransacked. Their children have been persecuted. Some have been horribly tortured.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">They came here to ask for our help, believing the UK to be a place of sanctuary. And they have been met with hostility and fear.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">We do not know the actions of one person that have offended the local community. That is for the police to determine. But we do know that the actions of one should not lead to the judgement of many. There are people who have committed crimes in nearby Walton prison but no one says the whole population of Liverpool are criminals; far from it, scousers are known for their strong community and good humour. In exactly the same way these 200 asylum seekers should not be judged by the actions of one man. They are simply people.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">If you not believe that asylum seekers should not be housed in a hotel then write to our government and ask them to process their asylum claims. They should be allowed to work get on with their lives and provide for themselves. There is not a single person in that hotel who either asked to be or wants to be there.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">We sat and chatted to them for around two hours. Overwhelmingly they were calm and gentle. Given all that they have been through and suffered in their home countries they are fatalistic and forgiving. They understood the position of the local community and all they wanted was reconciliation. And to finally feel safe.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">It felt our honour and our privilege to meet these people who have suffered so much. I wish the local people who were at the demonstration could likewise sit and talk to them and understand that these are just human beings who also have problems. Nothing more. And the only way that we will find safety and happiness in our own futures is to understand that people, no matter where they are from, are just like us. They care for their families. They worry about the future. They want the world to be a better place for everyone.<\/div>\n<\/div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">We are raising money to take basic supplies to those in the hotel as many are newly arrived with just the clothes on their backs and don’t have fresh underwear, proper shoes or warm coats. You can contribute at <a class=\"x1i10hfl xjbqb8w x6umtig x1b1mbwd xaqea5y xav7gou x9f619 x1ypdohk xt0psk2 xe8uvvx xdj266r x11i5rnm xat24cr x1mh8g0r xexx8yu x4uap5 x18d9i69 xkhd6sd x16tdsg8 x1hl2dhg xggy1nq x1a2a7pz xt0b8zv x1fey0fg\" tabindex=\"0\" role=\"link\" href=\"https:\/\/care4calais.enthuse.com\/cf\/3d0b\/knowsley?fbclid=IwAR0qKAf-o4sNRmh5R6zadip-qK-mKuLiwm9gc49aRgJnmfviWfR0lrk4fI8#!\/I\" target=\"_blank\" rel=\"nofollow noopener\">care4calais.enthuse.com\/cf\/3d0b\/knowsley#!\/I<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday we went back to the hotel to visit the asylum seekers and see if they were okay. The mood was muted. People were naturally disturbed. The most common things we heard were “We just want to be safe” “we haven&#8217;t done anything wrong” and “Please, can you help us move to another town?” The saddest thing I heard was a man from Afganistan who said “I wasn&#8217;t safe in my country and I&#8217;m not safe here.” We didn&#8217;t have much time but we took what we could to cheer them up. Boxes of fresh fruit, chocolate, lots of cakes, cans of coke and lemonade. Just small things, but they were so happy to see them. It was the gesture that mattered. The fact that some people had come to tell them that we cared. There were many smiles and handshakes. But underlying it all they are trapped in that hotel. They can&#8217;t leave. They can&#8217;t go to the shop to buy a snack or cigarettes. So many told us they can&#8217;t sleep. The situation is overwhelmingly sad. Every person in that hotel has had to leave their homes and their loved ones behind because of situations that they cannot control and did not ask for. No one does that by choice. We met people from Afghanistan, Iran, Syria, Sudan, Iraq &#8211; these are some of the most dangerous places in the world. Their homes have been bombed, villages ransacked. Their children have been persecuted. Some have been horribly tortured. They came here to ask for our help, believing the UK to be a place of sanctuary. And they have been met with hostility and fear. We do not know the actions of one person that have offended the local community. That is for the police to determine. But we do know that the actions of one should not lead to the judgement of many. There are people who have committed crimes in nearby Walton prison but no one says the whole population of Liverpool are criminals; far from it, scousers are known for their strong community and good humour. In exactly the same way these 200 asylum seekers should not be judged by the actions of one man. They are simply people. If you not believe that asylum seekers should not be housed in a hotel then write to our government and ask them to process their asylum claims. They should be allowed to work get on with their lives and provide for themselves. There is not a single person in that hotel who either asked to be or wants to be there. We sat and chatted to them for around two hours. Overwhelmingly they were calm and gentle. Given all that they have been through and suffered in their home countries they are fatalistic and forgiving. They understood the position of the local community and all they wanted was reconciliation. And to finally feel safe. It felt our honour and our privilege to meet these people who have suffered so much. I wish the local people who were at the demonstration could likewise sit and talk to them and understand that these are just human beings who also have problems. Nothing more. And the only way that we will find safety and happiness in our own futures is to understand that people, no matter where they are from, are just like us. They care for their families. They worry about the future. They want the world to be a better place for everyone. We are raising money to take basic supplies to those in the hotel as many are newly arrived with just the clothes on their backs and don’t have fresh underwear, proper shoes or warm coats. You can contribute at care4calais.enthuse.com\/cf\/3d0b\/knowsley#!\/I<\/p>\n","protected":false},"author":21,"featured_media":39802,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39801"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=39801"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39801\/revisions"}],"predecessor-version":[{"id":39803,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/39801\/revisions\/39803"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/39802"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=39801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=39801"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=39801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}