{"id":40028,"date":"2023-02-24T08:00:05","date_gmt":"2023-02-24T07:00:05","guid":{"rendered":"https:\/\/care4calais.org\/?p=40028"},"modified":"2023-02-24T09:39:57","modified_gmt":"2023-02-24T08:39:57","slug":"ukraine-and-safe-passage-one-year-on","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/ukraine-and-safe-passage-one-year-on\/","title":{"rendered":"Ukraine and safe passage, one year on"},"content":{"rendered":"<p style=\"font-weight: 400;\">One year ago today Russia’s invasion of Ukraine started the biggest refugee crisis in Europe since the fall of Yugoslavia in the 1990s.<\/p>\n<p style=\"font-weight: 400;\">As a nation, we responded with compassion and action.<\/p>\n<p style=\"font-weight: 400;\">Since then we’ve issued 233,000 visas and welcomed Ukrainians to our communities across the UK.<\/p>\n<p style=\"font-weight: 400;\">As caring people, we continue to help our fellow human beings escaping danger; as we acknowledge all people deserve safety and dignity. Our leaders, however, claim to respect human rights that should be universal, but in practice it seems, they pick and choose who these rights apply to. That is not how human rights are supposed to work.<\/p>\n<p style=\"font-weight: 400;\">In the UK, we have seen this approach embedded deep in Government policy. Acknowledging only refugees who take ‘legal routes’ actually means cloaking the sinister act of deciding to whom you give ‘human rights’. It’s no surprise that these rights tend to be withheld from people with black and brown skin.<\/p>\n<p style=\"font-weight: 400;\">This matters because it means life and death to the refugees concerned.<\/p>\n<p style=\"font-weight: 400;\">But also because this goes to the heart of who we are as a country.<\/p>\n<p style=\"font-weight: 400;\">The United Kingdom does not have a constitution defining its values. Instead, it seeks to apply principles like fairness and equality before the law pragmatically, on a case by case basis.<\/p>\n<p style=\"font-weight: 400;\">There’s nothing wrong with that.<\/p>\n<p style=\"font-weight: 400;\">But it means that each time we deal with a crisis, we are showing something of who we are; deciding who merits our attention and compassion.<\/p>\n<p style=\"font-weight: 400;\">In the case of refugees, the contrast between the treatment of Afghans and other resettled refugees and that of other asylum seekers has revealed something deeply disturbing about the UK as a country.<\/p>\n<p style=\"font-weight: 400;\">Do we want to be remembered as a kind welcoming nation or as a discriminating hostile nation?<\/p>\n<p style=\"font-weight: 400;\">Read more about why safe passage is the only viable option for our asylum policy: care4calais.org\/safepassage\/<\/p>\n<p style=\"font-weight: 400;\">\n","protected":false},"excerpt":{"rendered":"<p>One year ago today Russia’s invasion of Ukraine started the biggest refugee crisis in Europe since the fall of Yugoslavia in the 1990s. As a nation, we responded with compassion and action. Since then we’ve issued 233,000 visas and welcomed Ukrainians to our communities across the UK. As caring people, we continue to help our fellow human beings escaping danger; as we acknowledge all people deserve safety and dignity. Our leaders, however, claim to respect human rights that should be universal, but in practice it seems, they pick and choose who these rights apply to. That is not how human rights are supposed to work. In the UK, we have seen this approach embedded deep in Government policy. Acknowledging only refugees who take ‘legal routes’ actually means cloaking the sinister act of deciding to whom you give ‘human rights’. It’s no surprise that these rights tend to be withheld from people with black and brown skin. This matters because it means life and death to the refugees concerned. But also because this goes to the heart of who we are as a country. The United Kingdom does not have a constitution defining its values. Instead, it seeks to apply principles like fairness and equality before the law pragmatically, on a case by case basis. There’s nothing wrong with that. But it means that each time we deal with a crisis, we are showing something of who we are; deciding who merits our attention and compassion. In the case of refugees, the contrast between the treatment of Afghans and other resettled refugees and that of other asylum seekers has revealed something deeply disturbing about the UK as a country. Do we want to be remembered as a kind welcoming nation or as a discriminating hostile nation? Read more about why safe passage is the only viable option for our asylum policy: care4calais.org\/safepassage\/<\/p>\n","protected":false},"author":21,"featured_media":40029,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40028"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=40028"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40028\/revisions"}],"predecessor-version":[{"id":40031,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40028\/revisions\/40031"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/40029"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=40028"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=40028"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=40028"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}