{"id":40271,"date":"2023-03-05T16:10:32","date_gmt":"2023-03-05T15:10:32","guid":{"rendered":"https:\/\/care4calais.org\/?p=40271"},"modified":"2023-03-05T16:10:32","modified_gmt":"2023-03-05T15:10:32","slug":"trade-unions-issue-joint-statement-in-support-of-refugees","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/trade-unions-issue-joint-statement-in-support-of-refugees\/","title":{"rendered":"Trade unions issue joint statement in support of refugees"},"content":{"rendered":"<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xdj266r x126k92a\">\n<div dir=\"auto\"> The <a href=\"https:\/\/www.fbu.org.uk\/news\/2023\/03\/05\/trade-unions-unite-solidarity-refugees?fbclid=IwAR1NTZ2-mDz-SZkkxDGOrl0m_7ahC7SejSJQWB_dxYSJaytXV3ZNbzDDslY\">Fire Brigades Union<\/a> has coordinated a brilliant and inspiring statement from a host of trade union leaders in support of refugees.<\/div>\n<div dir=\"auto\"><\/div>\n<div dir=\"auto\">The statement, which was passed as a resolution at the FBU Executive Council last week, is great to see.<\/div>\n<div dir=\"auto\">\n<p>We must stand up to the far right; refugees need solidarity, not scapegoating. If our Government showed as much leadership as the trade unions, promoting tolerance over hate, we would be in a much better place.<\/p>\n<\/div>\n<\/div>\n<div dir=\"auto\">The full statement reads:<\/div>\n<p><em>In recent weeks, we have seen an alarming rise in violence and intimidation organised by the far right against refugees and refugee accommodation.<\/em><\/p>\n<p><em>The government is complicit in these attacks. The Rwanda policy does not make sense as a means of stopping small boat crossings – and it is failing on its own terms – but it fits with a long-running campaign of rhetoric and demonisation. <\/em><\/p>\n<p><em>Anti-migrant politics are an attempt to divide working class people against each other. In the past decade, the UK has suffered a crisis of living standards – with wages falling and public services left to rot. The people to blame for this are politicians, billionaires and big corporations, not migrant workers or refugees forced to live in temporary accommodation. The anti-refugee campaign offers no solutions to the real problems faced by the deprived communities they are often targeting. The answer is solidarity, not scapegoating.   <\/em><\/p>\n<p><em>As trade unionists, we know whose side we are on when we see far right mobs attacking refugees and politicians playing the mood music. We send our solidarity to Care4Calais and all groups fighting for refugee rights, and we support the call for safe and legal routes into the UK. We call on workers and trade union members to show their solidarity and to mobilise against the far right.<\/em><\/p>\n<p><em><strong>Signed<\/strong><\/em><\/p>\n<p>Matt Wrack – FBU General Secretary<\/p>\n<p>Gary Smith – GMB General Secretary<\/p>\n<p>Andrea Egan – UNISON President<\/p>\n<p>Mary Bousted and Kevin Courtney – NEU Joint General Secretaries<\/p>\n<p>Mick Lynch – RMT General Secretary<\/p>\n<p>Jo Grady – UCU General Secretary<\/p>\n<p>Michelle Stanistreet – NUJ General Secretary<\/p>\n<p>Mick Whelan – ASLEF General Secretary<\/p>\n<p>Sarah Woolley – BFAWU General Secretary<\/p>\n<p>Paul W Fleming – Equity General Secretary<\/p>\n<p>Julia Georgiou &#8211; NHBC Staff Association General Secretary<\/p>\n<p>Naomi Pohl &#8211; Musicians’ Union General Secretary<\/p>\n<p>Steve Gillan – POA General Secretary<\/p>\n<p>Rob Monks – URTU General Secretary<\/p>\n","protected":false},"excerpt":{"rendered":"<p> The Fire Brigades Union has coordinated a brilliant and inspiring statement from a host of trade union leaders in support of refugees. The statement, which was passed as a resolution at the FBU Executive Council last week, is great to see. We must stand up to the far right; refugees need solidarity, not scapegoating. If our Government showed as much leadership as the trade unions, promoting tolerance over hate, we would be in a much better place. The full statement reads: In recent weeks, we have seen an alarming rise in violence and intimidation organised by the far right against refugees and refugee accommodation. The government is complicit in these attacks. The Rwanda policy does not make sense as a means of stopping small boat crossings – and it is failing on its own terms – but it fits with a long-running campaign of rhetoric and demonisation. Anti-migrant politics are an attempt to divide working class people against each other. In the past decade, the UK has suffered a crisis of living standards – with wages falling and public services left to rot. The people to blame for this are politicians, billionaires and big corporations, not migrant workers or refugees forced to live in temporary accommodation. The anti-refugee campaign offers no solutions to the real problems faced by the deprived communities they are often targeting. The answer is solidarity, not scapegoating.   As trade unionists, we know whose side we are on when we see far right mobs attacking refugees and politicians playing the mood music. We send our solidarity to Care4Calais and all groups fighting for refugee rights, and we support the call for safe and legal routes into the UK. We call on workers and trade union members to show their solidarity and to mobilise against the far right. Signed Matt Wrack – FBU General Secretary Gary Smith – GMB General Secretary Andrea Egan – UNISON President Mary Bousted and Kevin Courtney – NEU Joint General Secretaries Mick Lynch – RMT General Secretary Jo Grady – UCU General Secretary Michelle Stanistreet – NUJ General Secretary Mick Whelan – ASLEF General Secretary Sarah Woolley – BFAWU General Secretary Paul W Fleming – Equity General Secretary Julia Georgiou &#8211; NHBC Staff Association General Secretary Naomi Pohl &#8211; Musicians’ Union General Secretary Steve Gillan – POA General Secretary Rob Monks – URTU General Secretary<\/p>\n","protected":false},"author":21,"featured_media":40273,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40271"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=40271"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40271\/revisions"}],"predecessor-version":[{"id":40274,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40271\/revisions\/40274"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/40273"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=40271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=40271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=40271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}