{"id":40890,"date":"2023-03-29T20:16:08","date_gmt":"2023-03-29T19:16:08","guid":{"rendered":"https:\/\/care4calais.org\/?p=40890"},"modified":"2023-03-29T20:18:38","modified_gmt":"2023-03-29T19:18:38","slug":"alazs-story","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/alazs-story\/","title":{"rendered":"Alaz&#8217;s story"},"content":{"rendered":"<p style=\"font-weight: 400;\">The first time the authorities in Kurdistan threatened me, they sent people close to me to deliver threatening messages. They hacked my Facebook account three times. It was worrying, but I kept doing what they hated, which was speaking the truth. I was a journalist, and I was exposing the corruption of political leaders. That&#8217;s what journalists are meant to do.<\/p>\n<p style=\"font-weight: 400;\">But then the threats got more serious.<\/p>\n<p style=\"font-weight: 400;\">I was arrested and imprisoned for doing my job.<\/p>\n<p style=\"font-weight: 400;\">Two years later, they came to my home and set it on fire. I was not home but my wife and daughters were. They only survived because our neighbours saved them.<\/p>\n<p style=\"font-weight: 400;\">After a further attack on our family home in 2019, when my family and I were all inside, I knew I had to leave; they had made it clear they wanted to kill me.<\/p>\n<p style=\"font-weight: 400;\">My name is Alaz, and I&#8217;m a Kurdish refugee from Iraq. I&#8217;ve been a journalist for 30 years. Today I have been thinking about the American war on Iraq, which started 20 years ago this month. That war was a disaster for the whole region, because the US and UK governments had no plan for what happened afterwards.<\/p>\n<p style=\"font-weight: 400;\">Because of that, it was easier for people who wanted power to grab it. Those kinds of people hold onto power by silencing and persecuting their critics, so the situation created more refugees.<\/p>\n<p style=\"font-weight: 400;\">I am an example of that.<\/p>\n<p style=\"font-weight: 400;\">The bombing made people fear for their lives every day, and so many ordinary people were killed. It was horrific. But it was a strange conflict because its consequences were in many ways worse than the war itself – afterwards it was worse than under Saddam, because instead of one dictator we had lots of them, each with their own areas. We all saw what was happening with our local leaders as they made sure all the money and work went to them, their family, their friends and anyone willing to follow them, and as a journalist I spoke out on behalf of my people.<\/p>\n<p style=\"font-weight: 400;\">But those new dictators made it clear I&#8217;d be murdered, and now there was no US or UK to protect me. The US had said they wanted to bring freedom to the region, but you have to protect freedom. We were told we would have it, but we had no protection.<\/p>\n<p style=\"font-weight: 400;\">It was my wife who told me I should go. I know sometimes people say, why are the wives not with the refugee men? But if the husband is in danger as I was, the only chance of him staying alive for his wife and children is to flee. My wife, daughter and son are still there, and they are not safe because of me. I miss and worry about them so much it&#8217;s painful for me; I hope badly that I will be given asylum so they can join me.<\/p>\n<p style=\"font-weight: 400;\">It took me 48 days to get to the UK. I almost died on the boat crossing to Turkey, and crossing the Channel was almost as frightening. I came with 12 others in a lorry carrying vegetables. That was more than two years ago now, and I have still not had my interview. Being stuck here and unable to work is so frustrating; I feel like someone who has been imprisoned, unable to contribute to my new community.<\/p>\n<p style=\"font-weight: 400;\">&#8211; Alaz, refugee<\/p>\n<p style=\"font-weight: 400;\">Many refugees like Alaz have to make these heartbreaking decisions all the time, and when they arrive in Calais or the UK we are there to give them as much support as we can to make them feel safe and to help them regain their hope for a brighter future. That wouldn’t be possible without our hundreds of volunteers. Join us today to support refugees like Alaz: <a href=\"http:\/\/care4calais.org\/get-involved\/?fbclid=IwAR1nl5xWEPKJtJNLCpmEpLXiKoWlzR-WPtW9ilowLCe5vMJb3CC8abzwV-M\">care4calais.org\/get-involved\/<\/a><\/p>\n<p style=\"font-weight: 400;\"><a href=\"https:\/\/www.facebook.com\/hashtag\/refugeeswelcome?__eep__=6&amp;__cft__%5b0%5d=AZX1k8MqXcM2vlVg1B84BRCacnEUS73PhMpEeYxr6n0EFWxuo9CKRvfB-mSzhuiwZ60Tr27BISN4TVQkgEaY5q2AywsNhnd-xHQJRt5mpSHGEJ_Hv7oOcN2tR-VIPm2BJONOgcrrSgpVi6i4aLL_QQz1es9pfE_sEMQhyw819i5kZ5oC-2THrZYTVYwVSJ-5fU-Hc9bAdwc9yk71N7VbTC2C&amp;__tn__=*NK-R\">#RefugeesWelcome<\/a> <a href=\"https:\/\/www.facebook.com\/hashtag\/refugees?__eep__=6&amp;__cft__%5b0%5d=AZX1k8MqXcM2vlVg1B84BRCacnEUS73PhMpEeYxr6n0EFWxuo9CKRvfB-mSzhuiwZ60Tr27BISN4TVQkgEaY5q2AywsNhnd-xHQJRt5mpSHGEJ_Hv7oOcN2tR-VIPm2BJONOgcrrSgpVi6i4aLL_QQz1es9pfE_sEMQhyw819i5kZ5oC-2THrZYTVYwVSJ-5fU-Hc9bAdwc9yk71N7VbTC2C&amp;__tn__=*NK-R\">#Refugees<\/a> <a href=\"https:\/\/www.facebook.com\/hashtag\/volunteers?__eep__=6&amp;__cft__%5b0%5d=AZX1k8MqXcM2vlVg1B84BRCacnEUS73PhMpEeYxr6n0EFWxuo9CKRvfB-mSzhuiwZ60Tr27BISN4TVQkgEaY5q2AywsNhnd-xHQJRt5mpSHGEJ_Hv7oOcN2tR-VIPm2BJONOgcrrSgpVi6i4aLL_QQz1es9pfE_sEMQhyw819i5kZ5oC-2THrZYTVYwVSJ-5fU-Hc9bAdwc9yk71N7VbTC2C&amp;__tn__=*NK-R\">#Volunteers<\/a> <a href=\"https:\/\/www.facebook.com\/hashtag\/kurdishlivesmatter?__eep__=6&amp;__cft__%5b0%5d=AZX1k8MqXcM2vlVg1B84BRCacnEUS73PhMpEeYxr6n0EFWxuo9CKRvfB-mSzhuiwZ60Tr27BISN4TVQkgEaY5q2AywsNhnd-xHQJRt5mpSHGEJ_Hv7oOcN2tR-VIPm2BJONOgcrrSgpVi6i4aLL_QQz1es9pfE_sEMQhyw819i5kZ5oC-2THrZYTVYwVSJ-5fU-Hc9bAdwc9yk71N7VbTC2C&amp;__tn__=*NK-R\">#KurdishLivesMatter<\/a> <a href=\"https:\/\/www.facebook.com\/hashtag\/journalismisnotacrime?__eep__=6&amp;__cft__%5b0%5d=AZX1k8MqXcM2vlVg1B84BRCacnEUS73PhMpEeYxr6n0EFWxuo9CKRvfB-mSzhuiwZ60Tr27BISN4TVQkgEaY5q2AywsNhnd-xHQJRt5mpSHGEJ_Hv7oOcN2tR-VIPm2BJONOgcrrSgpVi6i4aLL_QQz1es9pfE_sEMQhyw819i5kZ5oC-2THrZYTVYwVSJ-5fU-Hc9bAdwc9yk71N7VbTC2C&amp;__tn__=*NK-R\">#JournalismIsNotACrime<\/a><\/p>\n<p style=\"font-weight: 400;\">Names and images have been changed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The first time the authorities in Kurdistan threatened me, they sent people close to me to deliver threatening messages. They hacked my Facebook account three times. It was worrying, but I kept doing what they hated, which was speaking the truth. I was a journalist, and I was exposing the corruption of political leaders. That&#8217;s what journalists are meant to do. But then the threats got more serious. I was arrested and imprisoned for doing my job. Two years later, they came to my home and set it on fire. I was not home but my wife and daughters were. They only survived because our neighbours saved them. After a further attack on our family home in 2019, when my family and I were all inside, I knew I had to leave; they had made it clear they wanted to kill me. My name is Alaz, and I&#8217;m a Kurdish refugee from Iraq. I&#8217;ve been a journalist for 30 years. Today I have been thinking about the American war on Iraq, which started 20 years ago this month. That war was a disaster for the whole region, because the US and UK governments had no plan for what happened afterwards. Because of that, it was easier for people who wanted power to grab it. Those kinds of people hold onto power by silencing and persecuting their critics, so the situation created more refugees. I am an example of that. The bombing made people fear for their lives every day, and so many ordinary people were killed. It was horrific. But it was a strange conflict because its consequences were in many ways worse than the war itself – afterwards it was worse than under Saddam, because instead of one dictator we had lots of them, each with their own areas. We all saw what was happening with our local leaders as they made sure all the money and work went to them, their family, their friends and anyone willing to follow them, and as a journalist I spoke out on behalf of my people. But those new dictators made it clear I&#8217;d be murdered, and now there was no US or UK to protect me. The US had said they wanted to bring freedom to the region, but you have to protect freedom. We were told we would have it, but we had no protection. It was my wife who told me I should go. I know sometimes people say, why are the wives not with the refugee men? But if the husband is in danger as I was, the only chance of him staying alive for his wife and children is to flee. My wife, daughter and son are still there, and they are not safe because of me. I miss and worry about them so much it&#8217;s painful for me; I hope badly that I will be given asylum so they can join me. It took me 48 days to get to the UK. I almost died on the boat crossing to Turkey, and crossing the Channel was almost as frightening. I came with 12 others in a lorry carrying vegetables. That was more than two years ago now, and I have still not had my interview. Being stuck here and unable to work is so frustrating; I feel like someone who has been imprisoned, unable to contribute to my new community. &#8211; Alaz, refugee Many refugees like Alaz have to make these heartbreaking decisions all the time, and when they arrive in Calais or the UK we are there to give them as much support as we can to make them feel safe and to help them regain their hope for a brighter future. That wouldn’t be possible without our hundreds of volunteers. Join us today to support refugees like Alaz: care4calais.org\/get-involved\/ #RefugeesWelcome #Refugees #Volunteers #KurdishLivesMatter #JournalismIsNotACrime Names and images have been changed.<\/p>\n","protected":false},"author":21,"featured_media":40893,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[74,173,174,256,104,257],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40890"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=40890"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40890\/revisions"}],"predecessor-version":[{"id":40894,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/40890\/revisions\/40894"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/40893"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=40890"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=40890"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=40890"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}