{"id":41455,"date":"2023-04-29T17:35:17","date_gmt":"2023-04-29T16:35:17","guid":{"rendered":"https:\/\/care4calais.org\/?p=41455"},"modified":"2023-04-29T18:29:33","modified_gmt":"2023-04-29T17:29:33","slug":"refugees-abused-and-attacked-in-knowsley","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/refugees-abused-and-attacked-in-knowsley\/","title":{"rendered":"Refugees abused and attacked in Knowsley"},"content":{"rendered":"<p style=\"font-weight: 400;\">“The gang attacked me when I was out walking in Liverpool with my friend. First they shouted insults, and when we didn’t do anything, they spat on us instead. When we still did nothing, they threw a heavy bike at our backs.<\/p>\n<p style=\"font-weight: 400;\">“Then we ran for our lives.”<\/p>\n<p style=\"font-weight: 400;\">“My name is Fadi, and I am 20-year-old Syrian refugee. Until recently, I was living in the Suites Hotel in Knowsley on Merseyside, which was attacked in February.<\/p>\n<p style=\"font-weight: 400;\">“My ordeal happened a few weeks after that. My friend Abbas and I were walking near some shops when we noticed five men watching us. They were between 18 and 22, drinking from plastic bottles. One of them was on a bike. To lose them, we went into a supermarket, but when we came out they were waiting for us.<\/p>\n<p style=\"font-weight: 400;\">“We headed back to the hotel, trying not to look worried. They followed, talking about us loudly so we could hear, and shouting insults.<\/p>\n<p style=\"font-weight: 400;\">“We couldn’t understand well, so they started spitting at us instead.<\/p>\n<p style=\"font-weight: 400;\">“By now we were in a park. They finished off their drinks, and threw the plastic bottles at our backs. We were scared now. There were only two of us and five of them. It wasn’t just fear of being attacked. We were worried that if something happened the police would come and support the local men because we were refugees. We thought we would be in trouble.<\/p>\n<p style=\"font-weight: 400;\">“I wanted to tell the boys we just wished to live peacefully with them. I had to leave Syria to escape fighting in the war. I just want a safe, normal life, that’s all.<\/p>\n<p style=\"font-weight: 400;\">“I was thinking about that when the cyclist jumped off his bike, picked it up and threw it at our backs.<\/p>\n<p style=\"font-weight: 400;\">“It really hurt. I could see Abbas’s hand bleeding. We ran.<\/p>\n<p style=\"font-weight: 400;\">“They gave chase. We ran for 15 minutes, and they got closer and closer. My heart was pounding so hard in my chest, I thought we wouldn’t make it.<\/p>\n<p style=\"font-weight: 400;\">“But then, suddenly, they realised we were approaching our hotel, and stopped.<\/p>\n<p style=\"font-weight: 400;\">“The manager called the police, and a doctor came to treat us. We were safe, but still terrified. I never went out again after that. A few weeks later, the authorities moved me to a new hotel in Manchester and I feel safe here, so that’s good.<\/p>\n<p style=\"font-weight: 400;\">“I know that most people are kind and a minority causes problems for other people &#8211; you know this if you come from Syria, believe me. But I talk to the friends I left behind in there Knowsley hotel, and they have the same problems as I had. It&#8217;s just not a safe place for refugees to be.”<\/p>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s x126k92a\">\n<div dir=\"auto\">Following the riot on 10 February. Police have recorded 15 crimes against asylum seekers and staff since the disorder broke out, with many residents now too scared to go outside.<\/div>\n<\/div>\n<p style=\"font-weight: 400;\">For the sake of Fadi and Abbas and countless others like them, it’s time the hotel in Knowsley was closed and all the people there were moved to a safer location.<\/p>\n<p style=\"font-weight: 400;\">For the full Independent report, go here: <a href=\"https:\/\/bit.ly\/KnowsleyReport?fbclid=IwAR1cDS-JPpC-fF51e8fPus1-9aSHUFPQOKNUefDmoCdgJz4AmiKeTjpmCxo\">https:\/\/bit.ly\/KnowsleyReport<\/a><\/p>\n<p style=\"font-weight: 400;\">Names and image have been changed.<\/p>\n<p style=\"font-weight: 400;\">\n","protected":false},"excerpt":{"rendered":"<p>“The gang attacked me when I was out walking in Liverpool with my friend. First they shouted insults, and when we didn’t do anything, they spat on us instead. When we still did nothing, they threw a heavy bike at our backs. “Then we ran for our lives.” “My name is Fadi, and I am 20-year-old Syrian refugee. Until recently, I was living in the Suites Hotel in Knowsley on Merseyside, which was attacked in February. “My ordeal happened a few weeks after that. My friend Abbas and I were walking near some shops when we noticed five men watching us. They were between 18 and 22, drinking from plastic bottles. One of them was on a bike. To lose them, we went into a supermarket, but when we came out they were waiting for us. “We headed back to the hotel, trying not to look worried. They followed, talking about us loudly so we could hear, and shouting insults. “We couldn’t understand well, so they started spitting at us instead. “By now we were in a park. They finished off their drinks, and threw the plastic bottles at our backs. We were scared now. There were only two of us and five of them. It wasn’t just fear of being attacked. We were worried that if something happened the police would come and support the local men because we were refugees. We thought we would be in trouble. “I wanted to tell the boys we just wished to live peacefully with them. I had to leave Syria to escape fighting in the war. I just want a safe, normal life, that’s all. “I was thinking about that when the cyclist jumped off his bike, picked it up and threw it at our backs. “It really hurt. I could see Abbas’s hand bleeding. We ran. “They gave chase. We ran for 15 minutes, and they got closer and closer. My heart was pounding so hard in my chest, I thought we wouldn’t make it. “But then, suddenly, they realised we were approaching our hotel, and stopped. “The manager called the police, and a doctor came to treat us. We were safe, but still terrified. I never went out again after that. A few weeks later, the authorities moved me to a new hotel in Manchester and I feel safe here, so that’s good. “I know that most people are kind and a minority causes problems for other people &#8211; you know this if you come from Syria, believe me. But I talk to the friends I left behind in there Knowsley hotel, and they have the same problems as I had. It&#8217;s just not a safe place for refugees to be.” Following the riot on 10 February. Police have recorded 15 crimes against asylum seekers and staff since the disorder broke out, with many residents now too scared to go outside. For the sake of Fadi and Abbas and countless others like them, it’s time the hotel in Knowsley was closed and all the people there were moved to a safer location. For the full Independent report, go here: https:\/\/bit.ly\/KnowsleyReport Names and image have been changed.<\/p>\n","protected":false},"author":21,"featured_media":41462,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[270,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41455"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41455"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41455\/revisions"}],"predecessor-version":[{"id":41460,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41455\/revisions\/41460"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41462"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41455"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41455"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41455"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}