{"id":41796,"date":"2023-05-11T18:04:57","date_gmt":"2023-05-11T17:04:57","guid":{"rendered":"https:\/\/care4calais.org\/?p=41796"},"modified":"2023-05-11T18:04:57","modified_gmt":"2023-05-11T17:04:57","slug":"thank-you-clare","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/thank-you-clare\/","title":{"rendered":"Thank you, Clare"},"content":{"rendered":"<p>Eight years ago, Clare Moseley read a story about refugees in Calais, and cared so much that she immediately went to France and began helping them as a volunteer.<\/p>\n<p>As a volunteer she worked all hours, every day, and stayed on in Calais for months.<\/p>\n<p>Eventually she founded Care4Calais, a charity that would enable thousands of other volunteers to care for refugees just like she did.<\/p>\n<p>Without her, many of the most vulnerable people on earth would not have had food, clothing, shelter, legal support, friendship, or restored dignity. And we, the team at Care4Calais would not be here now continuing that support.<\/p>\n<p>Few people leave such a legacy, but Clare Moseley has done, and today &#8211; as she moves on to new projects &#8211; we honour that.<\/p>\n<p>As one of our volunteers says, &#8220;she’s an almighty force, and she will put herself in the line of fire for others all the time. That&#8217;s why she&#8217;s been able to do so much good for those with no voice, and to create real change.&#8221;<\/p>\n<p>Clare&#8217;s achievements with Care4Calais are legion. The incredible infrastructure that facilitates the support of refugees in northern France day in and day out; the support network of volunteers helping asylum seekers in the UK; the Access Team, providing essential legal help; the campaigns against Napier Barracks, the Rwanda Plan and the Illegal Migration Bill; the list goes on!<\/p>\n<p>All of these have had a lasting effect on the lives of refugees, and they have also inspired countless people to take action. Care4Calais is not a large, wealthy charity; it is dependent on volunteers and donations, but it has become an example of what can be achieved with love and hard work.<\/p>\n<p>More than that, it has become a beacon of hope to many who would otherwise feel hopeless. And we thank Clare for being the spark that started it all.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Eight years ago, Clare Moseley read a story about refugees in Calais, and cared so much that she immediately went to France and began helping them as a volunteer. As a volunteer she worked all hours, every day, and stayed on in Calais for months. Eventually she founded Care4Calais, a charity that would enable thousands of other volunteers to care for refugees just like she did. Without her, many of the most vulnerable people on earth would not have had food, clothing, shelter, legal support, friendship, or restored dignity. And we, the team at Care4Calais would not be here now continuing that support. Few people leave such a legacy, but Clare Moseley has done, and today &#8211; as she moves on to new projects &#8211; we honour that. As one of our volunteers says, &#8220;she’s an almighty force, and she will put herself in the line of fire for others all the time. That&#8217;s why she&#8217;s been able to do so much good for those with no voice, and to create real change.&#8221; Clare&#8217;s achievements with Care4Calais are legion. The incredible infrastructure that facilitates the support of refugees in northern France day in and day out; the support network of volunteers helping asylum seekers in the UK; the Access Team, providing essential legal help; the campaigns against Napier Barracks, the Rwanda Plan and the Illegal Migration Bill; the list goes on! All of these have had a lasting effect on the lives of refugees, and they have also inspired countless people to take action. Care4Calais is not a large, wealthy charity; it is dependent on volunteers and donations, but it has become an example of what can be achieved with love and hard work. More than that, it has become a beacon of hope to many who would otherwise feel hopeless. And we thank Clare for being the spark that started it all.<\/p>\n","protected":false},"author":21,"featured_media":41797,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41796"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41796"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41796\/revisions"}],"predecessor-version":[{"id":41798,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41796\/revisions\/41798"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41797"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41796"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41796"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41796"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}