{"id":41887,"date":"2023-05-14T09:26:25","date_gmt":"2023-05-14T08:26:25","guid":{"rendered":"https:\/\/care4calais.org\/?p=41887"},"modified":"2023-05-15T09:26:37","modified_gmt":"2023-05-15T08:26:37","slug":"faith-leaders-speak-out-for-afghan-pilot","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/faith-leaders-speak-out-for-afghan-pilot\/","title":{"rendered":"Faith leaders speak out for Afghan pilot"},"content":{"rendered":"<p>Suella Braverman has been formally accused of breaching the UK barristers’ code with &#8220;racist sentiments and discriminatory narratives” about asylum seekers, reports <a href=\"https:\/\/www.theguardian.com\/politics\/2023\/may\/14\/suella-braverman-accused-of-breaching-barristers-code-over-racist-language?fbclid=IwAR35m8Jp6ym0_eQwYB02ycoWZA1UvaYLzE68VL3zGdPoLdOC7cn821MM4sw#:~:text=Lawyers%20and%20faith%20organisations%20have,racist%20sentiments%20and%20discriminatory%20narratives\">The Guardian<\/a>.<\/p>\n<p>Lawyers and faith organisations have lodged a complaint with the <a href=\"https:\/\/www.barstandardsboard.org.uk\">Bar Standards Board<\/a>, which has a duty to examine the conduct of qualified barristers. Although Braverman has not practised as a barrister since becoming an MP in 2015, she is still subject to its rules.<\/p>\n<p>The letter cites Braverman’s warning that 100 million asylum seekers would come to the UK were it not for her planned immigration crackdown and that people crossing the Channel have values at odds with the UK and “heightened levels of criminality”. She has described the arrival of asylum seekers in the UK as an “invasion”.<\/p>\n<p>It also raises Braverman’s comment in April that grooming gang members were predominantly British-Pakistani men and “hold cultural values totally at odds with British values”.<\/p>\n<p>“These comments are not only highly inaccurate and offensive, but they also perpetuate harmful stereotypes and contribute to a climate of hate and prejudice,” the complaint letter states.<br \/>\nThe complaint is signed by nine organisations including the Society of Asian Lawyers, the Association of Muslim Lawyers and the Joint Council for the Welfare of Immigrants.<\/p>\n<p>The Bar Standards Board has a remit to examine the conduct of barristers who are not currently practising but who remain members of the profession and are subject to conduct rules and are expected to “conduct themselves in an appropriate manner”.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Suella Braverman has been formally accused of breaching the UK barristers’ code with &#8220;racist sentiments and discriminatory narratives” about asylum seekers, reports The Guardian. Lawyers and faith organisations have lodged a complaint with the Bar Standards Board, which has a duty to examine the conduct of qualified barristers. Although Braverman has not practised as a barrister since becoming an MP in 2015, she is still subject to its rules. The letter cites Braverman’s warning that 100 million asylum seekers would come to the UK were it not for her planned immigration crackdown and that people crossing the Channel have values at odds with the UK and “heightened levels of criminality”. She has described the arrival of asylum seekers in the UK as an “invasion”. It also raises Braverman’s comment in April that grooming gang members were predominantly British-Pakistani men and “hold cultural values totally at odds with British values”. “These comments are not only highly inaccurate and offensive, but they also perpetuate harmful stereotypes and contribute to a climate of hate and prejudice,” the complaint letter states. The complaint is signed by nine organisations including the Society of Asian Lawyers, the Association of Muslim Lawyers and the Joint Council for the Welfare of Immigrants. The Bar Standards Board has a remit to examine the conduct of barristers who are not currently practising but who remain members of the profession and are subject to conduct rules and are expected to “conduct themselves in an appropriate manner”.<\/p>\n","protected":false},"author":21,"featured_media":41888,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41887"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41887"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41887\/revisions"}],"predecessor-version":[{"id":41889,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41887\/revisions\/41889"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41888"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41887"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41887"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41887"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}