{"id":41898,"date":"2023-05-17T18:58:20","date_gmt":"2023-05-17T17:58:20","guid":{"rendered":"https:\/\/care4calais.org\/?p=41898"},"modified":"2023-05-17T18:58:20","modified_gmt":"2023-05-17T17:58:20","slug":"how-to-make-housing-refugees-easier","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/how-to-make-housing-refugees-easier\/","title":{"rendered":"Here&#8217;s how to make housing refugees easier"},"content":{"rendered":"<p>Suella Braverman, the Home Secretary, wants a new law freeing landlords from rules guaranteeing basic standards in homes for asylum seekers. The won&#8217;t have to provide gas and safety certificates, and rules concerning minimum room sizes will be lifted.<\/p>\n<p>Ministers are looking to place refugees in these substandard and dangerous properties because, they say, there are too many refugees in hotels. The government needs to move them into houses, they say – regardless, it seems, of those houses&#8217; quality.<\/p>\n<p>But why are refugees in hotels in the first place?<\/p>\n<p>The Home Office is responsible for providing accommodation to asylum seekers who do not have the means to obtain it themselves.<\/p>\n<p>Until recently, an asylum seeker would stay in short-term hostel-style ‘initial accommodation’ before moving into self-catered shared flats or houses until the Home Office processed their claim.<\/p>\n<p>But with the backlog growing, and it taking longer and longer to process claims, there is not enough self-catered style accommodation. The government is using other options such as hotels and former military sites.<\/p>\n<p>This year TB and scabies have broken out on those sites. The government says it will use barges as accommodation. And now they want to reduce the standards in housing.<\/p>\n<p>Noone wants this. But these measures will not fix any of the problems in the asylum system. They do however risk the mental and physical health of vulnerable asylum seekers.<\/p>\n<p>Such actions seem increasingly like gimmicks meant to distract us from the obvious solution:<\/p>\n<p>PROCESS THE CLAIMS SO ASYLUM SEEKERS CAN GET ON WITH THEIR LIVES,<br \/>\nGET TO WORK AND CONTRIBUTE TO THE ECONOMY &#8211; JUST LIKE THEY LONG TO.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Suella Braverman, the Home Secretary, wants a new law freeing landlords from rules guaranteeing basic standards in homes for asylum seekers. The won&#8217;t have to provide gas and safety certificates, and rules concerning minimum room sizes will be lifted. Ministers are looking to place refugees in these substandard and dangerous properties because, they say, there are too many refugees in hotels. The government needs to move them into houses, they say – regardless, it seems, of those houses&#8217; quality. But why are refugees in hotels in the first place? The Home Office is responsible for providing accommodation to asylum seekers who do not have the means to obtain it themselves. Until recently, an asylum seeker would stay in short-term hostel-style ‘initial accommodation’ before moving into self-catered shared flats or houses until the Home Office processed their claim. But with the backlog growing, and it taking longer and longer to process claims, there is not enough self-catered style accommodation. The government is using other options such as hotels and former military sites. This year TB and scabies have broken out on those sites. The government says it will use barges as accommodation. And now they want to reduce the standards in housing. Noone wants this. But these measures will not fix any of the problems in the asylum system. They do however risk the mental and physical health of vulnerable asylum seekers. Such actions seem increasingly like gimmicks meant to distract us from the obvious solution: PROCESS THE CLAIMS SO ASYLUM SEEKERS CAN GET ON WITH THEIR LIVES, GET TO WORK AND CONTRIBUTE TO THE ECONOMY &#8211; JUST LIKE THEY LONG TO. &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":41899,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41898"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41898"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41898\/revisions"}],"predecessor-version":[{"id":41900,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41898\/revisions\/41900"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41899"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41898"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41898"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41898"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}