{"id":41921,"date":"2023-05-29T19:36:20","date_gmt":"2023-05-29T18:36:20","guid":{"rendered":"https:\/\/care4calais.org\/?p=41921"},"modified":"2023-05-29T19:44:32","modified_gmt":"2023-05-29T18:44:32","slug":"helping-refugees-affected-by-the-sudanese-war","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/helping-refugees-affected-by-the-sudanese-war\/","title":{"rendered":"Helping refugees affected by the Sudanese war"},"content":{"rendered":"<p style=\"font-weight: 400;\">Today I learned a heart-breaking lesson about how important our phone charging services are.<\/p>\n<p style=\"font-weight: 400;\">When we&#8217;re giving out food and clothing, we also <a href=\"https:\/\/care4calais.org\/news\/why-phones-are-so-important-to-refugees\/\">provide big banks of charging points<\/a>, and sometimes we give out charging packs too.<\/p>\n<p style=\"font-weight: 400;\">This afternoon Adil, a 17-year-old refugee, asked to borrow my phone while his was charging. &#8220;I will show you a picture of my home,&#8221; he said. I thought he just wanted to show me where he was from. In fact he found Facebook and showed me a photograph a ransacked and damaged house.<\/p>\n<p style=\"font-weight: 400;\">It was his actual home in Sudan.<\/p>\n<p style=\"font-weight: 400;\">Staring at the awful picture, he was tearful and overwhelmed. He asked if he could use the phone to call his family, as he had not been able to get through on his own. To his mounting anguish, though, he couldn&#8217;t.<\/p>\n<p style=\"font-weight: 400;\">&#8220;I know my home looks like this,&#8221; he said. “But I have not been able to speak to any friends, any family.”<\/p>\n<p style=\"font-weight: 400;\">He looked through more photographs, shaking his head. “My home, my home my home…” All this at 17 years old; his bravery was something I will never forget.<\/p>\n<p>&nbsp;<\/p>\n<h3>The Sudanese refugees&#8217; mood in Calais is changing<\/h3>\n<p style=\"font-weight: 400;\">We&#8217;re not yet seeing a large influx of people here who have fled the current outbreak of armed conflict, but Sudan has been dangerous for many people for many years, and the threats people have escaped, and the journeys they have been on, are always terrifying. The main difference now is the worry and concern; the charging board we provide have never been more important.<\/p>\n<p style=\"font-weight: 400;\">There are a lot of Sudanese people at the site where we were. The atmosphere is often very positive, but right now there’s a sense of worry under the surface. When you talk to the refugees there, you often get a sense of the anxiety over the situation at home.<\/p>\n<p style=\"font-weight: 400;\">We listen and support people, and help with the services we provide and essentials we give out. Last week we gave out 150 hygiene packs here, and today it was 125 waterproof coats. These are so important, because although it&#8217;s getting warmer, it rains a lot in Calais. It&#8217;s so hard for refugees to get dry again if they&#8217;re wet.<\/p>\n<p style=\"font-weight: 400;\">Adil showed me more pictures and videos from Sudan, some of them of horrific things. Bombed<a href=\"https:\/\/www.bbc.co.uk\/news\/world-africa-65718968\"> hospitals.<\/a> Bombed out homes. Thousands of families escaping with a few belongings. It&#8217;s terrible to think that people fleeing this to the UK could be sent to Rwanda.<\/p>\n<p style=\"font-weight: 400;\">Adil had left Sudan before the new outbreak of violence. He just wanted an ordinary life, and was keen to learn English so that he could study and work when he got to the UK. Having seen his resilience, I really hope he makes it, and get the safety he deserves.<\/p>\n<p>&nbsp;<\/p>\n<h3>Can you help?<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-41923\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2023\/05\/RHE-Q2-1070644.jpg\" alt=\"\" width=\"800\" height=\"318\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2023\/05\/RHE-Q2-1070644.jpg 800w, https:\/\/care4calais.org\/wp-content\/uploads\/2023\/05\/RHE-Q2-1070644-300x119.jpg 300w, https:\/\/care4calais.org\/wp-content\/uploads\/2023\/05\/RHE-Q2-1070644-768x305.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>It&#8217;s amazing how people manage to stay cheerful in the face of it all; today towards the end of the distribution we put on music and some were even dancing. Playing football, or on the games tables, listening to music and just talking to people is an escape from the harsh monotony of life as a refugee. As a volunteer, it can be challenging some days, but then on others, seeing the sheer resilience of people can inspire you as well.<\/p>\n<p style=\"font-weight: 400;\">We help refugees like Adil everyday with phone charging, support and other essential items and services – but we can only do this together with you. Could you help by being a donor? Any amount, large or small, makes a big difference: to donate, go <a href=\"https:\/\/care4calais.org\/donate-now\/\">here<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today I learned a heart-breaking lesson about how important our phone charging services are. When we&#8217;re giving out food and clothing, we also provide big banks of charging points, and sometimes we give out charging packs too. This afternoon Adil, a 17-year-old refugee, asked to borrow my phone while his was charging. &#8220;I will show you a picture of my home,&#8221; he said. I thought he just wanted to show me where he was from. In fact he found Facebook and showed me a photograph a ransacked and damaged house. It was his actual home in Sudan. Staring at the awful picture, he was tearful and overwhelmed. He asked if he could use the phone to call his family, as he had not been able to get through on his own. To his mounting anguish, though, he couldn&#8217;t. &#8220;I know my home looks like this,&#8221; he said. “But I have not been able to speak to any friends, any family.” He looked through more photographs, shaking his head. “My home, my home my home…” All this at 17 years old; his bravery was something I will never forget. &nbsp; The Sudanese refugees&#8217; mood in Calais is changing We&#8217;re not yet seeing a large influx of people here who have fled the current outbreak of armed conflict, but Sudan has been dangerous for many people for many years, and the threats people have escaped, and the journeys they have been on, are always terrifying. The main difference now is the worry and concern; the charging board we provide have never been more important. There are a lot of Sudanese people at the site where we were. The atmosphere is often very positive, but right now there’s a sense of worry under the surface. When you talk to the refugees there, you often get a sense of the anxiety over the situation at home. We listen and support people, and help with the services we provide and essentials we give out. Last week we gave out 150 hygiene packs here, and today it was 125 waterproof coats. These are so important, because although it&#8217;s getting warmer, it rains a lot in Calais. It&#8217;s so hard for refugees to get dry again if they&#8217;re wet. Adil showed me more pictures and videos from Sudan, some of them of horrific things. Bombed hospitals. Bombed out homes. Thousands of families escaping with a few belongings. It&#8217;s terrible to think that people fleeing this to the UK could be sent to Rwanda. Adil had left Sudan before the new outbreak of violence. He just wanted an ordinary life, and was keen to learn English so that he could study and work when he got to the UK. Having seen his resilience, I really hope he makes it, and get the safety he deserves. &nbsp; Can you help? It&#8217;s amazing how people manage to stay cheerful in the face of it all; today towards the end of the distribution we put on music and some were even dancing. Playing football, or on the games tables, listening to music and just talking to people is an escape from the harsh monotony of life as a refugee. As a volunteer, it can be challenging some days, but then on others, seeing the sheer resilience of people can inspire you as well. We help refugees like Adil everyday with phone charging, support and other essential items and services – but we can only do this together with you. Could you help by being a donor? Any amount, large or small, makes a big difference: to donate, go here<\/p>\n","protected":false},"author":21,"featured_media":41925,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[22,171,70,196],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41921"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41921"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41921\/revisions"}],"predecessor-version":[{"id":41928,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41921\/revisions\/41928"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41925"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41921"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41921"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41921"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}