{"id":41933,"date":"2023-05-31T18:56:31","date_gmt":"2023-05-31T17:56:31","guid":{"rendered":"https:\/\/care4calais.org\/?p=41933"},"modified":"2023-05-31T18:56:31","modified_gmt":"2023-05-31T17:56:31","slug":"another-refugee-tragically-killed-in-calais","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/another-refugee-tragically-killed-in-calais\/","title":{"rendered":"Another refugee tragically killed in Calais"},"content":{"rendered":"<p style=\"font-weight: 400;\">Today another refugee was tragically killed in Calais.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">The 25-year-old Sudanese man died after falling under the wheels of a lorry after being hit by a lorry in the early hours of this morning, French newspapers report.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">According to other refugees interviewed at the scene, the man had run behind the vehicle as it left the parking lot, hoping to get into it somehow. When it came to a halt, he tried to climb between the trailer and the cab when it stopped.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">When it began to move again he slipped, and fell beneath the wheels as his friends watched in horror.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">The lorry drove on, apparently unaware of the accident. At the time of writing, the driver had not yet been traced.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">Emergency services attended, but were unable to save the man.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">Many refugees, particularly those unable to secure a crossing by boat, try to reach the UK by climbing aboard lorries, risking their lives in the process. This latest tragedy demonstrates yet again the risks and perils refugees face every day. The man was the third Sudanese refugee killed in Calais this year – the third young man to have escaped threats at home and travelled thousands of miles, only to die a horrific and lonely death at the border of his destination. Three more have broken limbs this month alone. No one can record or imagine the trauma suffered by friends forced to witness these tragic accidents.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">By any measure these deaths and this suffering on our border ought to be universally regarded as unacceptable. Perhaps it would be if it were not for the rhetoric of some politicians that makes it easier to see refugees here as somehow less than human.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">For the sake of young men like today’s victim, we must make sure people know of these dangers, and continue to fight for humanbe border policies. A system of #SafePassage for victims of war and persecution would end these deaths and injuries. Let us keep campaigning for it, and treat life as precious, rather than something to be risked in desperation in the Calais night.<\/p>\n<p style=\"font-weight: 400;\">\n<p style=\"font-weight: 400;\">\n","protected":false},"excerpt":{"rendered":"<p>Today another refugee was tragically killed in Calais. The 25-year-old Sudanese man died after falling under the wheels of a lorry after being hit by a lorry in the early hours of this morning, French newspapers report. According to other refugees interviewed at the scene, the man had run behind the vehicle as it left the parking lot, hoping to get into it somehow. When it came to a halt, he tried to climb between the trailer and the cab when it stopped. When it began to move again he slipped, and fell beneath the wheels as his friends watched in horror. The lorry drove on, apparently unaware of the accident. At the time of writing, the driver had not yet been traced. Emergency services attended, but were unable to save the man. Many refugees, particularly those unable to secure a crossing by boat, try to reach the UK by climbing aboard lorries, risking their lives in the process. This latest tragedy demonstrates yet again the risks and perils refugees face every day. The man was the third Sudanese refugee killed in Calais this year – the third young man to have escaped threats at home and travelled thousands of miles, only to die a horrific and lonely death at the border of his destination. Three more have broken limbs this month alone. No one can record or imagine the trauma suffered by friends forced to witness these tragic accidents. By any measure these deaths and this suffering on our border ought to be universally regarded as unacceptable. Perhaps it would be if it were not for the rhetoric of some politicians that makes it easier to see refugees here as somehow less than human. For the sake of young men like today’s victim, we must make sure people know of these dangers, and continue to fight for humanbe border policies. A system of #SafePassage for victims of war and persecution would end these deaths and injuries. Let us keep campaigning for it, and treat life as precious, rather than something to be risked in desperation in the Calais night.<\/p>\n","protected":false},"author":21,"featured_media":41934,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[277,22,278,104,276],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41933"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41933"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41933\/revisions"}],"predecessor-version":[{"id":41935,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41933\/revisions\/41935"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41934"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41933"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41933"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41933"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}