{"id":41963,"date":"2023-06-09T18:37:04","date_gmt":"2023-06-09T17:37:04","guid":{"rendered":"https:\/\/care4calais.org\/?p=41963"},"modified":"2023-06-10T18:44:48","modified_gmt":"2023-06-10T17:44:48","slug":"refugee-age-disputes","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/refugee-age-disputes\/","title":{"rendered":"Our Age Disputes team helps its 1000th young person!"},"content":{"rendered":"<p style=\"font-weight: 400;\">Back in 2021, we began to notice more and more child refugees were contacting us to say the Home Office had classed them as adults.<\/p>\n<p style=\"font-weight: 400;\">Many of them were understandably upset. At ages when they should have been in school and supported by Children’s Services, they were living in hotels surrounded by men far older than themselves. And all alone in a strange new country, they had no way of doing anything about it.<\/p>\n<p style=\"font-weight: 400;\">So, in March 2022 we launched our dedicated Age Disputes team.<\/p>\n<p style=\"font-weight: 400;\">The volunteers in our team work incredibly hard to provide support to the young people we meet. We call every single individual and discuss what happened to them on arrival and how we can help. We explain the asylum process, and refer them to Children’s Services and solicitors who help as they dispute the age wrongly assigned to them.<\/p>\n<p style=\"font-weight: 400;\">We also stay in touch with the young person through the many months that it can take for their age to be corrected, and for the right support to be provided. This is so important, because they’re often frightened and traumatised, and we’re the only friend they can turn to.<\/p>\n<p style=\"font-weight: 400;\">I run the team, and I’m in awe of the dedication and compassion of our volunteers. It feels like an achievement to have supported so many young people since October 2021, but also so wrong, because if refugees were treated fairly, this team wouldn’t need to exist at all.<\/p>\n<p style=\"font-weight: 400;\">Rebecca, Care4Calais<\/p>\n<p style=\"font-weight: 400;\">Right now we’re recruiting new volunteers for our Age Dispute team. If you could help, please go to <a href=\"https:\/\/care4calais.org\/get-involved\/supporting-refugees-in-the-uk\/?fbclid=IwAR0vUXASdhO0Sy2Y85l0OUtq0uivpeL3Hx3bTNazjeuvkceyyX7AQxJSlB4\">care4calais.org\/get-involved\/supporting-refugees-in-the-uk\/<\/a><\/p>\n<p style=\"font-weight: 400;\">\n","protected":false},"excerpt":{"rendered":"<p>Back in 2021, we began to notice more and more child refugees were contacting us to say the Home Office had classed them as adults. Many of them were understandably upset. At ages when they should have been in school and supported by Children’s Services, they were living in hotels surrounded by men far older than themselves. And all alone in a strange new country, they had no way of doing anything about it. So, in March 2022 we launched our dedicated Age Disputes team. The volunteers in our team work incredibly hard to provide support to the young people we meet. We call every single individual and discuss what happened to them on arrival and how we can help. We explain the asylum process, and refer them to Children’s Services and solicitors who help as they dispute the age wrongly assigned to them. We also stay in touch with the young person through the many months that it can take for their age to be corrected, and for the right support to be provided. This is so important, because they’re often frightened and traumatised, and we’re the only friend they can turn to. I run the team, and I’m in awe of the dedication and compassion of our volunteers. It feels like an achievement to have supported so many young people since October 2021, but also so wrong, because if refugees were treated fairly, this team wouldn’t need to exist at all. Rebecca, Care4Calais Right now we’re recruiting new volunteers for our Age Dispute team. If you could help, please go to care4calais.org\/get-involved\/supporting-refugees-in-the-uk\/<\/p>\n","protected":false},"author":21,"featured_media":41968,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41963"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41963"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41963\/revisions"}],"predecessor-version":[{"id":41972,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41963\/revisions\/41972"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41968"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41963"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41963"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41963"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}