{"id":41982,"date":"2023-06-17T11:15:03","date_gmt":"2023-06-17T10:15:03","guid":{"rendered":"https:\/\/care4calais.org\/?p=41982"},"modified":"2023-06-17T11:24:47","modified_gmt":"2023-06-17T10:24:47","slug":"asylum-suffering-in-uk-hotels","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/asylum-suffering-in-uk-hotels\/","title":{"rendered":"Asylum seekers suffering in UK hotels"},"content":{"rendered":"<p>“A system that allows private contractors to profit while human beings, including children, are losing weight from being denied access to nutritious food, is a system that is broken,&#8221; our CEO Steve Smith told the Guardian today. &#8220;Malnutrition among asylum seekers in UK hotels is a public health issue and one that the government must urgently get on top of.”<\/p>\n<p>Smith was commenting after it <a href=\"https:\/\/www.theguardian.com\/uk-news\/2023\/jun\/17\/children-in-englands-asylum-hotels-suffering-from-malnutrition\">emerged<\/a> that increasing number of children and adults in asylum seeker hotel accommodation are being diagnosed with malnutrition.<\/p>\n<p>Cases of malnutrition among both children and adults have been confirmed in various different areas of England, including hotels in London and in the south-west.<\/p>\n<p>Health professionals have raised concerns, with some children at hotels becoming <a href=\"https:\/\/www.nhs.uk\/conditions\/malnutrition\/\">dangerously thin<\/a> and in need of frequent monitoring.<\/p>\n<p>One Syrian mother whom Care4Calais supports is in a London hotel with her family. “Seeing my children lose weight in the hotel is breaking my heart. Children are supposed to gain weight as they grow not lose it.”<\/p>\n<p>“My three-year-old daughter has lost a lot of weight since we arrived. She only weighs 13 kilos now. When we ask for milk for the children they don’t always give it to us and the milk we do get looks like it’s mixed with water. We’re given rice swimming in water and stinky chicken.”<\/p>\n<p>&nbsp;<\/p>\n<p>Those working with families in hotels reported that some parents have been found rummaging through bins to find food for their children and adults were losing as much as 10-15kg (22-33lbs) of weight.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“A system that allows private contractors to profit while human beings, including children, are losing weight from being denied access to nutritious food, is a system that is broken,&#8221; our CEO Steve Smith told the Guardian today. &#8220;Malnutrition among asylum seekers in UK hotels is a public health issue and one that the government must urgently get on top of.” Smith was commenting after it emerged that increasing number of children and adults in asylum seeker hotel accommodation are being diagnosed with malnutrition. Cases of malnutrition among both children and adults have been confirmed in various different areas of England, including hotels in London and in the south-west. Health professionals have raised concerns, with some children at hotels becoming dangerously thin and in need of frequent monitoring. One Syrian mother whom Care4Calais supports is in a London hotel with her family. “Seeing my children lose weight in the hotel is breaking my heart. Children are supposed to gain weight as they grow not lose it.” “My three-year-old daughter has lost a lot of weight since we arrived. She only weighs 13 kilos now. When we ask for milk for the children they don’t always give it to us and the milk we do get looks like it’s mixed with water. We’re given rice swimming in water and stinky chicken.” &nbsp; Those working with families in hotels reported that some parents have been found rummaging through bins to find food for their children and adults were losing as much as 10-15kg (22-33lbs) of weight.<\/p>\n","protected":false},"author":21,"featured_media":41987,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41982"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=41982"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41982\/revisions"}],"predecessor-version":[{"id":41986,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/41982\/revisions\/41986"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/41987"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=41982"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=41982"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=41982"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}