{"id":42003,"date":"2023-07-09T17:09:07","date_gmt":"2023-07-09T16:09:07","guid":{"rendered":"https:\/\/care4calais.org\/?p=42003"},"modified":"2023-07-09T17:09:07","modified_gmt":"2023-07-09T16:09:07","slug":"what-is-driving-refugee-deaths-in-calais","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/what-is-driving-refugee-deaths-in-calais\/","title":{"rendered":"What is driving refugee deaths in Calais?"},"content":{"rendered":"<div>\n<div dir=\"auto\">Another Sudanese refugee has been killed in Calais after being hit by a lorry he was trying to board. He was the third young Sudanese man to die this way since early May, and it is now impossible to ignore the British government’s influence on the atmosphere that is driving this increasingly horrific problem.<\/div>\n<\/div>\n<div>\n<div dir=\"auto\">The man, reportedly aged 26, died after trying to climb onto the lorry as it stopped at a roundabout at about 6.10am on Wednesday. He fell off, and was fatally struck. The lorry driver appeared not even to notice, and continued on his way.<\/div>\n<\/div>\n<div>\n<div dir=\"auto\">For someone to die like this after going through so much, and being so close to their destination, is heartbreaking.<\/div>\n<\/div>\n<div>\n<div dir=\"auto\">But the truth is that we are seeing more accidents like this.Our friends at @fast_calais see injuries related to falling from lorries constantly, and this week alone treated a broken hand, many injured knees and ankles, and hand injuries with infected wounds. They told us that as the police have become harsher in recent weeks, people appear to be taking bigger risks, meaning that injuries become more severe.<\/div>\n<\/div>\n<div>\n<div dir=\"auto\">Police brutality is making people even more desperate to get out of Calais, but from conversations with refugees we know the mood of anxiety and panic is also down to UK government action and rhetoric.<\/div>\n<\/div>\n<div>\n<div dir=\"auto\">People talk about wanting to reach the UK before the introduction of any laws that would mean deportation. Also, hearing about the increased hostility towards people arriving by boats, people are worried they will be not be allowed to claim asylum at all. When you cannot go home for fear of being imprisoned or killed, and you are stuck in northern France, there are just no other options.<\/div>\n<\/div>\n<div>\n<div dir=\"auto\">And so more people take more risks, and more people get hurt, and the injuries get worse and, ultimately, more people die.<\/div>\n<\/div>\n<div>\n<div dir=\"auto\">UK government ministers often seem to forget that their hateful rhetoric affects real people, but here in Calais we are seeing ample evidence that it does &#8211; and in the worst ways imaginable.<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Another Sudanese refugee has been killed in Calais after being hit by a lorry he was trying to board. He was the third young Sudanese man to die this way since early May, and it is now impossible to ignore the British government’s influence on the atmosphere that is driving this increasingly horrific problem. The man, reportedly aged 26, died after trying to climb onto the lorry as it stopped at a roundabout at about 6.10am on Wednesday. He fell off, and was fatally struck. The lorry driver appeared not even to notice, and continued on his way. For someone to die like this after going through so much, and being so close to their destination, is heartbreaking. But the truth is that we are seeing more accidents like this.Our friends at @fast_calais see injuries related to falling from lorries constantly, and this week alone treated a broken hand, many injured knees and ankles, and hand injuries with infected wounds. They told us that as the police have become harsher in recent weeks, people appear to be taking bigger risks, meaning that injuries become more severe. Police brutality is making people even more desperate to get out of Calais, but from conversations with refugees we know the mood of anxiety and panic is also down to UK government action and rhetoric. People talk about wanting to reach the UK before the introduction of any laws that would mean deportation. Also, hearing about the increased hostility towards people arriving by boats, people are worried they will be not be allowed to claim asylum at all. When you cannot go home for fear of being imprisoned or killed, and you are stuck in northern France, there are just no other options. And so more people take more risks, and more people get hurt, and the injuries get worse and, ultimately, more people die. UK government ministers often seem to forget that their hateful rhetoric affects real people, but here in Calais we are seeing ample evidence that it does &#8211; and in the worst ways imaginable.<\/p>\n","protected":false},"author":21,"featured_media":42005,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42003"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=42003"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42003\/revisions"}],"predecessor-version":[{"id":42007,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42003\/revisions\/42007"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/42005"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=42003"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=42003"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=42003"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}