{"id":42051,"date":"2023-07-14T19:35:03","date_gmt":"2023-07-14T18:35:03","guid":{"rendered":"https:\/\/care4calais.org\/?p=42051"},"modified":"2023-07-14T19:35:03","modified_gmt":"2023-07-14T18:35:03","slug":"shon-the-refugee-learning-to-fly-literally","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/shon-the-refugee-learning-to-fly-literally\/","title":{"rendered":"Shon, the refugee learning to fly &#8211; literally"},"content":{"rendered":"<p style=\"font-weight: 400;\">Shon, a refugee from Kenya who came to the UK with nothing after a traumatic journey from Africa, is now learning to fly – literally.<\/p>\n<p style=\"font-weight: 400;\">Shon dreamed of being a pilot when he was a little boy growing up in Kenya. After leaving education there he worked in cyber security, and then had to flee to the UK. His dream went hold for a while, as he felt “very down” when he arrived, but then he met a wonderful Care4Calais volunteer called Pauline. “Pauline encouraged to believe in the future again. Without her, I would not have been able to do anything. She is an angel.”<\/p>\n<p style=\"font-weight: 400;\">Eventually he was given permission to stay here, and began to do all sorts of jobs, from fork-lift driving to IT, all the time secretly saving up so he might be able to afford flying lessons. He somehow also found time to volunteer to help people suffering from addiction.<\/p>\n<p style=\"font-weight: 400;\">He began flying this summer, and loves it. “I love to look down and see the world. It looks so beautiful. I film it on my phone so I can watch later.<\/p>\n<p style=\"font-weight: 400;\">“It’s changed the way I see things. Up there you can see that things that look so big to us on the ground are really very small. Now I think of my challenges like that. They might feel big, but really they’re tiny so I can overcome them. It gives me a really positive vibe.”<\/p>\n<p style=\"font-weight: 400;\">Shon would love to get his pilot’s licence and fly passenger planes. In fact he feels that it’s his life’s calling, because it would mean “I can take people safely from one place to another. I can’t think what would be better. Freedom is paramount to me, and this is about freedom.<\/p>\n<p style=\"font-weight: 400;\">“I’m not learning to fly just for me, that would be selfish. I’m doing it because I’d like to make a positive impact on people’s lives.”<\/p>\n<p style=\"font-weight: 400;\">Care4Calais volunteers like Pauline really do change people’s lives every day. To volunteer with us, or to donate to support our work, please go to <a href=\"https:\/\/l.facebook.com\/l.php?u=http%3A%2F%2Fcare4calais.org%2Fget-involved%2F%3Ffbclid%3DIwAR1fUg6paizOPzjlIA-rJiGi6aImjFDC8vpLgvDwkJ215mTASL6JHz_Ibvs&amp;h=AT1HI6wuetoHBiPyQ2ONY5zl-BAAApNdKMM7d6YwAmvrIUN0fu004K9811LqcsL-rvmPwfXz5l7rz8NMF00raUlKYsBxdgjJc9x6MA_v_mS-oTGf2RNy7IqfZuk-0drmPa59EGkQng&amp;__tn__=-UK-R&amp;c%5b0%5d=AT28eiREsufVjW0Ql2hiNlNAOwUYIQFQfLdjLwR6--pcA4SoGAVajC0lJCVOhafRcd7Ia2WyEnrYh9rSrHoGBw4f2zs5IC1Xnb6ub7_CJFZp8WahNigsizCYRU-WREUMXKKLRuKJNpRvYVIwUqYVF8RCRsUiOwqo2iV7CNWf-0YL8hiLVtPD7xtc0pmyBqMabNlApX4TuhGZ\">care4calais.org\/get-involved\/<\/a><\/p>\n<p style=\"font-weight: 400;\">Some images have been changed<\/p>\n<p style=\"font-weight: 400;\">\n","protected":false},"excerpt":{"rendered":"<p>Shon, a refugee from Kenya who came to the UK with nothing after a traumatic journey from Africa, is now learning to fly – literally. Shon dreamed of being a pilot when he was a little boy growing up in Kenya. After leaving education there he worked in cyber security, and then had to flee to the UK. His dream went hold for a while, as he felt “very down” when he arrived, but then he met a wonderful Care4Calais volunteer called Pauline. “Pauline encouraged to believe in the future again. Without her, I would not have been able to do anything. She is an angel.” Eventually he was given permission to stay here, and began to do all sorts of jobs, from fork-lift driving to IT, all the time secretly saving up so he might be able to afford flying lessons. He somehow also found time to volunteer to help people suffering from addiction. He began flying this summer, and loves it. “I love to look down and see the world. It looks so beautiful. I film it on my phone so I can watch later. “It’s changed the way I see things. Up there you can see that things that look so big to us on the ground are really very small. Now I think of my challenges like that. They might feel big, but really they’re tiny so I can overcome them. It gives me a really positive vibe.” Shon would love to get his pilot’s licence and fly passenger planes. In fact he feels that it’s his life’s calling, because it would mean “I can take people safely from one place to another. I can’t think what would be better. Freedom is paramount to me, and this is about freedom. “I’m not learning to fly just for me, that would be selfish. I’m doing it because I’d like to make a positive impact on people’s lives.” Care4Calais volunteers like Pauline really do change people’s lives every day. To volunteer with us, or to donate to support our work, please go to care4calais.org\/get-involved\/ Some images have been changed<\/p>\n","protected":false},"author":21,"featured_media":42052,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42051"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=42051"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42051\/revisions"}],"predecessor-version":[{"id":42053,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42051\/revisions\/42053"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/42052"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=42051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=42051"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=42051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}