{"id":42177,"date":"2023-09-26T22:51:50","date_gmt":"2023-09-26T21:51:50","guid":{"rendered":"https:\/\/care4calais.org\/?p=42177"},"modified":"2023-09-26T22:51:50","modified_gmt":"2023-09-26T21:51:50","slug":"female-refugee-tragically-dies-on-calais-beach","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/female-refugee-tragically-dies-on-calais-beach\/","title":{"rendered":"Female refugee tragically dies on Calais beach"},"content":{"rendered":"<p>A 24-year-old woman from Eritrea has been found dead on a beach in Calais. It is thought she suffered a heart attack after the most horrific suffering during an attempted Channel crossing.<\/p>\n<p>Her husband, who was with her, told French reporters that the woman was trampled while in the boat. While unconscious, she was lifted out of the boat and dropped in the sea. Her husband leapt in after her, and brought her back to the beach. However emergency services were unable to revive her.<\/p>\n<p>Another refugee who can come ashore was also treated.<\/p>\n<p>Recently boats attempting to cross the Channel have been filled far beyond their capacity, with some veteran commentators suggesting the overcrowding has now reached levels previously unseen.<\/p>\n<p>The overcrowding and increasingly dangerous risk taking is thought to be partly driven by refugee&#8217;s fear and uncertainty about EU and UK refugee policies.<\/p>\n<p>This young woman&#8217;s agonising death on the Britain&#8217;s border follows the deaths of six Afghans in the Channel on August 12.<\/p>\n<p>The suffering of this woman, and of her husband, is unimaginable.<\/p>\n<p>For it to come on the same day that the UK Home Secretary Suella Braverman made a speech vilifying and demonising refugees makes it all the worse.<\/p>\n<p>Let us not forget, this awful death of a young woman on a French beach in the early hours of an autumn morning was entirely preventable. A modern, sensible system of safe passage would have meant she didn&#8217;t have to get in the boat in the first place.<\/p>\n<p>If Suella Braverman really wishes to reform refugee law for the better, she could begin there.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A 24-year-old woman from Eritrea has been found dead on a beach in Calais. It is thought she suffered a heart attack after the most horrific suffering during an attempted Channel crossing. Her husband, who was with her, told French reporters that the woman was trampled while in the boat. While unconscious, she was lifted out of the boat and dropped in the sea. Her husband leapt in after her, and brought her back to the beach. However emergency services were unable to revive her. Another refugee who can come ashore was also treated. Recently boats attempting to cross the Channel have been filled far beyond their capacity, with some veteran commentators suggesting the overcrowding has now reached levels previously unseen. The overcrowding and increasingly dangerous risk taking is thought to be partly driven by refugee&#8217;s fear and uncertainty about EU and UK refugee policies. This young woman&#8217;s agonising death on the Britain&#8217;s border follows the deaths of six Afghans in the Channel on August 12. The suffering of this woman, and of her husband, is unimaginable. For it to come on the same day that the UK Home Secretary Suella Braverman made a speech vilifying and demonising refugees makes it all the worse. Let us not forget, this awful death of a young woman on a French beach in the early hours of an autumn morning was entirely preventable. A modern, sensible system of safe passage would have meant she didn&#8217;t have to get in the boat in the first place. If Suella Braverman really wishes to reform refugee law for the better, she could begin there.<\/p>\n","protected":false},"author":21,"featured_media":42179,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[286,104,276],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42177"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=42177"}],"version-history":[{"count":1,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42177\/revisions"}],"predecessor-version":[{"id":42180,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42177\/revisions\/42180"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/42179"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=42177"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=42177"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=42177"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}