{"id":42293,"date":"2023-10-26T08:37:48","date_gmt":"2023-10-26T07:37:48","guid":{"rendered":"https:\/\/care4calais.org\/?p=42293"},"modified":"2023-10-26T08:43:38","modified_gmt":"2023-10-26T07:43:38","slug":"our-challenge-to-government-segregation-of-asylum-seekers","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/our-challenge-to-government-segregation-of-asylum-seekers\/","title":{"rendered":"Our legal challenge to Government segregation of asylum seekers"},"content":{"rendered":"<p>Since July 2023, this Government has been housing asylum seekers in prison-like conditions.<\/p>\n<p>At former RAF base in Wethersfield, Essex, they are<\/p>\n<p>• surrounded by security fences<br \/>\n• monitored with 24\/7 surveillance by on-site security guards and CCTV<br \/>\n• prevented from leaving except by an infrequent bus service<br \/>\n• kept on a remote site with no pedestrian access or public transport<\/p>\n<p>This is a form of segregation.<\/p>\n<p>Suella Braverman, the Home Secretary, is obliged by law to &#8216;provide accommodation that ‘ensures a standard of living adequate for the health of the claimants and capable of ensuring their subsistence’.<\/p>\n<p>At Wethersfield she isn&#8217;t doing that.<\/p>\n<p>She is also separating asylum seekers from the local community.<\/p>\n<p>At Wethersfield, they are segregated from the mainstream population in ways that and stigmatise and degrade them, and eat away at their dignity.<\/p>\n<p>Wethersfield residents have consistently told our volunteers that living at the site ‘feels like being imprisoned’.<\/p>\n<p>This is not just about Wethersfield.<\/p>\n<p>The issues of segregation and quasi-detention have implications for the Government’s use of other sites such as the Bibby Stockholm and RAF Scampton.<\/p>\n<p>We are also challenging the lack of an effective screening process for selecting asylum seekers for Wethersfield.<\/p>\n<p>The Home Secretary has acknowledged a high risk of physical and mental vulnerability in asylum seekers, making sites such as Wethersfield and the Bibby Stockholm unsuitable.<\/p>\n<p>The suitability criteria for these sites say survivors of torture or modern slavery, or those who suffer from serious mental health concerns, should not be sent.<\/p>\n<p>But over asylum seekers who have experienced these ‘vulnerabilities’ routinely being sent to Wethersfield.<\/p>\n<p>This has to stop.<\/p>\n<p>Under previous Governments, asylum seekers were integrated into UK communities through dispersal accommodation.<\/p>\n<p>But this Government has given up any pretence of trying to integrate asylum seekers into society by putting them in de facto prison camps and barges.<\/p>\n<p>Falsely imprisoning asylum seekers behind barbed wire fences, placing them under 24\/7 surveillance, restricting their liberty and separating them from any semblance of community, is now the chosen policy of this Government.<\/p>\n<p>And we believe it is unlawful.<\/p>\n<p>So today we are putting the Government on notice.<\/p>\n<p>Stop imprisoning asylum seekers in camps and barges, and close these sites of segregation.<\/p>\n<p>Start tackling the REAL problems in the UK’s asylum system.<\/p>\n<p>If they don’t we will see them in court.<\/p>\n<p>Please donate to support this legal challenge to segregation: <a href=\"http:\/\/crowdjustice.com\/case\/c4cwethersfield\/\">crowdjustice.com\/case\/c4cwethersfield\/<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since July 2023, this Government has been housing asylum seekers in prison-like conditions. At former RAF base in Wethersfield, Essex, they are • surrounded by security fences • monitored with 24\/7 surveillance by on-site security guards and CCTV • prevented from leaving except by an infrequent bus service • kept on a remote site with no pedestrian access or public transport This is a form of segregation. Suella Braverman, the Home Secretary, is obliged by law to &#8216;provide accommodation that ‘ensures a standard of living adequate for the health of the claimants and capable of ensuring their subsistence’. At Wethersfield she isn&#8217;t doing that. She is also separating asylum seekers from the local community. At Wethersfield, they are segregated from the mainstream population in ways that and stigmatise and degrade them, and eat away at their dignity. Wethersfield residents have consistently told our volunteers that living at the site ‘feels like being imprisoned’. This is not just about Wethersfield. The issues of segregation and quasi-detention have implications for the Government’s use of other sites such as the Bibby Stockholm and RAF Scampton. We are also challenging the lack of an effective screening process for selecting asylum seekers for Wethersfield. The Home Secretary has acknowledged a high risk of physical and mental vulnerability in asylum seekers, making sites such as Wethersfield and the Bibby Stockholm unsuitable. The suitability criteria for these sites say survivors of torture or modern slavery, or those who suffer from serious mental health concerns, should not be sent. But over asylum seekers who have experienced these ‘vulnerabilities’ routinely being sent to Wethersfield. This has to stop. Under previous Governments, asylum seekers were integrated into UK communities through dispersal accommodation. But this Government has given up any pretence of trying to integrate asylum seekers into society by putting them in de facto prison camps and barges. Falsely imprisoning asylum seekers behind barbed wire fences, placing them under 24\/7 surveillance, restricting their liberty and separating them from any semblance of community, is now the chosen policy of this Government. And we believe it is unlawful. So today we are putting the Government on notice. Stop imprisoning asylum seekers in camps and barges, and close these sites of segregation. Start tackling the REAL problems in the UK’s asylum system. If they don’t we will see them in court. Please donate to support this legal challenge to segregation: crowdjustice.com\/case\/c4cwethersfield\/ &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":42294,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[287],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42293"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=42293"}],"version-history":[{"count":5,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42293\/revisions"}],"predecessor-version":[{"id":42299,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42293\/revisions\/42299"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/42294"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=42293"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=42293"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=42293"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}