{"id":42341,"date":"2023-11-23T16:21:09","date_gmt":"2023-11-23T15:21:09","guid":{"rendered":"https:\/\/care4calais.org\/?p=42341"},"modified":"2023-11-23T18:21:22","modified_gmt":"2023-11-23T17:21:22","slug":"channel-tragedy-we-can-and-must-do-better","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/channel-tragedy-we-can-and-must-do-better\/","title":{"rendered":"Channel Tragedy: We Can and Must Do Better"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p style=\"font-weight: 400;\">On November 24th, 2021, a group of people – each unique and dearly loved – slowly froze to death in the icy waters of the English Channel while waiting for a rescue that never came.<\/p>\n<p style=\"font-weight: 400;\">Twenty-seven bodies were recovered and four are still missing, adding to the pain of the families  –  twenty-one men, seven women including one who was pregnant, and three children.<\/p>\n<p style=\"font-weight: 400;\">Today, two years on from this tragedy, we remember and honour them, alongside many more precious lives lost on dangerous journeys to the UK &#8211; we may never know exactly how many.<\/p>\n<p style=\"font-weight: 400;\">On that catastrophic night, their flimsy boat left France at around 10pm, but close to midnight, it began to deflate and sink in the middle of the Channel.<\/p>\n<p style=\"font-weight: 400;\">Between 2am and 4am, the passengers called the French and English authorities many times begging for help. But no one came.<\/p>\n<p style=\"font-weight: 400;\">The French authorities told them they were in British waters, and British officials told them they were in French waters. The transcripts of those desperate calls make for difficult reading – one passenger indicates that they are literally “in the water”. “Yes, but you are in English waters, Sir,” is the reply.<\/p>\n<p style=\"font-weight: 400;\">At around 3am the boat overturned, tipping all passengers into the water, where some drowned because of the waves. Over time, others resigned themselves to letting go as they were overwhelmed by the cold.<\/p>\n<p style=\"font-weight: 400;\">Eleven hours later – at 2pm the next day – a French fisherman spotted the bodies in the water and raised the alarm. When the French coastguard finally arrived, they found only two survivors.<\/p>\n<p style=\"font-weight: 400;\">We will never let the lives lost that night, or those of loved ones lost since, be forgotten. And for their families, we demand justice and change.<\/p>\n<p style=\"font-weight: 400;\">We long for people seeking safety on British shores to be seen as human beings, deserving of rights, compassion and dignity. Tragedies like this occur because of the ‘othering’ our politicians insist on – of the dehumanising of sons and fathers, mothers and daughters, friends and family members.<\/p>\n<p style=\"font-weight: 400;\">This rhetoric must change.<\/p>\n<p style=\"font-weight: 400;\">And so must this government’s policies.<\/p>\n<p style=\"font-weight: 400;\">Humans in search of safety deserve just that. This means safe routes for all refugees wishing to come to the UK – we need to improve resettlement and refugee family reunion schemes and make it easier for people to travel to the UK to claim asylum. That is the only way these tragedies will end.<\/p>\n<p style=\"font-weight: 400;\">We stand alongside the families of the victims, as they demand answers as to why French and British authorities failed desperate people who came asking for help. They also need to know when the results of the Article 2 Inquiry will be made public. The families have already waited two long years and deserve answers.<\/p>\n<p style=\"font-weight: 400;\">As a society that values compassion, we know that people fleeing the worst the world has to offer should be met with kindness. So, we demand that the division and fear of anti-migrant rhetoric used by some political leaders, is replaced with the empathy and respect that many people and communities across Britain show to refugees every day.<\/p>\n<p style=\"font-weight: 400;\">We can, and must do better : people’s lives depend on it.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<table>\n<tbody>\n<tr>\n<th>Signatories<\/th>\n<th><\/th>\n<\/tr>\n<tr>\n<td>Zana Mamand Mohammad relative of<\/td>\n<td>Twana Mamand Mohammad<\/td>\n<\/tr>\n<tr>\n<td>Mstafa Mina Nabi relative of<\/td>\n<td>Zaniar Mstafa Mina<\/td>\n<\/tr>\n<tr>\n<td>Rasul Farkha Husein relative of<\/td>\n<td>Pshtiwan Rasul Farkha<\/td>\n<\/tr>\n<tr>\n<td>Saman Abubakir Alipour  relative of<\/td>\n<td>Sirwan Abubakir Alipour<\/td>\n<\/tr>\n<tr>\n<td>Husen Mohammad relative of<\/td>\n<td>Mahammad Husen Mohammad<\/td>\n<\/tr>\n<tr>\n<td>Sarhad Pirot Mohammad relative of<\/td>\n<td>Sarkawt Pirot Mohammad<\/td>\n<\/tr>\n<tr>\n<td>Shamal Ali Pirot relative of<\/td>\n<td>Shakar Ali Pirot<\/td>\n<\/tr>\n<tr>\n<td>Ahmad Mohammad Akoyi relative of<\/td>\n<td>Afrasia Ahmad Mohammad<\/td>\n<\/tr>\n<tr>\n<td>Abdulkarim Hamd Abdulrahman relative of<\/td>\n<td>Bryar Hamd Abdulrahman<\/td>\n<\/tr>\n<tr>\n<td>Ismail Hamd Qadir relative of<\/td>\n<td>Muslim Ismail Hamd<\/td>\n<\/tr>\n<tr>\n<td>Rizgar Husen Hamd relative of<\/td>\n<td>Kajal Ahmad Khizir<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td>Hadye Rizgar Husen<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td>Mubin Rizhar Husen<\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td>Hasti Rizgar Husen<\/td>\n<\/tr>\n<tr>\n<td>Yasin Husen Hamd relative of<\/td>\n<td>Rezhwan Yasin Hasan<\/td>\n<\/tr>\n<tr>\n<td>Qadir Abdullah relative of<\/td>\n<td>Mohammad Qadir Abdullah<\/td>\n<\/tr>\n<tr>\n<td>Omar Mohammed relative of<\/td>\n<td>Hassan Mohammed Ali<\/td>\n<\/tr>\n<tr>\n<td>Ali Mohammed relative of<\/td>\n<td>Hassan Mohammed Ali<\/td>\n<\/tr>\n<tr>\n<td>Emebet Kefyalew Gizaw relative of<\/td>\n<td>Fikeru Shiferaw Tekalegn<\/td>\n<\/tr>\n<tr>\n<td>Calais Appeal<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Care4Calais<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Freedom From Torture<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Refugee Action<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Refugee Council<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Safe Passage<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Scottish Refugee Council<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Action Foundation<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Big Leaf Foundation<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Cambridge Convoy Refugee Action Group<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>CARAS<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>City of Sanctuary UK<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Da&#39;aro Youth Project<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>FODI (Friends of the Drop In for asylum seekers and refugees)<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Gatwick Detainees Welfare Group<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td><\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Govan Community Project<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Greater Manchester Immigration Aid Unit (GMIAU)<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Haringey Welcome<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Helen Bamber Foundation<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>IMIX<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>KRAN (Kent Refugee Action Network)<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>NACCOM<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>New to the UK<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>No To Hassockfield<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Our Second Home<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Praxis<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Reclaim The Sea<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Refugee and Migrants Forum of Essex and London (RAMFEL)<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Refugee Futures<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Refugee Support Group (Berkshire)<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>St Augustine&#39;s Centre<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Stockton Saint Peter&#39;s Church<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Student Action for Refugees (STAR)<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Tees Valley of Sanctuary<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>The Pickwell Foundation<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Walking With<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Wearside Amnesty<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Women for Refugee Women<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Young Roots<\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p style=\"font-weight: 400;\"><br style=\"font-weight: 400;\" \/><br style=\"font-weight: 400;\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; On November 24th, 2021, a group of people – each unique and dearly loved – slowly froze to death in the icy waters of the English Channel while waiting for a rescue that never came. Twenty-seven bodies were recovered and four are still missing, adding to the pain of the families  –  twenty-one men, seven women including one who was pregnant, and three children. Today, two years on from this tragedy, we remember and honour them, alongside many more precious lives lost on dangerous journeys to the UK &#8211; we may never know exactly how many. On that catastrophic night, their flimsy boat left France at around 10pm, but close to midnight, it began to deflate and sink in the middle of the Channel. Between 2am and 4am, the passengers called the French and English authorities many times begging for help. But no one came. The French authorities told them they were in British waters, and British officials told them they were in French waters. The transcripts of those desperate calls make for difficult reading – one passenger indicates that they are literally “in the water”. “Yes, but you are in English waters, Sir,” is the reply. At around 3am the boat overturned, tipping all passengers into the water, where some drowned because of the waves. Over time, others resigned themselves to letting go as they were overwhelmed by the cold. Eleven hours later – at 2pm the next day – a French fisherman spotted the bodies in the water and raised the alarm. When the French coastguard finally arrived, they found only two survivors. We will never let the lives lost that night, or those of loved ones lost since, be forgotten. And for their families, we demand justice and change. We long for people seeking safety on British shores to be seen as human beings, deserving of rights, compassion and dignity. Tragedies like this occur because of the ‘othering’ our politicians insist on – of the dehumanising of sons and fathers, mothers and daughters, friends and family members. This rhetoric must change. And so must this government’s policies. Humans in search of safety deserve just that. This means safe routes for all refugees wishing to come to the UK – we need to improve resettlement and refugee family reunion schemes and make it easier for people to travel to the UK to claim asylum. That is the only way these tragedies will end. We stand alongside the families of the victims, as they demand answers as to why French and British authorities failed desperate people who came asking for help. They also need to know when the results of the Article 2 Inquiry will be made public. The families have already waited two long years and deserve answers. As a society that values compassion, we know that people fleeing the worst the world has to offer should be met with kindness. So, we demand that the division and fear of anti-migrant rhetoric used by some political leaders, is replaced with the empathy and respect that many people and communities across Britain show to refugees every day. We can, and must do better : people’s lives depend on it. &nbsp; &nbsp; Signatories Zana Mamand Mohammad relative of Twana Mamand Mohammad Mstafa Mina Nabi relative of Zaniar Mstafa Mina Rasul Farkha Husein relative of Pshtiwan Rasul Farkha Saman Abubakir Alipour  relative of Sirwan Abubakir Alipour Husen Mohammad relative of Mahammad Husen Mohammad Sarhad Pirot Mohammad relative of Sarkawt Pirot Mohammad Shamal Ali Pirot relative of Shakar Ali Pirot Ahmad Mohammad Akoyi relative of Afrasia Ahmad Mohammad Abdulkarim Hamd Abdulrahman relative of Bryar Hamd Abdulrahman Ismail Hamd Qadir relative of Muslim Ismail Hamd Rizgar Husen Hamd relative of Kajal Ahmad Khizir Hadye Rizgar Husen Mubin Rizhar Husen Hasti Rizgar Husen Yasin Husen Hamd relative of Rezhwan Yasin Hasan Qadir Abdullah relative of Mohammad Qadir Abdullah Omar Mohammed relative of Hassan Mohammed Ali Ali Mohammed relative of Hassan Mohammed Ali Emebet Kefyalew Gizaw relative of Fikeru Shiferaw Tekalegn Calais Appeal Care4Calais Freedom From Torture Refugee Action Refugee Council Safe Passage Scottish Refugee Council Action Foundation Big Leaf Foundation Cambridge Convoy Refugee Action Group CARAS City of Sanctuary UK Da&#39;aro Youth Project FODI (Friends of the Drop In for asylum seekers and refugees) Gatwick Detainees Welfare Group Govan Community Project Greater Manchester Immigration Aid Unit (GMIAU) Haringey Welcome Helen Bamber Foundation IMIX KRAN (Kent Refugee Action Network) NACCOM New to the UK No To Hassockfield Our Second Home Praxis Reclaim The Sea Refugee and Migrants Forum of Essex and London (RAMFEL) Refugee Futures Refugee Support Group (Berkshire) St Augustine&#39;s Centre Stockton Saint Peter&#39;s Church Student Action for Refugees (STAR) Tees Valley of Sanctuary The Pickwell Foundation Walking With Wearside Amnesty Women for Refugee Women Young Roots<\/p>\n","protected":false},"author":21,"featured_media":42353,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[286,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42341"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=42341"}],"version-history":[{"count":11,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42341\/revisions"}],"predecessor-version":[{"id":42355,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42341\/revisions\/42355"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/42353"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=42341"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=42341"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=42341"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}