{"id":42833,"date":"2024-01-15T22:07:21","date_gmt":"2024-01-15T21:07:21","guid":{"rendered":"https:\/\/care4calais.org\/?p=42833"},"modified":"2024-01-15T22:09:33","modified_gmt":"2024-01-15T21:09:33","slug":"reflections-on-the-deaths-at-wimeraux","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/reflections-on-the-deaths-at-wimeraux\/","title":{"rendered":"The Significance of the Refugee Deaths at Wimeraux"},"content":{"rendered":"<p style=\"font-weight: 400;\">Tonight at the vigil for the five young Syrians who died at Wimereux on Sunday, I met the brother of one the people who was lost. He is still shocked and numb, disbelieving that the journey they made together has ended like this, in horror just 20 miles from their destination. He is in his twenties, now left alone in Calais – the rest of his family are still in Syria.<\/p>\n<p style=\"font-weight: 400;\">His brother was 14 years old.<\/p>\n<p style=\"font-weight: 400;\">In the biting cold and dark, you could feel how Sunday&#8217;s tragedy, together with numerous other rescues and near-fatalities along the coast, has hit Calais hard.<\/p>\n<p style=\"font-weight: 400;\">Perhaps that&#8217;s because of the awful way these young people died in the icy cold sea.<\/p>\n<p style=\"font-weight: 400;\">Perhaps we&#8217;d all begun the year subconsciously hoping 2024 would somehow be better.<\/p>\n<p style=\"font-weight: 400;\">For me it&#8217;s all this, but it&#8217;s also the growing awareness of the violent forces behind this tragedy.<\/p>\n<p style=\"font-weight: 400;\">It is impossible to say for certain how many people waiting to cross from north France to the UK die in each year, but most of those who try to keep count put the figure at around 30. They would also roughly agree on that being a 30% increase on 2022.<\/p>\n<p style=\"font-weight: 400;\">That&#8217;s a similar figure to the 36% decrease in the number of people arriving in the UK safely by small boat in 2023; somehow it seems not entirely coincidental.<\/p>\n<p style=\"font-weight: 400;\">Since last summer the authorities in France have been more aggressive and intimidatory in their evictions, harassment of refugees and aid workers, and prevention of departures in small boats. We meet people whose boats have been slashed in the water. We know people have died in panics instigated by riot police. We know groups are leaving from less-policed places, making longer and more dangerous journeys.<\/p>\n<p style=\"font-weight: 400;\">People take greater risks, and suffer worse attacks. Hardly surprising, then, that the death and injury counts rise.<\/p>\n<p style=\"font-weight: 400;\">The UK and French authorities sanitise all this by crediting technology. The UK paid France €72.2m to police its border in 2022-23, and last Louis-Xavier Thirode, Prefect Delegate for Security, claimed it was new drones, vehicles and night-vision tech that had allowed him to reduce the crossings. It sounded so much nicer than beatings and boat-slashing.<\/p>\n<p style=\"font-weight: 400;\">To us here it seems very much that any reduction in small boat crossings is being bought with old fashioned violence and intimidation towards Calais refugees. And that makes it clearer than ever that the only way of ever reducing them safely will be by introducing safe routes.<\/p>\n<p style=\"font-weight: 400;\">Until that happens, I am deeply sorry to say, we will continue to gather at vigils in the cold and dark in Calais, listening to laments for brothers and sisters and friends among the Calais refugees who sought only a safer and more normal life.<\/p>\n<p style=\"font-weight: 400;\">Imogen Hardman, Care4Calais Senior Operations Manager, Calais<\/p>\n<p style=\"font-weight: 400;\">Support our campaign for safe routes for refugees: <a href=\"http:\/\/care4calais.org\/safepassage\/?fbclid=IwAR2jc12hCnKdqRXrhvoMSNSROCdtg8H4Gdb_X9dWQKatsN8km9zvPKI5BsE\">care4calais.org\/safepassage\/<\/a><\/p>\n<p style=\"font-weight: 400;\">\n","protected":false},"excerpt":{"rendered":"<p>Tonight at the vigil for the five young Syrians who died at Wimereux on Sunday, I met the brother of one the people who was lost. He is still shocked and numb, disbelieving that the journey they made together has ended like this, in horror just 20 miles from their destination. He is in his twenties, now left alone in Calais – the rest of his family are still in Syria. His brother was 14 years old. In the biting cold and dark, you could feel how Sunday&#8217;s tragedy, together with numerous other rescues and near-fatalities along the coast, has hit Calais hard. Perhaps that&#8217;s because of the awful way these young people died in the icy cold sea. Perhaps we&#8217;d all begun the year subconsciously hoping 2024 would somehow be better. For me it&#8217;s all this, but it&#8217;s also the growing awareness of the violent forces behind this tragedy. It is impossible to say for certain how many people waiting to cross from north France to the UK die in each year, but most of those who try to keep count put the figure at around 30. They would also roughly agree on that being a 30% increase on 2022. That&#8217;s a similar figure to the 36% decrease in the number of people arriving in the UK safely by small boat in 2023; somehow it seems not entirely coincidental. Since last summer the authorities in France have been more aggressive and intimidatory in their evictions, harassment of refugees and aid workers, and prevention of departures in small boats. We meet people whose boats have been slashed in the water. We know people have died in panics instigated by riot police. We know groups are leaving from less-policed places, making longer and more dangerous journeys. People take greater risks, and suffer worse attacks. Hardly surprising, then, that the death and injury counts rise. The UK and French authorities sanitise all this by crediting technology. The UK paid France €72.2m to police its border in 2022-23, and last Louis-Xavier Thirode, Prefect Delegate for Security, claimed it was new drones, vehicles and night-vision tech that had allowed him to reduce the crossings. It sounded so much nicer than beatings and boat-slashing. To us here it seems very much that any reduction in small boat crossings is being bought with old fashioned violence and intimidation towards Calais refugees. And that makes it clearer than ever that the only way of ever reducing them safely will be by introducing safe routes. Until that happens, I am deeply sorry to say, we will continue to gather at vigils in the cold and dark in Calais, listening to laments for brothers and sisters and friends among the Calais refugees who sought only a safer and more normal life. Imogen Hardman, Care4Calais Senior Operations Manager, Calais Support our campaign for safe routes for refugees: care4calais.org\/safepassage\/<\/p>\n","protected":false},"author":21,"featured_media":42834,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,17],"tags":[22,165,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42833"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=42833"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42833\/revisions"}],"predecessor-version":[{"id":42837,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42833\/revisions\/42837"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/42834"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=42833"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=42833"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=42833"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}