{"id":42838,"date":"2024-01-16T20:23:02","date_gmt":"2024-01-16T19:23:02","guid":{"rendered":"https:\/\/care4calais.org\/?p=42838"},"modified":"2024-01-16T20:23:23","modified_gmt":"2024-01-16T19:23:23","slug":"calais-brutality-continues-despite-weather","status":"publish","type":"post","link":"https:\/\/care4calais.org\/news\/calais-brutality-continues-despite-weather\/","title":{"rendered":"Calais Brutality Continues Despite Weather"},"content":{"rendered":"<p>Today temperatures are plunging back below freezing, and there is widespread fear that the region will be soon hit by snow. The authorities have announced they will open more shelters for children and women, and keep open the small number of spaces for men. Out on our emergency distributions of warm clothing, our volunteers have been translating the announcements for the refugees we meet.<\/p>\n<p>Many people told us today that the problem with the shelters is that they cannot take their tents with them, and if they go, the police come to the sites and confiscate those tents. Today during our distribution the police turned up and took at least two tents from a site. I spoke with people as we watched it happen, and they how aggressive the police are, and how they always turn up whatever the weather.<\/p>\n<p>Refugees here have no respite from the harassment and brutality, not even when the world is frozen.<\/p>\n<p>This afternoon, thanks to your support, we distributed 289 pairs of warm joggers. These are so important because so many of the people we meet are wearing just thin, ripped and wet trackpants or jeans. The guys we gave them to were incredibly relieved to have them, and many people went off the change straight away.<\/p>\n<p>Although there are newly-arrived people wearing too-thin summer clothes and damp, falling-apart shoes, we saw lots of people wearing the warm fleeces, coats and boots we&#8217;ve been able to share. Seeing that we&#8217;re having an effect and supporting people gave us an extra shot of determination to keep going and help people keep off the cold as much as possible.<\/p>\n<p>The ground everywhere now is covered in white frost most of the time, and frozen hard as iron. The cold pinches your skin and makes you hungry in the day, and people today told us it&#8217;s so cold at night they can&#8217;t sleep.<\/p>\n<p>No one should be living like this, and our fantastic volunteers are doing all they can to help.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today temperatures are plunging back below freezing, and there is widespread fear that the region will be soon hit by snow. The authorities have announced they will open more shelters for children and women, and keep open the small number of spaces for men. Out on our emergency distributions of warm clothing, our volunteers have been translating the announcements for the refugees we meet. Many people told us today that the problem with the shelters is that they cannot take their tents with them, and if they go, the police come to the sites and confiscate those tents. Today during our distribution the police turned up and took at least two tents from a site. I spoke with people as we watched it happen, and they how aggressive the police are, and how they always turn up whatever the weather. Refugees here have no respite from the harassment and brutality, not even when the world is frozen. This afternoon, thanks to your support, we distributed 289 pairs of warm joggers. These are so important because so many of the people we meet are wearing just thin, ripped and wet trackpants or jeans. The guys we gave them to were incredibly relieved to have them, and many people went off the change straight away. Although there are newly-arrived people wearing too-thin summer clothes and damp, falling-apart shoes, we saw lots of people wearing the warm fleeces, coats and boots we&#8217;ve been able to share. Seeing that we&#8217;re having an effect and supporting people gave us an extra shot of determination to keep going and help people keep off the cold as much as possible. The ground everywhere now is covered in white frost most of the time, and frozen hard as iron. The cold pinches your skin and makes you hungry in the day, and people today told us it&#8217;s so cold at night they can&#8217;t sleep. No one should be living like this, and our fantastic volunteers are doing all they can to help. &nbsp;<\/p>\n","protected":false},"author":21,"featured_media":42842,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,17],"tags":[22,70],"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42838"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=42838"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42838\/revisions"}],"predecessor-version":[{"id":42844,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/posts\/42838\/revisions\/42844"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/42842"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=42838"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/categories?post=42838"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/tags?post=42838"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}