{"id":11146,"date":"2018-11-29T22:33:02","date_gmt":"2018-11-29T22:33:02","guid":{"rendered":"https:\/\/care4calais.org\/?page_id=11146"},"modified":"2023-10-17T12:44:08","modified_gmt":"2023-10-17T11:44:08","slug":"shop-terms-and-conditions","status":"publish","type":"page","link":"https:\/\/care4calais.org\/policies\/shop-terms-and-conditions\/","title":{"rendered":"Shop Terms and Conditions"},"content":{"rendered":"<p><b>General<\/b><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">This website is run by Care4Calais.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">All distance orders will be confirmed in writing, either by email or by post.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Deliveries may require a signature at point of delivery.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">None of the above affects your statutory rights or your manufacturer’s warranty.<\/span><\/li>\n<\/ul>\n<p><b>Distance Selling Regulations<\/b><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">We strictly abide by Consumer Contracts Regulations 2013 which can be found on the Government website: <\/span><a href=\"http:\/\/www.legislation.gov.uk\/\"><span style=\"font-weight: 400;\">http:\/\/www.legislation.gov.uk<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">We are committed to protecting your privacy. We will only use the information that we collect about you lawfully (in accordance with the Data Protection Act 1998).<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Care4Calais will collect information about you to process your order and for our own. Your information maybe passed on to third party suppliers for the purposes of processing your order.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The information we will collect about you includes:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">your name<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">address<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">delivery address (if required)<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">phone number(s)<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">e-mail address<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">product(s) ordered<\/span><\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The information we hold will be accurate and up to date. You can check the information that we hold about you by emailing us. If you find any inaccuracies we will delete or correct it promptly.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Our select third parties and their privacy policies are:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">TwoFifteen <\/span><a href=\"https:\/\/www.twofifteen.co.uk\/privacy-policy\"><span style=\"font-weight: 400;\">https:\/\/www.twofifteen.co.uk\/privacy-policy<\/span><\/a><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Pwinty <\/span><a href=\"http:\/\/pwinty.com\/privacy-and-cookie-policy\"><span style=\"font-weight: 400;\">http:\/\/pwinty.com\/privacy-and-cookie-policy<\/span><\/a><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Printify <\/span><a href=\"https:\/\/printify.com\/privacy-policy\"><span style=\"font-weight: 400;\">https:\/\/printify.com\/privacy-policy<\/span><\/a><\/li>\n<li>Inkthreadable <a href=\"https:\/\/www.inkthreadable.co.uk\/privacy-policy\">https:\/\/www.inkthreadable.co.uk\/privacy-policy<\/a><\/li>\n<li>Snuggle <a href=\"https:\/\/snugglepartners.co.uk\/privacy-policy\">https:\/\/snugglepartners.co.uk\/privacy-policy<\/a><\/li>\n<\/ul>\n<p><strong>Shipping Information<\/strong><\/p>\n<p>At the Care4Calais Shop, we utilise a variety of suppliers (mentioned above) to allow us to fulfil your order. Because of this you may find that you receive multiple parcels at differing times. Unfortunately at the point of order we are unable to specify how many parcels you will receive. All physical products are made at the point of order, and we do not hold stock of them. Typically all items are printed and dispatched with 5 to 7 working days of placing order (subject to demand and availability). Dispatch times may also vary demanding on demand and location. We intended to have orders fulfilled and dispatched in time frames set out below:<\/p>\n<ul>\n<li><strong>UK Delivery Address &#8211;<\/strong> 5 to 7 working days<\/li>\n<li><strong>EU Delivery Address &#8211; <\/strong>10 to 14 working days<\/li>\n<li><strong>Non-EU Delivery Address &#8211;<\/strong> 10 to 30 working days<\/li>\n<\/ul>\n<p>If you&#8217;re concerned about the status of your order, please contact us. The easiest way to contact us is to reply to your order confirmation email. That we can locate your order quickly.<\/p>\n<p><b>Complaints Procedure<\/b><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Complaints and queries can be made via email, letter or in person.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">All complaints will receive our immediate attention. We will endeavour to respond with an acknowledgement of receipt within 3 – 5 days. We will aim to resolve any query or complaint to your satisfaction within working 10 days. If the resolution of your complaint involves a new product being dispatched we will advise you of an approximate dispatch and delivery date.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">During the process we will endeavour to keep you informed as to the progress of the complaint. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">All complaints are totally confidential. If you have any questions\/comments about privacy or security, you should <a href=\"https:\/\/care4calais.org\/contact-us\/\"><strong>contact us here<\/strong><\/a>.<\/span><\/li>\n<\/ul>\n<p><b>Promotional Offers<\/b><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">From time to time we will run promotional offers.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Offers are for a limited period only and are subject to availability.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Any discounts shown, whether specific amounts or percentages off, apply to the value of the goods and not the delivery charge.<\/span><\/li>\n<\/ul>\n<p><b>Returns and Refunds<\/b><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">If the produced order does not meet your expectations, you must first contact Care4Calais within 30 days of product delivery. In order to best resolve the matter, you should provide all relevant materials for Care4Calais to investigate the issue, including a description of the Produced Order, the issue, and quantity of products affected. Within your email please include the following:<\/span><\/li>\n<\/ul>\n<ol>\n<li><span style=\"font-weight: 400;\"> Your Order Reference Number<\/span><\/li>\n<li><span style=\"font-weight: 400;\"> Item(s) concerned<\/span><\/li>\n<li><span style=\"font-weight: 400;\"> Your full name as detailed on your order<\/span><\/li>\n<li><span style=\"font-weight: 400;\"> A daytime contact number<\/span><\/li>\n<li><span style=\"font-weight: 400;\"> The issue with the goods purchased (ie. wrong item, not compatible, faulty, not required, not what I wanted).<\/span><\/li>\n<li><span style=\"font-weight: 400;\"> Please advise if the goods are: unopened and unused, opened and unused, used and undamaged, used with wear.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">A representative from Care4Calais will contact you in relation to the next steps.<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Products are unique and produced to order, therefore, they are non-refundable. Once an Order has been sent to production it is sent to the Provider you can no longer edit the details of the Order or cancel it. If the shipment details are incorrect, or the you have ordered the wrong size or colour, Care4Calais is not responsible and will not offer replacements or refunds.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">After investigating your issue, if Care4Calais determines that your product is faulty, your orders will be submitted for either reprint or replacement. Refunds are only provided if a subsequent reprint or replacement is also found to be faulty by Care4Calais. Refunds will be issued by the payment method originally used to place the order.<\/span><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>General This website is run by Care4Calais. All distance orders will be confirmed in writing, either by email or by post. Deliveries may require a signature at point of delivery. None of the above affects your statutory rights or your manufacturer’s warranty. Distance Selling Regulations We strictly abide by Consumer Contracts Regulations 2013 which can be found on the Government website: http:\/\/www.legislation.gov.uk. We are committed to protecting your privacy. We will only use the information that we collect about you lawfully (in accordance with the Data Protection Act 1998). Care4Calais will collect information about you to process your order and for our own. Your information maybe passed on to third party suppliers for the purposes of processing your order. The information we will collect about you includes: your name address delivery address (if required) phone number(s) e-mail address product(s) ordered The information we hold will be accurate and up to date. You can check the information that we hold about you by emailing us. If you find any inaccuracies we will delete or correct it promptly. Our select third parties and their privacy policies are: TwoFifteen https:\/\/www.twofifteen.co.uk\/privacy-policy Pwinty http:\/\/pwinty.com\/privacy-and-cookie-policy Printify https:\/\/printify.com\/privacy-policy Inkthreadable https:\/\/www.inkthreadable.co.uk\/privacy-policy Snuggle https:\/\/snugglepartners.co.uk\/privacy-policy Shipping Information At the Care4Calais Shop, we utilise a variety of suppliers (mentioned above) to allow us to fulfil your order. Because of this you may find that you receive multiple parcels at differing times. Unfortunately at the point of order we are unable to specify how many parcels you will receive. All physical products are made at the point of order, and we do not hold stock of them. Typically all items are printed and dispatched with 5 to 7 working days of placing order (subject to demand and availability). Dispatch times may also vary demanding on demand and location. We intended to have orders fulfilled and dispatched in time frames set out below: UK Delivery Address &#8211; 5 to 7 working days EU Delivery Address &#8211; 10 to 14 working days Non-EU Delivery Address &#8211; 10 to 30 working days If you&#8217;re concerned about the status of your order, please contact us. The easiest way to contact us is to reply to your order confirmation email. That we can locate your order quickly. Complaints Procedure Complaints and queries can be made via email, letter or in person. All complaints will receive our immediate attention. We will endeavour to respond with an acknowledgement of receipt within 3 – 5 days. We will aim to resolve any query or complaint to your satisfaction within working 10 days. If the resolution of your complaint involves a new product being dispatched we will advise you of an approximate dispatch and delivery date. During the process we will endeavour to keep you informed as to the progress of the complaint. All complaints are totally confidential. If you have any questions\/comments about privacy or security, you should contact us here. Promotional Offers From time to time we will run promotional offers. Offers are for a limited period only and are subject to availability. Any discounts shown, whether specific amounts or percentages off, apply to the value of the goods and not the delivery charge. Returns and Refunds If the produced order does not meet your expectations, you must first contact Care4Calais within 30 days of product delivery. In order to best resolve the matter, you should provide all relevant materials for Care4Calais to investigate the issue, including a description of the Produced Order, the issue, and quantity of products affected. Within your email please include the following: Your Order Reference Number Item(s) concerned Your full name as detailed on your order A daytime contact number The issue with the goods purchased (ie. wrong item, not compatible, faulty, not required, not what I wanted). Please advise if the goods are: unopened and unused, opened and unused, used and undamaged, used with wear. A representative from Care4Calais will contact you in relation to the next steps. Products are unique and produced to order, therefore, they are non-refundable. Once an Order has been sent to production it is sent to the Provider you can no longer edit the details of the Order or cancel it. If the shipment details are incorrect, or the you have ordered the wrong size or colour, Care4Calais is not responsible and will not offer replacements or refunds. After investigating your issue, if Care4Calais determines that your product is faulty, your orders will be submitted for either reprint or replacement. Refunds are only provided if a subsequent reprint or replacement is also found to be faulty by Care4Calais. Refunds will be issued by the payment method originally used to place the order. &nbsp;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":19942,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/11146"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=11146"}],"version-history":[{"count":8,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/11146\/revisions"}],"predecessor-version":[{"id":42260,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/11146\/revisions\/42260"}],"up":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/19942"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=11146"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}