{"id":22865,"date":"2020-10-11T18:05:51","date_gmt":"2020-10-11T18:05:51","guid":{"rendered":"https:\/\/care4calais.org\/?page_id=22865"},"modified":"2020-10-11T18:12:58","modified_gmt":"2020-10-11T18:12:58","slug":"case-study-kirstie","status":"publish","type":"page","link":"https:\/\/care4calais.org\/case-studies\/case-study-kirstie\/","title":{"rendered":"Case Study &#8211; Kirstie"},"content":{"rendered":"<p style=\"font-weight: 400;\">When we first found out about refugees being in a local hotel, we were linked with just one refugee in need of some shoes and clothes. Now we have discovered more than 150 refugees who have been placed in hotels locally to us and built up connections where we need them.<\/p>\n<p style=\"font-weight: 400;\">On our first visit, we asked lots of questions &#8211; the refugee we met was able to tell us how many people were staying in the same  hotel as him and also of another hotel locally. We used this first visit as an opportunity to introduce ourselves to the hotel. We explained how we might be able to help, initially by providing clothes and necessities. I asked if they would be happy for us to complete a distribution (I explained to them how we do these in Calais) and they offered us a space in the hotel to deliver clothes.<\/p>\n<p style=\"font-weight: 400;\">I then made contact with the other hotel we had heard about and again introduced myself and our ideas. We visited the hotel and were lucky enough to speak to the accommodation manager who was responsible for the care of the refugees at the hotel. Again, we spoke about how we could help them to distribute clothes and connect people with local services. Having already tried to contact several charities themselves they were pleased to have the support.<\/p>\n<p style=\"font-weight: 400;\">We arranged a date to come back with more clothes and we used a function room at the hotel which they kindly gave us free of charge (we requested this and it was agreed). We made a commitment to return weekly on the same day and time, so that the hotel staff and refugees knew they could rely on us for support.<\/p>\n<p style=\"font-weight: 400;\">My advice is to be open with the hotels and accommodation managers &#8211; communicate with them regularly and build up a relationship. We swapped phone numbers so that they could text us when there were new arrivals and we could let them know when we could visit. We helped them when they had new challenges, such as babies arriving, or someone who needed to see a dentist. It made their jobs easier and it helped us to give support in an organised way.<\/p>\n<p style=\"font-weight: 400;\">The accommodation managers now support us on every distribution by organising everyone to come to us gradually, help with communication and organise the refugees that have requested something specific from us. We’re now thinking about how we can deliver English lessons together &#8211; with them offering the space and us offering the language skills. Having an ally in the hotels and accommodation managers really does lead to very successful distributions and support being accessible to the refugees.<\/p>\n<p style=\"font-weight: 400;\"><em><strong>Kirstie; supporting the hotels in Bedfordshire<\/strong><\/em><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-medium wp-image-22866 aligncenter\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/142f116b-501c-4ede-91a8-74b1c44a72241-275x300.jpg\" alt=\"\" width=\"275\" height=\"300\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/142f116b-501c-4ede-91a8-74b1c44a72241-275x300.jpg 275w, https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/142f116b-501c-4ede-91a8-74b1c44a72241-768x836.jpg 768w, https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/142f116b-501c-4ede-91a8-74b1c44a72241-940x1024.jpg 940w, https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/142f116b-501c-4ede-91a8-74b1c44a72241.jpg 1011w\" sizes=\"(max-width: 275px) 100vw, 275px\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>When we first found out about refugees being in a local hotel, we were linked with just one refugee in need of some shoes and clothes. Now we have discovered more than 150 refugees who have been placed in hotels locally to us and built up connections where we need them. On our first visit, we asked lots of questions &#8211; the refugee we met was able to tell us how many people were staying in the same  hotel as him and also of another hotel locally. We used this first visit as an opportunity to introduce ourselves to the hotel. We explained how we might be able to help, initially by providing clothes and necessities. I asked if they would be happy for us to complete a distribution (I explained to them how we do these in Calais) and they offered us a space in the hotel to deliver clothes. I then made contact with the other hotel we had heard about and again introduced myself and our ideas. We visited the hotel and were lucky enough to speak to the accommodation manager who was responsible for the care of the refugees at the hotel. Again, we spoke about how we could help them to distribute clothes and connect people with local services. Having already tried to contact several charities themselves they were pleased to have the support. We arranged a date to come back with more clothes and we used a function room at the hotel which they kindly gave us free of charge (we requested this and it was agreed). We made a commitment to return weekly on the same day and time, so that the hotel staff and refugees knew they could rely on us for support. My advice is to be open with the hotels and accommodation managers &#8211; communicate with them regularly and build up a relationship. We swapped phone numbers so that they could text us when there were new arrivals and we could let them know when we could visit. We helped them when they had new challenges, such as babies arriving, or someone who needed to see a dentist. It made their jobs easier and it helped us to give support in an organised way. The accommodation managers now support us on every distribution by organising everyone to come to us gradually, help with communication and organise the refugees that have requested something specific from us. We’re now thinking about how we can deliver English lessons together &#8211; with them offering the space and us offering the language skills. Having an ally in the hotels and accommodation managers really does lead to very successful distributions and support being accessible to the refugees. Kirstie; supporting the hotels in Bedfordshire<\/p>\n","protected":false},"author":1,"featured_media":22866,"parent":7321,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/22865"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=22865"}],"version-history":[{"count":4,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/22865\/revisions"}],"predecessor-version":[{"id":22872,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/22865\/revisions\/22872"}],"up":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/7321"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/22866"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=22865"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}