{"id":22870,"date":"2020-10-11T18:10:24","date_gmt":"2020-10-11T18:10:24","guid":{"rendered":"https:\/\/care4calais.org\/?page_id=22870"},"modified":"2020-10-11T19:21:24","modified_gmt":"2020-10-11T19:21:24","slug":"case-study-clare","status":"publish","type":"page","link":"https:\/\/care4calais.org\/case-studies\/case-study-clare\/","title":{"rendered":"Case Study &#8211; Clare"},"content":{"rendered":"<p style=\"font-weight: 400;\">When I found out there were people living in desperate conditions just a few miles away from my own house, I got in touch with Care4Calais and was added to their local volunteering group in my area. There I was able to read about the issues that refugees were having. I realised how deep the problem runs – so many people had nothing to wear, many had lost their phones, some didn’t even have shoes.<\/p>\n<p style=\"font-weight: 400;\">One man who needed clothes lived nearby, so I phoned him up and we met at his hotel. Through him I was able to find out there were around 60 people living there, and he helped me put together a list of the essential things people needed.<\/p>\n<p style=\"font-weight: 400;\">I returned to the hotel a few days later with bags full of clothes donated by friends and family. But because I knew I couldn’t keep this up alone, I reached out for help. My son set up an online fundraiser on <strong><a href=\"https:\/\/www.goldengiving.com\/wall\/care4calais\" target=\"_blank\" rel=\"noopener\">GoldenGiving<\/a><\/strong> and several of my friends got in touch with local community groups and shops that might be able to help. Members of my family even pitched in to sort out clothes and distribute them at the hotel with me.<\/p>\n<p style=\"font-weight: 400;\">We started building a good rapport with the hotel managers as a result, and the first distribution went great. We chatted to lots of different people and tried to help as much as possible, from giving young men rucksacks they could use in college to helping a man who was granted leave to remain but has nowhere to go.<\/p>\n<p style=\"font-weight: 400;\">It was hard work, but not impossible: people have been astoundingly generous. We’ve raised almost £1,200 and my living room is filling up every week with bags of good-quality, clean, sensible clothes. At a time when the far right is making so much unpleasant noise, friends and neighbours have been only too happy to be able to contribute to something positive.<\/p>\n<p style=\"font-weight: 400;\"><em><strong> Clare Patterson; supporting the hotels in South London<\/strong><\/em><\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-22883\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/care4calais-case-study-clare-225x300.jpeg\" alt=\"\" width=\"225\" height=\"300\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/care4calais-case-study-clare-225x300.jpeg 225w, https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/care4calais-case-study-clare-768x1024.jpeg 768w, https:\/\/care4calais.org\/wp-content\/uploads\/2020\/10\/care4calais-case-study-clare.jpeg 1200w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>When I found out there were people living in desperate conditions just a few miles away from my own house, I got in touch with Care4Calais and was added to their local volunteering group in my area. There I was able to read about the issues that refugees were having. I realised how deep the problem runs – so many people had nothing to wear, many had lost their phones, some didn’t even have shoes. One man who needed clothes lived nearby, so I phoned him up and we met at his hotel. Through him I was able to find out there were around 60 people living there, and he helped me put together a list of the essential things people needed. I returned to the hotel a few days later with bags full of clothes donated by friends and family. But because I knew I couldn’t keep this up alone, I reached out for help. My son set up an online fundraiser on GoldenGiving and several of my friends got in touch with local community groups and shops that might be able to help. Members of my family even pitched in to sort out clothes and distribute them at the hotel with me. We started building a good rapport with the hotel managers as a result, and the first distribution went great. We chatted to lots of different people and tried to help as much as possible, from giving young men rucksacks they could use in college to helping a man who was granted leave to remain but has nowhere to go. It was hard work, but not impossible: people have been astoundingly generous. We’ve raised almost £1,200 and my living room is filling up every week with bags of good-quality, clean, sensible clothes. At a time when the far right is making so much unpleasant noise, friends and neighbours have been only too happy to be able to contribute to something positive.  Clare Patterson; supporting the hotels in South London &nbsp;<\/p>\n","protected":false},"author":1,"featured_media":22883,"parent":7321,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/22870"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=22870"}],"version-history":[{"count":2,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/22870\/revisions"}],"predecessor-version":[{"id":22884,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/22870\/revisions\/22884"}],"up":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/7321"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/22883"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=22870"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}