{"id":25043,"date":"2021-02-27T18:01:00","date_gmt":"2021-02-27T18:01:00","guid":{"rendered":"https:\/\/care4calais.org\/?page_id=25043"},"modified":"2021-03-14T20:29:27","modified_gmt":"2021-03-14T20:29:27","slug":"uk-hotels-direct-aid","status":"publish","type":"page","link":"https:\/\/care4calais.org\/about-us\/what-we-do\/uk-hotels-direct-aid\/","title":{"rendered":"UK: Direct Aid"},"content":{"rendered":"<div class=\"wpb-content-wrapper\"><p>[vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;4\/6&#8243;][vc_column_text]<img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-25045 size-full\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/Hotel-distrb-1.jpg\" alt=\"\" width=\"960\" height=\"640\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/Hotel-distrb-1.jpg 960w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/Hotel-distrb-1-300x200.jpg 300w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/Hotel-distrb-1-768x512.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p>When asylum-seekers arrive in the UK they are often housed in large hotels while waiting for their claims to be processed. There are an estimated 10,000 people housed in 100 such properties around the UK as the lengthy backlog in asylum processing and lack of suitable housing exacerbates the issue.<\/p>\n<p>They are often lacking in the basics – a pair of shoes, a winter coat, wholesome food. Our UK volunteers help to provide as much of this as they can, as well as being a friendly face and giving assistance with more complex health or immigration issues.<\/p>\n<p>Care4Calais currently supports approximately 3,500 asylum-seekers in 40 hotels around the UK and we have also been instrumental in highlighting the unsuitable conditions in barracks used to house hundreds of vulnerable men.<\/p>\n<p>While the hotels are better than the barracks, there is very little support available to those housed there and so our wonderful UK volunteers organise regular distributions to provide shoes (often asylum seeker only have flip-flops, even in winter) warm coats, new underwear and clothing, toiletries, toys and books for children, and sometimes fresh fruit and snacks.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-25044 size-full\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/distrb.-2.jpg\" alt=\"\" width=\"960\" height=\"960\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/distrb.-2.jpg 960w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/distrb.-2-300x300.jpg 300w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/distrb.-2-150x150.jpg 150w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/distrb.-2-768x768.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/p>\n<p><strong><em>“Thank you for the books my children love them – they are very happy and we are happy with the warm clothes very much”<\/em><\/strong><\/p>\n<p>We also help get people registered with doctors, signpost refugees to legal teams that can help with their asylum claims, provide language learning resources and group activities, as well as help get young people into schools. We provide welcoming and friendly support for these most vulnerable members of our society, in order to counter the ‘hostile’ narrative and because we simply believe it is the humane thing to do.<\/p>\n<p><strong>If, like thousands of others in the Care4Calais community you agree, why not <a href=\"https:\/\/care4calais.org\/get-involved\/volunteer-in-the-uk\/\" target=\"_blank\" rel=\"noopener noreferrer\">VOLUNTEER<\/a> or <a href=\"https:\/\/care4calais.org\/donate-now\/\" target=\"_blank\" rel=\"noopener noreferrer\">DONATE?<\/a><\/strong><\/p>\n<p><strong><em>“As a volunteer, this is the best bit of my week. Getting to spend time with the (hotel) residents is so special and so much fun. Even when it rained, we had a good time playing football. Last Saturday we had a distribution running at the same time as activities”<\/em><\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row]<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;4\/6&#8243;][vc_column_text] When asylum-seekers arrive in the UK they are often housed in large hotels while waiting for their claims to be processed. There are an estimated 10,000 people housed in 100 such properties around the UK as the lengthy backlog in asylum processing and lack of suitable housing exacerbates the issue. They are often lacking in the basics – a pair of shoes, a winter coat, wholesome food. Our UK volunteers help to provide as much of this as they can, as well as being a friendly face and giving assistance with more complex health or immigration issues. Care4Calais currently supports approximately 3,500 asylum-seekers in 40 hotels around the UK and we have also been instrumental in highlighting the unsuitable conditions in barracks used to house hundreds of vulnerable men. While the hotels are better than the barracks, there is very little support available to those housed there and so our wonderful UK volunteers organise regular distributions to provide shoes (often asylum seeker only have flip-flops, even in winter) warm coats, new underwear and clothing, toiletries, toys and books for children, and sometimes fresh fruit and snacks. “Thank you for the books my children love them – they are very happy and we are happy with the warm clothes very much” We also help get people registered with doctors, signpost refugees to legal teams that can help with their asylum claims, provide language learning resources and group activities, as well as help get young people into schools. We provide welcoming and friendly support for these most vulnerable members of our society, in order to counter the ‘hostile’ narrative and because we simply believe it is the humane thing to do. If, like thousands of others in the Care4Calais community you agree, why not VOLUNTEER or DONATE? “As a volunteer, this is the best bit of my week. Getting to spend time with the (hotel) residents is so special and so much fun. Even when it rained, we had a good time playing football. Last Saturday we had a distribution running at the same time as activities” &nbsp; [\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row]<\/p>\n","protected":false},"author":1,"featured_media":25045,"parent":7044,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/25043"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=25043"}],"version-history":[{"count":14,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/25043\/revisions"}],"predecessor-version":[{"id":25328,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/25043\/revisions\/25328"}],"up":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/7044"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/25045"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=25043"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}