{"id":25059,"date":"2021-02-27T18:01:03","date_gmt":"2021-02-27T17:01:03","guid":{"rendered":"https:\/\/care4calais.org\/?page_id=25059"},"modified":"2023-12-06T15:40:49","modified_gmt":"2023-12-06T14:40:49","slug":"uk-access-to-legal-support","status":"publish","type":"page","link":"https:\/\/care4calais.org\/about-us\/what-we-do\/uk-access-to-legal-support\/","title":{"rendered":"UK &#8211; Access to Legal Support"},"content":{"rendered":"<div class=\"wpb-content-wrapper\"><p>[vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;4\/6&#8243;][vc_column_text]<img loading=\"lazy\" decoding=\"async\" class=\"wp-image-25042 size-full aligncenter\" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/c4c-aid-2.jpg\" alt=\"\" width=\"895\" height=\"687\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/c4c-aid-2.jpg 895w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/c4c-aid-2-300x230.jpg 300w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/c4c-aid-2-768x590.jpg 768w\" sizes=\"(max-width: 895px) 100vw, 895px\" \/><\/p>\n<p>Often crippled with lengthy delays and a serious lack of support for prospective claimants, the UK immigration system can be overwhelming for asylum seekers.<\/p>\n<p>Our Access Team consists of specially trained volunteers who can help vulnerable asylum seekers organise what they need to begin the process. We make the immigration system accessible and fair, providing interpreters, collating paperwork and liaising with legal teams.<\/p>\n<p>When refugees arrive in the UK, they can be overwhelmed. This is what they&#8217;ve been thinking about for months or years &#8211; getting to safety in the UK and rebuilding their lives &#8211; but they arrive and can feel as though they are treated like criminals, placed in poor accommodations for months on end and facing confusing and hostile bureaucracy while they try to claim asylum.<\/p>\n<p>Refugees who have legal advice have a better chance of getting asylum fairly and efficiently but they need a lawyer who can help them via legal aid. Many don’t know of their right to legal aid lawyers, some may have had their phones confiscated by the Home Office, others not be able to find one alone, for example if they cannot read or write English. Our Access Team are specially trained volunteers who can help vulnerable asylum seekers organise what they need to begin seeking asylum: We signpost them to specialist solicitors, we have a team of volunteer interpreters, we help them organise paperwork. We currently work with 40 legal firms around the UK providing an invaluable service to both the asylum-seeker and the overstretched legal immigration teams.<\/p>\n<p>Our amazing Access Team simply supports people to get the advice and legal aid they are entitled to, and make the entire process more efficient for legal teams and less daunting for vulnerable asylum seekers.<\/p>\n<p><strong><em>“Thank you for hearing about my problem. I haven’t spoken to anyone in a long time. I feel better to have someone who cares. The lawyer told me that they would help me with everything – thank you very much”<\/em><\/strong><\/p>\n<p><strong><em>Messages from Asylum seekers moved from unsuitable barracks accommodation after support from our Access Team:<\/em><\/strong><em>  “Today I was transferred to a hotel in London. Thank you very much. You have done a lot for me. Today I spoke to my family for 5 hours – before I had no privacy or anything. I am very happy today. The camp is like a prison, now I am free. I will try to forget the past and start a new beginning. Thank you for being at my side and for helping” <\/em><\/p>\n<p><strong>Would you like to find out more about our <a href=\"https:\/\/care4calais.org\/get-involved\/supporting-refugees-in-the-uk\/\">Access Team<\/a>, or <a href=\"https:\/\/care4calais.org\/donate-now\/\">donate<\/a> to help refugee’s asylum rights?<\/strong><\/p>\n<p><strong>Rachel Harger, Human Rights Lawyer with Bindemans LLP:<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-25060 \" src=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/Rachel-Harger-Tweet-e1613423707882.jpg\" alt=\"\" width=\"524\" height=\"579\" srcset=\"https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/Rachel-Harger-Tweet-e1613423707882.jpg 726w, https:\/\/care4calais.org\/wp-content\/uploads\/2021\/02\/Rachel-Harger-Tweet-e1613423707882-272x300.jpg 272w\" sizes=\"(max-width: 524px) 100vw, 524px\" \/>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row]<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;4\/6&#8243;][vc_column_text] Often crippled with lengthy delays and a serious lack of support for prospective claimants, the UK immigration system can be overwhelming for asylum seekers. Our Access Team consists of specially trained volunteers who can help vulnerable asylum seekers organise what they need to begin the process. We make the immigration system accessible and fair, providing interpreters, collating paperwork and liaising with legal teams. When refugees arrive in the UK, they can be overwhelmed. This is what they&#8217;ve been thinking about for months or years &#8211; getting to safety in the UK and rebuilding their lives &#8211; but they arrive and can feel as though they are treated like criminals, placed in poor accommodations for months on end and facing confusing and hostile bureaucracy while they try to claim asylum. Refugees who have legal advice have a better chance of getting asylum fairly and efficiently but they need a lawyer who can help them via legal aid. Many don’t know of their right to legal aid lawyers, some may have had their phones confiscated by the Home Office, others not be able to find one alone, for example if they cannot read or write English. Our Access Team are specially trained volunteers who can help vulnerable asylum seekers organise what they need to begin seeking asylum: We signpost them to specialist solicitors, we have a team of volunteer interpreters, we help them organise paperwork. We currently work with 40 legal firms around the UK providing an invaluable service to both the asylum-seeker and the overstretched legal immigration teams. Our amazing Access Team simply supports people to get the advice and legal aid they are entitled to, and make the entire process more efficient for legal teams and less daunting for vulnerable asylum seekers. “Thank you for hearing about my problem. I haven’t spoken to anyone in a long time. I feel better to have someone who cares. The lawyer told me that they would help me with everything – thank you very much” Messages from Asylum seekers moved from unsuitable barracks accommodation after support from our Access Team:  “Today I was transferred to a hotel in London. Thank you very much. You have done a lot for me. Today I spoke to my family for 5 hours – before I had no privacy or anything. I am very happy today. The camp is like a prison, now I am free. I will try to forget the past and start a new beginning. Thank you for being at my side and for helping” Would you like to find out more about our Access Team, or donate to help refugee’s asylum rights? Rachel Harger, Human Rights Lawyer with Bindemans LLP: [\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row]<\/p>\n","protected":false},"author":1,"featured_media":25042,"parent":7044,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/25059"}],"collection":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/comments?post=25059"}],"version-history":[{"count":3,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/25059\/revisions"}],"predecessor-version":[{"id":25331,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/25059\/revisions\/25331"}],"up":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/pages\/7044"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media\/25042"}],"wp:attachment":[{"href":"https:\/\/care4calais.org\/wp-json\/wp\/v2\/media?parent=25059"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}